let areaDatas = {};
let province_list = {};
let city_list = {};
let county_list = {};
[
  {
    "name": "北京市",
    "code": "11",
    "sub": [
      {
        "name": "北京城区",
        "code": "010",
        "sub": [
          {
            "name": "东城区",
            "code": "010"
          },
          {
            "name": "西城区",
            "code": "010"
          },
          {
            "name": "朝阳区",
            "code": "010"
          },
          {
            "name": "丰台区",
            "code": "010"
          },
          {
            "name": "石景山区",
            "code": "010"
          },
          {
            "name": "海淀区",
            "code": "010"
          },
          {
            "name": "门头沟区",
            "code": "010"
          },
          {
            "name": "房山区",
            "code": "010"
          },
          {
            "name": "通州区",
            "code": "010"
          },
          {
            "name": "顺义区",
            "code": "010"
          },
          {
            "name": "昌平区",
            "code": "010"
          },
          {
            "name": "大兴区",
            "code": "010"
          },
          {
            "name": "怀柔区",
            "code": "010"
          },
          {
            "name": "平谷区",
            "code": "010"
          },
          {
            "name": "密云区",
            "code": "010"
          },
          {
            "name": "延庆区",
            "code": "010"
          }
        ]
      }
    ]
  },
  {
    "name": "天津市",
    "code": "12",
    "sub": [
      {
        "name": "天津城区",
        "code": "022",
        "sub": [
          {
            "name": "和平区",
            "code": "022"
          },
          {
            "name": "河东区",
            "code": "022"
          },
          {
            "name": "河西区",
            "code": "022"
          },
          {
            "name": "南开区",
            "code": "022"
          },
          {
            "name": "河北区",
            "code": "022"
          },
          {
            "name": "红桥区",
            "code": "022"
          },
          {
            "name": "东丽区",
            "code": "022"
          },
          {
            "name": "西青区",
            "code": "022"
          },
          {
            "name": "津南区",
            "code": "022"
          },
          {
            "name": "北辰区",
            "code": "022"
          },
          {
            "name": "武清区",
            "code": "022"
          },
          {
            "name": "宝坻区",
            "code": "022"
          },
          {
            "name": "滨海新区",
            "code": "022"
          },
          {
            "name": "宁河区",
            "code": "022"
          },
          {
            "name": "静海区",
            "code": "022"
          },
          {
            "name": "蓟州区",
            "code": "022"
          }
        ]
      }
    ]
  },
  {
    "name": "河北省",
    "code": "13",
    "sub": [
      {
        "name": "石家庄市",
        "code": "0311",
        "sub": [
          {
            "name": "长安区",
            "code": "0311"
          },
          {
            "name": "桥西区",
            "code": "0311"
          },
          {
            "name": "新华区",
            "code": "0311"
          },
          {
            "name": "井陉矿区",
            "code": "0311"
          },
          {
            "name": "裕华区",
            "code": "0311"
          },
          {
            "name": "藁城区",
            "code": "0311"
          },
          {
            "name": "鹿泉区",
            "code": "0311"
          },
          {
            "name": "栾城区",
            "code": "0311"
          },
          {
            "name": "井陉县",
            "code": "0311"
          },
          {
            "name": "正定县",
            "code": "0311"
          },
          {
            "name": "行唐县",
            "code": "0311"
          },
          {
            "name": "灵寿县",
            "code": "0311"
          },
          {
            "name": "高邑县",
            "code": "0311"
          },
          {
            "name": "深泽县",
            "code": "0311"
          },
          {
            "name": "赞皇县",
            "code": "0311"
          },
          {
            "name": "无极县",
            "code": "0311"
          },
          {
            "name": "平山县",
            "code": "0311"
          },
          {
            "name": "元氏县",
            "code": "0311"
          },
          {
            "name": "赵县",
            "code": "0311"
          },
          {
            "name": "辛集市",
            "code": "0311"
          },
          {
            "name": "晋州市",
            "code": "0311"
          },
          {
            "name": "新乐市",
            "code": "0311"
          }
        ]
      },
      {
        "name": "唐山市",
        "code": "0315",
        "sub": [
          {
            "name": "路南区",
            "code": "0315"
          },
          {
            "name": "路北区",
            "code": "0315"
          },
          {
            "name": "古冶区",
            "code": "0315"
          },
          {
            "name": "开平区",
            "code": "0315"
          },
          {
            "name": "丰南区",
            "code": "0315"
          },
          {
            "name": "丰润区",
            "code": "0315"
          },
          {
            "name": "曹妃甸区",
            "code": "0315"
          },
          {
            "name": "滦县",
            "code": "0315"
          },
          {
            "name": "滦南县",
            "code": "0315"
          },
          {
            "name": "乐亭县",
            "code": "0315"
          },
          {
            "name": "迁西县",
            "code": "0315"
          },
          {
            "name": "玉田县",
            "code": "0315"
          },
          {
            "name": "遵化市",
            "code": "0315"
          },
          {
            "name": "迁安市",
            "code": "0315"
          }
        ]
      },
      {
        "name": "秦皇岛市",
        "code": "0335",
        "sub": [
          {
            "name": "海港区",
            "code": "0335"
          },
          {
            "name": "山海关区",
            "code": "0335"
          },
          {
            "name": "北戴河区",
            "code": "0335"
          },
          {
            "name": "抚宁区",
            "code": "0335"
          },
          {
            "name": "青龙满族自治县",
            "code": "0335"
          },
          {
            "name": "昌黎县",
            "code": "0335"
          },
          {
            "name": "卢龙县",
            "code": "0335"
          }
        ]
      },
      {
        "name": "邯郸市",
        "code": "0310",
        "sub": [
          {
            "name": "邯山区",
            "code": "0310"
          },
          {
            "name": "丛台区",
            "code": "0310"
          },
          {
            "name": "复兴区",
            "code": "0310"
          },
          {
            "name": "峰峰矿区",
            "code": "0310"
          },
          {
            "name": "临漳县",
            "code": "0310"
          },
          {
            "name": "成安县",
            "code": "0310"
          },
          {
            "name": "大名县",
            "code": "0310"
          },
          {
            "name": "涉县",
            "code": "0310"
          },
          {
            "name": "磁县",
            "code": "0310"
          },
          {
            "name": "肥乡区",
            "code": "0310"
          },
          {
            "name": "永年区",
            "code": "0310"
          },
          {
            "name": "邱县",
            "code": "0310"
          },
          {
            "name": "鸡泽县",
            "code": "0310"
          },
          {
            "name": "广平县",
            "code": "0310"
          },
          {
            "name": "馆陶县",
            "code": "0310"
          },
          {
            "name": "魏县",
            "code": "0310"
          },
          {
            "name": "曲周县",
            "code": "0310"
          },
          {
            "name": "武安市",
            "code": "0310"
          }
        ]
      },
      {
        "name": "邢台市",
        "code": "0319",
        "sub": [
          {
            "name": "桥东区",
            "code": "0319"
          },
          {
            "name": "桥西区",
            "code": "0319"
          },
          {
            "name": "邢台县",
            "code": "0319"
          },
          {
            "name": "临城县",
            "code": "0319"
          },
          {
            "name": "内丘县",
            "code": "0319"
          },
          {
            "name": "柏乡县",
            "code": "0319"
          },
          {
            "name": "隆尧县",
            "code": "0319"
          },
          {
            "name": "任县",
            "code": "0319"
          },
          {
            "name": "南和县",
            "code": "0319"
          },
          {
            "name": "宁晋县",
            "code": "0319"
          },
          {
            "name": "巨鹿县",
            "code": "0319"
          },
          {
            "name": "新河县",
            "code": "0319"
          },
          {
            "name": "广宗县",
            "code": "0319"
          },
          {
            "name": "平乡县",
            "code": "0319"
          },
          {
            "name": "威县",
            "code": "0319"
          },
          {
            "name": "清河县",
            "code": "0319"
          },
          {
            "name": "临西县",
            "code": "0319"
          },
          {
            "name": "南宫市",
            "code": "0319"
          },
          {
            "name": "沙河市",
            "code": "0319"
          }
        ]
      },
      {
        "name": "保定市",
        "code": "0312",
        "sub": [
          {
            "name": "竞秀区",
            "code": "0312"
          },
          {
            "name": "莲池区",
            "code": "0312"
          },
          {
            "name": "满城区",
            "code": "0312"
          },
          {
            "name": "清苑区",
            "code": "0312"
          },
          {
            "name": "徐水区",
            "code": "0312"
          },
          {
            "name": "涞水县",
            "code": "0312"
          },
          {
            "name": "阜平县",
            "code": "0312"
          },
          {
            "name": "定兴县",
            "code": "0312"
          },
          {
            "name": "唐县",
            "code": "0312"
          },
          {
            "name": "高阳县",
            "code": "0312"
          },
          {
            "name": "容城县",
            "code": "0312"
          },
          {
            "name": "涞源县",
            "code": "0312"
          },
          {
            "name": "望都县",
            "code": "0312"
          },
          {
            "name": "安新县",
            "code": "0312"
          },
          {
            "name": "易县",
            "code": "0312"
          },
          {
            "name": "曲阳县",
            "code": "0312"
          },
          {
            "name": "蠡县",
            "code": "0312"
          },
          {
            "name": "顺平县",
            "code": "0312"
          },
          {
            "name": "博野县",
            "code": "0312"
          },
          {
            "name": "雄县",
            "code": "0312"
          },
          {
            "name": "涿州市",
            "code": "0312"
          },
          {
            "name": "定州市",
            "code": "0312"
          },
          {
            "name": "安国市",
            "code": "0312"
          },
          {
            "name": "高碑店市",
            "code": "0312"
          }
        ]
      },
      {
        "name": "张家口市",
        "code": "0313",
        "sub": [
          {
            "name": "桥东区",
            "code": "0313"
          },
          {
            "name": "桥西区",
            "code": "0313"
          },
          {
            "name": "宣化区",
            "code": "0313"
          },
          {
            "name": "下花园区",
            "code": "0313"
          },
          {
            "name": "万全区",
            "code": "0313"
          },
          {
            "name": "崇礼区",
            "code": "0313"
          },
          {
            "name": "张北县",
            "code": "0313"
          },
          {
            "name": "康保县",
            "code": "0313"
          },
          {
            "name": "沽源县",
            "code": "0313"
          },
          {
            "name": "尚义县",
            "code": "0313"
          },
          {
            "name": "蔚县",
            "code": "0313"
          },
          {
            "name": "阳原县",
            "code": "0313"
          },
          {
            "name": "怀安县",
            "code": "0313"
          },
          {
            "name": "怀来县",
            "code": "0313"
          },
          {
            "name": "涿鹿县",
            "code": "0313"
          },
          {
            "name": "赤城县",
            "code": "0313"
          }
        ]
      },
      {
        "name": "承德市",
        "code": "0314",
        "sub": [
          {
            "name": "双桥区",
            "code": "0314"
          },
          {
            "name": "双滦区",
            "code": "0314"
          },
          {
            "name": "鹰手营子矿区",
            "code": "0314"
          },
          {
            "name": "承德县",
            "code": "0314"
          },
          {
            "name": "兴隆县",
            "code": "0314"
          },
          {
            "name": "平泉市",
            "code": "0314"
          },
          {
            "name": "滦平县",
            "code": "0314"
          },
          {
            "name": "隆化县",
            "code": "0314"
          },
          {
            "name": "丰宁满族自治县",
            "code": "0314"
          },
          {
            "name": "宽城满族自治县",
            "code": "0314"
          },
          {
            "name": "围场满族蒙古族自治县",
            "code": "0314"
          }
        ]
      },
      {
        "name": "沧州市",
        "code": "0317",
        "sub": [
          {
            "name": "新华区",
            "code": "0317"
          },
          {
            "name": "运河区",
            "code": "0317"
          },
          {
            "name": "沧县",
            "code": "0317"
          },
          {
            "name": "青县",
            "code": "0317"
          },
          {
            "name": "东光县",
            "code": "0317"
          },
          {
            "name": "海兴县",
            "code": "0317"
          },
          {
            "name": "盐山县",
            "code": "0317"
          },
          {
            "name": "肃宁县",
            "code": "0317"
          },
          {
            "name": "南皮县",
            "code": "0317"
          },
          {
            "name": "吴桥县",
            "code": "0317"
          },
          {
            "name": "献县",
            "code": "0317"
          },
          {
            "name": "孟村回族自治县",
            "code": "0317"
          },
          {
            "name": "泊头市",
            "code": "0317"
          },
          {
            "name": "任丘市",
            "code": "0317"
          },
          {
            "name": "黄骅市",
            "code": "0317"
          },
          {
            "name": "河间市",
            "code": "0317"
          }
        ]
      },
      {
        "name": "廊坊市",
        "code": "0316",
        "sub": [
          {
            "name": "安次区",
            "code": "0316"
          },
          {
            "name": "广阳区",
            "code": "0316"
          },
          {
            "name": "固安县",
            "code": "0316"
          },
          {
            "name": "永清县",
            "code": "0316"
          },
          {
            "name": "香河县",
            "code": "0316"
          },
          {
            "name": "大城县",
            "code": "0316"
          },
          {
            "name": "文安县",
            "code": "0316"
          },
          {
            "name": "大厂回族自治县",
            "code": "0316"
          },
          {
            "name": "霸州市",
            "code": "0316"
          },
          {
            "name": "三河市",
            "code": "0316"
          }
        ]
      },
      {
        "name": "衡水市",
        "code": "0318",
        "sub": [
          {
            "name": "桃城区",
            "code": "0318"
          },
          {
            "name": "冀州区",
            "code": "0318"
          },
          {
            "name": "枣强县",
            "code": "0318"
          },
          {
            "name": "武邑县",
            "code": "0318"
          },
          {
            "name": "武强县",
            "code": "0318"
          },
          {
            "name": "饶阳县",
            "code": "0318"
          },
          {
            "name": "安平县",
            "code": "0318"
          },
          {
            "name": "故城县",
            "code": "0318"
          },
          {
            "name": "景县",
            "code": "0318"
          },
          {
            "name": "阜城县",
            "code": "0318"
          },
          {
            "name": "深州市",
            "code": "0318"
          }
        ]
      }
    ]
  },
  {
    "name": "山西省",
    "code": "14",
    "sub": [
      {
        "name": "太原市",
        "code": "0351",
        "sub": [
          {
            "name": "小店区",
            "code": "0351"
          },
          {
            "name": "迎泽区",
            "code": "0351"
          },
          {
            "name": "杏花岭区",
            "code": "0351"
          },
          {
            "name": "尖草坪区",
            "code": "0351"
          },
          {
            "name": "万柏林区",
            "code": "0351"
          },
          {
            "name": "晋源区",
            "code": "0351"
          },
          {
            "name": "清徐县",
            "code": "0351"
          },
          {
            "name": "阳曲县",
            "code": "0351"
          },
          {
            "name": "娄烦县",
            "code": "0351"
          },
          {
            "name": "古交市",
            "code": "0351"
          }
        ]
      },
      {
        "name": "大同市",
        "code": "0352",
        "sub": [
          {
            "name": "城区",
            "code": "0352"
          },
          {
            "name": "矿区",
            "code": "0352"
          },
          {
            "name": "南郊区",
            "code": "0352"
          },
          {
            "name": "新荣区",
            "code": "0352"
          },
          {
            "name": "阳高县",
            "code": "0352"
          },
          {
            "name": "天镇县",
            "code": "0352"
          },
          {
            "name": "广灵县",
            "code": "0352"
          },
          {
            "name": "灵丘县",
            "code": "0352"
          },
          {
            "name": "浑源县",
            "code": "0352"
          },
          {
            "name": "左云县",
            "code": "0352"
          },
          {
            "name": "大同县",
            "code": "0352"
          }
        ]
      },
      {
        "name": "阳泉市",
        "code": "0353",
        "sub": [
          {
            "name": "城区",
            "code": "0353"
          },
          {
            "name": "矿区",
            "code": "0353"
          },
          {
            "name": "郊区",
            "code": "0353"
          },
          {
            "name": "平定县",
            "code": "0353"
          },
          {
            "name": "盂县",
            "code": "0353"
          }
        ]
      },
      {
        "name": "长治市",
        "code": "0355",
        "sub": [
          {
            "name": "城区",
            "code": "0355"
          },
          {
            "name": "郊区",
            "code": "0355"
          },
          {
            "name": "长治县",
            "code": "0355"
          },
          {
            "name": "襄垣县",
            "code": "0355"
          },
          {
            "name": "屯留县",
            "code": "0355"
          },
          {
            "name": "平顺县",
            "code": "0355"
          },
          {
            "name": "黎城县",
            "code": "0355"
          },
          {
            "name": "壶关县",
            "code": "0355"
          },
          {
            "name": "长子县",
            "code": "0355"
          },
          {
            "name": "武乡县",
            "code": "0355"
          },
          {
            "name": "沁县",
            "code": "0355"
          },
          {
            "name": "沁源县",
            "code": "0355"
          },
          {
            "name": "潞城市",
            "code": "0355"
          }
        ]
      },
      {
        "name": "晋城市",
        "code": "0356",
        "sub": [
          {
            "name": "城区",
            "code": "0356"
          },
          {
            "name": "沁水县",
            "code": "0356"
          },
          {
            "name": "阳城县",
            "code": "0356"
          },
          {
            "name": "陵川县",
            "code": "0356"
          },
          {
            "name": "泽州县",
            "code": "0356"
          },
          {
            "name": "高平市",
            "code": "0356"
          }
        ]
      },
      {
        "name": "朔州市",
        "code": "0349",
        "sub": [
          {
            "name": "朔城区",
            "code": "0349"
          },
          {
            "name": "平鲁区",
            "code": "0349"
          },
          {
            "name": "山阴县",
            "code": "0349"
          },
          {
            "name": "应县",
            "code": "0349"
          },
          {
            "name": "右玉县",
            "code": "0349"
          },
          {
            "name": "怀仁县",
            "code": "0349"
          }
        ]
      },
      {
        "name": "晋中市",
        "code": "0354",
        "sub": [
          {
            "name": "榆次区",
            "code": "0354"
          },
          {
            "name": "榆社县",
            "code": "0354"
          },
          {
            "name": "左权县",
            "code": "0354"
          },
          {
            "name": "和顺县",
            "code": "0354"
          },
          {
            "name": "昔阳县",
            "code": "0354"
          },
          {
            "name": "寿阳县",
            "code": "0354"
          },
          {
            "name": "太谷县",
            "code": "0354"
          },
          {
            "name": "祁县",
            "code": "0354"
          },
          {
            "name": "平遥县",
            "code": "0354"
          },
          {
            "name": "灵石县",
            "code": "0354"
          },
          {
            "name": "介休市",
            "code": "0354"
          }
        ]
      },
      {
        "name": "运城市",
        "code": "0359",
        "sub": [
          {
            "name": "盐湖区",
            "code": "0359"
          },
          {
            "name": "临猗县",
            "code": "0359"
          },
          {
            "name": "万荣县",
            "code": "0359"
          },
          {
            "name": "闻喜县",
            "code": "0359"
          },
          {
            "name": "稷山县",
            "code": "0359"
          },
          {
            "name": "新绛县",
            "code": "0359"
          },
          {
            "name": "绛县",
            "code": "0359"
          },
          {
            "name": "垣曲县",
            "code": "0359"
          },
          {
            "name": "夏县",
            "code": "0359"
          },
          {
            "name": "平陆县",
            "code": "0359"
          },
          {
            "name": "芮城县",
            "code": "0359"
          },
          {
            "name": "永济市",
            "code": "0359"
          },
          {
            "name": "河津市",
            "code": "0359"
          }
        ]
      },
      {
        "name": "忻州市",
        "code": "0350",
        "sub": [
          {
            "name": "忻府区",
            "code": "0350"
          },
          {
            "name": "定襄县",
            "code": "0350"
          },
          {
            "name": "五台县",
            "code": "0350"
          },
          {
            "name": "代县",
            "code": "0350"
          },
          {
            "name": "繁峙县",
            "code": "0350"
          },
          {
            "name": "宁武县",
            "code": "0350"
          },
          {
            "name": "静乐县",
            "code": "0350"
          },
          {
            "name": "神池县",
            "code": "0350"
          },
          {
            "name": "五寨县",
            "code": "0350"
          },
          {
            "name": "岢岚县",
            "code": "0350"
          },
          {
            "name": "河曲县",
            "code": "0350"
          },
          {
            "name": "保德县",
            "code": "0350"
          },
          {
            "name": "偏关县",
            "code": "0350"
          },
          {
            "name": "原平市",
            "code": "0350"
          }
        ]
      },
      {
        "name": "临汾市",
        "code": "0357",
        "sub": [
          {
            "name": "尧都区",
            "code": "0357"
          },
          {
            "name": "曲沃县",
            "code": "0357"
          },
          {
            "name": "翼城县",
            "code": "0357"
          },
          {
            "name": "襄汾县",
            "code": "0357"
          },
          {
            "name": "洪洞县",
            "code": "0357"
          },
          {
            "name": "古县",
            "code": "0357"
          },
          {
            "name": "安泽县",
            "code": "0357"
          },
          {
            "name": "浮山县",
            "code": "0357"
          },
          {
            "name": "吉县",
            "code": "0357"
          },
          {
            "name": "乡宁县",
            "code": "0357"
          },
          {
            "name": "大宁县",
            "code": "0357"
          },
          {
            "name": "隰县",
            "code": "0357"
          },
          {
            "name": "永和县",
            "code": "0357"
          },
          {
            "name": "蒲县",
            "code": "0357"
          },
          {
            "name": "汾西县",
            "code": "0357"
          },
          {
            "name": "侯马市",
            "code": "0357"
          },
          {
            "name": "霍州市",
            "code": "0357"
          }
        ]
      },
      {
        "name": "吕梁市",
        "code": "0358",
        "sub": [
          {
            "name": "离石区",
            "code": "0358"
          },
          {
            "name": "文水县",
            "code": "0358"
          },
          {
            "name": "交城县",
            "code": "0358"
          },
          {
            "name": "兴县",
            "code": "0358"
          },
          {
            "name": "临县",
            "code": "0358"
          },
          {
            "name": "柳林县",
            "code": "0358"
          },
          {
            "name": "石楼县",
            "code": "0358"
          },
          {
            "name": "岚县",
            "code": "0358"
          },
          {
            "name": "方山县",
            "code": "0358"
          },
          {
            "name": "中阳县",
            "code": "0358"
          },
          {
            "name": "交口县",
            "code": "0358"
          },
          {
            "name": "孝义市",
            "code": "0358"
          },
          {
            "name": "汾阳市",
            "code": "0358"
          }
        ]
      }
    ]
  },
  {
    "name": "内蒙古自治区",
    "code": "15",
    "sub": [
      {
        "name": "呼和浩特市",
        "code": "0471",
        "sub": [
          {
            "name": "新城区",
            "code": "0471"
          },
          {
            "name": "回民区",
            "code": "0471"
          },
          {
            "name": "玉泉区",
            "code": "0471"
          },
          {
            "name": "赛罕区",
            "code": "0471"
          },
          {
            "name": "土默特左旗",
            "code": "0471"
          },
          {
            "name": "托克托县",
            "code": "0471"
          },
          {
            "name": "和林格尔县",
            "code": "0471"
          },
          {
            "name": "清水河县",
            "code": "0471"
          },
          {
            "name": "武川县",
            "code": "0471"
          }
        ]
      },
      {
        "name": "包头市",
        "code": "0472",
        "sub": [
          {
            "name": "东河区",
            "code": "0472"
          },
          {
            "name": "昆都仑区",
            "code": "0472"
          },
          {
            "name": "青山区",
            "code": "0472"
          },
          {
            "name": "石拐区",
            "code": "0472"
          },
          {
            "name": "白云鄂博矿区",
            "code": "0472"
          },
          {
            "name": "九原区",
            "code": "0472"
          },
          {
            "name": "土默特右旗",
            "code": "0472"
          },
          {
            "name": "固阳县",
            "code": "0472"
          },
          {
            "name": "达尔罕茂明安联合旗",
            "code": "0472"
          }
        ]
      },
      {
        "name": "乌海市",
        "code": "0473",
        "sub": [
          {
            "name": "海勃湾区",
            "code": "0473"
          },
          {
            "name": "海南区",
            "code": "0473"
          },
          {
            "name": "乌达区",
            "code": "0473"
          }
        ]
      },
      {
        "name": "赤峰市",
        "code": "0476",
        "sub": [
          {
            "name": "红山区",
            "code": "0476"
          },
          {
            "name": "元宝山区",
            "code": "0476"
          },
          {
            "name": "松山区",
            "code": "0476"
          },
          {
            "name": "阿鲁科尔沁旗",
            "code": "0476"
          },
          {
            "name": "巴林左旗",
            "code": "0476"
          },
          {
            "name": "巴林右旗",
            "code": "0476"
          },
          {
            "name": "林西县",
            "code": "0476"
          },
          {
            "name": "克什克腾旗",
            "code": "0476"
          },
          {
            "name": "翁牛特旗",
            "code": "0476"
          },
          {
            "name": "喀喇沁旗",
            "code": "0476"
          },
          {
            "name": "宁城县",
            "code": "0476"
          },
          {
            "name": "敖汉旗",
            "code": "0476"
          }
        ]
      },
      {
        "name": "通辽市",
        "code": "0475",
        "sub": [
          {
            "name": "科尔沁区",
            "code": "0475"
          },
          {
            "name": "科尔沁左翼中旗",
            "code": "0475"
          },
          {
            "name": "科尔沁左翼后旗",
            "code": "0475"
          },
          {
            "name": "开鲁县",
            "code": "0475"
          },
          {
            "name": "库伦旗",
            "code": "0475"
          },
          {
            "name": "奈曼旗",
            "code": "0475"
          },
          {
            "name": "扎鲁特旗",
            "code": "0475"
          },
          {
            "name": "霍林郭勒市",
            "code": "0475"
          }
        ]
      },
      {
        "name": "鄂尔多斯市",
        "code": "0477",
        "sub": [
          {
            "name": "东胜区",
            "code": "0477"
          },
          {
            "name": "康巴什区",
            "code": "0477"
          },
          {
            "name": "达拉特旗",
            "code": "0477"
          },
          {
            "name": "准格尔旗",
            "code": "0477"
          },
          {
            "name": "鄂托克前旗",
            "code": "0477"
          },
          {
            "name": "鄂托克旗",
            "code": "0477"
          },
          {
            "name": "杭锦旗",
            "code": "0477"
          },
          {
            "name": "乌审旗",
            "code": "0477"
          },
          {
            "name": "伊金霍洛旗",
            "code": "0477"
          }
        ]
      },
      {
        "name": "呼伦贝尔市",
        "code": "0470",
        "sub": [
          {
            "name": "海拉尔区",
            "code": "0470"
          },
          {
            "name": "扎赉诺尔区",
            "code": "0470"
          },
          {
            "name": "阿荣旗",
            "code": "0470"
          },
          {
            "name": "莫力达瓦达斡尔族自治旗",
            "code": "0470"
          },
          {
            "name": "鄂伦春自治旗",
            "code": "0470"
          },
          {
            "name": "鄂温克族自治旗",
            "code": "0470"
          },
          {
            "name": "陈巴尔虎旗",
            "code": "0470"
          },
          {
            "name": "新巴尔虎左旗",
            "code": "0470"
          },
          {
            "name": "新巴尔虎右旗",
            "code": "0470"
          },
          {
            "name": "满洲里市",
            "code": "0470"
          },
          {
            "name": "牙克石市",
            "code": "0470"
          },
          {
            "name": "扎兰屯市",
            "code": "0470"
          },
          {
            "name": "额尔古纳市",
            "code": "0470"
          },
          {
            "name": "根河市",
            "code": "0470"
          }
        ]
      },
      {
        "name": "巴彦淖尔市",
        "code": "0478",
        "sub": [
          {
            "name": "临河区",
            "code": "0478"
          },
          {
            "name": "五原县",
            "code": "0478"
          },
          {
            "name": "磴口县",
            "code": "0478"
          },
          {
            "name": "乌拉特前旗",
            "code": "0478"
          },
          {
            "name": "乌拉特中旗",
            "code": "0478"
          },
          {
            "name": "乌拉特后旗",
            "code": "0478"
          },
          {
            "name": "杭锦后旗",
            "code": "0478"
          }
        ]
      },
      {
        "name": "乌兰察布市",
        "code": "0474",
        "sub": [
          {
            "name": "集宁区",
            "code": "0474"
          },
          {
            "name": "卓资县",
            "code": "0474"
          },
          {
            "name": "化德县",
            "code": "0474"
          },
          {
            "name": "商都县",
            "code": "0474"
          },
          {
            "name": "兴和县",
            "code": "0474"
          },
          {
            "name": "凉城县",
            "code": "0474"
          },
          {
            "name": "察哈尔右翼前旗",
            "code": "0474"
          },
          {
            "name": "察哈尔右翼中旗",
            "code": "0474"
          },
          {
            "name": "察哈尔右翼后旗",
            "code": "0474"
          },
          {
            "name": "四子王旗",
            "code": "0474"
          },
          {
            "name": "丰镇市",
            "code": "0474"
          }
        ]
      },
      {
        "name": "兴安盟",
        "code": "0482",
        "sub": [
          {
            "name": "乌兰浩特市",
            "code": "0482"
          },
          {
            "name": "阿尔山市",
            "code": "0482"
          },
          {
            "name": "科尔沁右翼前旗",
            "code": "0482"
          },
          {
            "name": "科尔沁右翼中旗",
            "code": "0482"
          },
          {
            "name": "扎赉特旗",
            "code": "0482"
          },
          {
            "name": "突泉县",
            "code": "0482"
          }
        ]
      },
      {
        "name": "锡林郭勒盟",
        "code": "0479",
        "sub": [
          {
            "name": "二连浩特市",
            "code": "0479"
          },
          {
            "name": "锡林浩特市",
            "code": "0479"
          },
          {
            "name": "阿巴嘎旗",
            "code": "0479"
          },
          {
            "name": "苏尼特左旗",
            "code": "0479"
          },
          {
            "name": "苏尼特右旗",
            "code": "0479"
          },
          {
            "name": "东乌珠穆沁旗",
            "code": "0479"
          },
          {
            "name": "西乌珠穆沁旗",
            "code": "0479"
          },
          {
            "name": "太仆寺旗",
            "code": "0479"
          },
          {
            "name": "镶黄旗",
            "code": "0479"
          },
          {
            "name": "正镶白旗",
            "code": "0479"
          },
          {
            "name": "正蓝旗",
            "code": "0479"
          },
          {
            "name": "多伦县",
            "code": "0479"
          }
        ]
      },
      {
        "name": "阿拉善盟",
        "code": "0483",
        "sub": [
          {
            "name": "阿拉善左旗",
            "code": "0483"
          },
          {
            "name": "阿拉善右旗",
            "code": "0483"
          },
          {
            "name": "额济纳旗",
            "code": "0483"
          }
        ]
      }
    ]
  },
  {
    "name": "辽宁省",
    "code": "21",
    "sub": [
      {
        "name": "沈阳市",
        "code": "024",
        "sub": [
          {
            "name": "和平区",
            "code": "024"
          },
          {
            "name": "沈河区",
            "code": "024"
          },
          {
            "name": "大东区",
            "code": "024"
          },
          {
            "name": "皇姑区",
            "code": "024"
          },
          {
            "name": "铁西区",
            "code": "024"
          },
          {
            "name": "苏家屯区",
            "code": "024"
          },
          {
            "name": "浑南区",
            "code": "024"
          },
          {
            "name": "沈北新区",
            "code": "024"
          },
          {
            "name": "于洪区",
            "code": "024"
          },
          {
            "name": "辽中区",
            "code": "024"
          },
          {
            "name": "康平县",
            "code": "024"
          },
          {
            "name": "法库县",
            "code": "024"
          },
          {
            "name": "新民市",
            "code": "024"
          }
        ]
      },
      {
        "name": "大连市",
        "code": "0411",
        "sub": [
          {
            "name": "中山区",
            "code": "0411"
          },
          {
            "name": "西岗区",
            "code": "0411"
          },
          {
            "name": "沙河口区",
            "code": "0411"
          },
          {
            "name": "甘井子区",
            "code": "0411"
          },
          {
            "name": "旅顺口区",
            "code": "0411"
          },
          {
            "name": "金州区",
            "code": "0411"
          },
          {
            "name": "普兰店区",
            "code": "0411"
          },
          {
            "name": "长海县",
            "code": "0411"
          },
          {
            "name": "瓦房店市",
            "code": "0411"
          },
          {
            "name": "庄河市",
            "code": "0411"
          }
        ]
      },
      {
        "name": "鞍山市",
        "code": "0412",
        "sub": [
          {
            "name": "铁东区",
            "code": "0412"
          },
          {
            "name": "铁西区",
            "code": "0412"
          },
          {
            "name": "立山区",
            "code": "0412"
          },
          {
            "name": "千山区",
            "code": "0412"
          },
          {
            "name": "台安县",
            "code": "0412"
          },
          {
            "name": "岫岩满族自治县",
            "code": "0412"
          },
          {
            "name": "海城市",
            "code": "0412"
          }
        ]
      },
      {
        "name": "抚顺市",
        "code": "0413",
        "sub": [
          {
            "name": "新抚区",
            "code": "0413"
          },
          {
            "name": "东洲区",
            "code": "0413"
          },
          {
            "name": "望花区",
            "code": "0413"
          },
          {
            "name": "顺城区",
            "code": "0413"
          },
          {
            "name": "抚顺县",
            "code": "0413"
          },
          {
            "name": "新宾满族自治县",
            "code": "0413"
          },
          {
            "name": "清原满族自治县",
            "code": "0413"
          }
        ]
      },
      {
        "name": "本溪市",
        "code": "0414",
        "sub": [
          {
            "name": "平山区",
            "code": "0414"
          },
          {
            "name": "溪湖区",
            "code": "0414"
          },
          {
            "name": "明山区",
            "code": "0414"
          },
          {
            "name": "南芬区",
            "code": "0414"
          },
          {
            "name": "本溪满族自治县",
            "code": "0414"
          },
          {
            "name": "桓仁满族自治县",
            "code": "0414"
          }
        ]
      },
      {
        "name": "丹东市",
        "code": "0415",
        "sub": [
          {
            "name": "元宝区",
            "code": "0415"
          },
          {
            "name": "振兴区",
            "code": "0415"
          },
          {
            "name": "振安区",
            "code": "0415"
          },
          {
            "name": "宽甸满族自治县",
            "code": "0415"
          },
          {
            "name": "东港市",
            "code": "0415"
          },
          {
            "name": "凤城市",
            "code": "0415"
          }
        ]
      },
      {
        "name": "锦州市",
        "code": "0416",
        "sub": [
          {
            "name": "古塔区",
            "code": "0416"
          },
          {
            "name": "凌河区",
            "code": "0416"
          },
          {
            "name": "太和区",
            "code": "0416"
          },
          {
            "name": "黑山县",
            "code": "0416"
          },
          {
            "name": "义县",
            "code": "0416"
          },
          {
            "name": "凌海市",
            "code": "0416"
          },
          {
            "name": "北镇市",
            "code": "0416"
          }
        ]
      },
      {
        "name": "营口市",
        "code": "0417",
        "sub": [
          {
            "name": "站前区",
            "code": "0417"
          },
          {
            "name": "西市区",
            "code": "0417"
          },
          {
            "name": "鲅鱼圈区",
            "code": "0417"
          },
          {
            "name": "老边区",
            "code": "0417"
          },
          {
            "name": "盖州市",
            "code": "0417"
          },
          {
            "name": "大石桥市",
            "code": "0417"
          }
        ]
      },
      {
        "name": "阜新市",
        "code": "0418",
        "sub": [
          {
            "name": "海州区",
            "code": "0418"
          },
          {
            "name": "新邱区",
            "code": "0418"
          },
          {
            "name": "太平区",
            "code": "0418"
          },
          {
            "name": "清河门区",
            "code": "0418"
          },
          {
            "name": "细河区",
            "code": "0418"
          },
          {
            "name": "阜新蒙古族自治县",
            "code": "0418"
          },
          {
            "name": "彰武县",
            "code": "0418"
          }
        ]
      },
      {
        "name": "辽阳市",
        "code": "0419",
        "sub": [
          {
            "name": "白塔区",
            "code": "0419"
          },
          {
            "name": "文圣区",
            "code": "0419"
          },
          {
            "name": "宏伟区",
            "code": "0419"
          },
          {
            "name": "弓长岭区",
            "code": "0419"
          },
          {
            "name": "太子河区",
            "code": "0419"
          },
          {
            "name": "辽阳县",
            "code": "0419"
          },
          {
            "name": "灯塔市",
            "code": "0419"
          }
        ]
      },
      {
        "name": "盘锦市",
        "code": "0427",
        "sub": [
          {
            "name": "双台子区",
            "code": "0427"
          },
          {
            "name": "兴隆台区",
            "code": "0427"
          },
          {
            "name": "大洼区",
            "code": "0427"
          },
          {
            "name": "盘山县",
            "code": "0427"
          }
        ]
      },
      {
        "name": "铁岭市",
        "code": "0410",
        "sub": [
          {
            "name": "银州区",
            "code": "0410"
          },
          {
            "name": "清河区",
            "code": "0410"
          },
          {
            "name": "铁岭县",
            "code": "0410"
          },
          {
            "name": "西丰县",
            "code": "0410"
          },
          {
            "name": "昌图县",
            "code": "0410"
          },
          {
            "name": "调兵山市",
            "code": "0410"
          },
          {
            "name": "开原市",
            "code": "0410"
          }
        ]
      },
      {
        "name": "朝阳市",
        "code": "0421",
        "sub": [
          {
            "name": "双塔区",
            "code": "0421"
          },
          {
            "name": "龙城区",
            "code": "0421"
          },
          {
            "name": "朝阳县",
            "code": "0421"
          },
          {
            "name": "建平县",
            "code": "0421"
          },
          {
            "name": "喀喇沁左翼蒙古族自治县",
            "code": "0421"
          },
          {
            "name": "北票市",
            "code": "0421"
          },
          {
            "name": "凌源市",
            "code": "0421"
          }
        ]
      },
      {
        "name": "葫芦岛市",
        "code": "0429",
        "sub": [
          {
            "name": "连山区",
            "code": "0429"
          },
          {
            "name": "龙港区",
            "code": "0429"
          },
          {
            "name": "南票区",
            "code": "0429"
          },
          {
            "name": "绥中县",
            "code": "0429"
          },
          {
            "name": "建昌县",
            "code": "0429"
          },
          {
            "name": "兴城市",
            "code": "0429"
          }
        ]
      }
    ]
  },
  {
    "name": "吉林省",
    "code": "22",
    "sub": [
      {
        "name": "长春市",
        "code": "0431",
        "sub": [
          {
            "name": "南关区",
            "code": "0431"
          },
          {
            "name": "宽城区",
            "code": "0431"
          },
          {
            "name": "朝阳区",
            "code": "0431"
          },
          {
            "name": "二道区",
            "code": "0431"
          },
          {
            "name": "绿园区",
            "code": "0431"
          },
          {
            "name": "双阳区",
            "code": "0431"
          },
          {
            "name": "九台区",
            "code": "0431"
          },
          {
            "name": "农安县",
            "code": "0431"
          },
          {
            "name": "榆树市",
            "code": "0431"
          },
          {
            "name": "德惠市",
            "code": "0431"
          }
        ]
      },
      {
        "name": "吉林市",
        "code": "0432",
        "sub": [
          {
            "name": "昌邑区",
            "code": "0432"
          },
          {
            "name": "龙潭区",
            "code": "0432"
          },
          {
            "name": "船营区",
            "code": "0432"
          },
          {
            "name": "丰满区",
            "code": "0432"
          },
          {
            "name": "永吉县",
            "code": "0432"
          },
          {
            "name": "蛟河市",
            "code": "0432"
          },
          {
            "name": "桦甸市",
            "code": "0432"
          },
          {
            "name": "舒兰市",
            "code": "0432"
          },
          {
            "name": "磐石市",
            "code": "0432"
          }
        ]
      },
      {
        "name": "四平市",
        "code": "0434",
        "sub": [
          {
            "name": "铁西区",
            "code": "0434"
          },
          {
            "name": "铁东区",
            "code": "0434"
          },
          {
            "name": "梨树县",
            "code": "0434"
          },
          {
            "name": "伊通满族自治县",
            "code": "0434"
          },
          {
            "name": "公主岭市",
            "code": "0434"
          },
          {
            "name": "双辽市",
            "code": "0434"
          }
        ]
      },
      {
        "name": "辽源市",
        "code": "0437",
        "sub": [
          {
            "name": "龙山区",
            "code": "0437"
          },
          {
            "name": "西安区",
            "code": "0437"
          },
          {
            "name": "东丰县",
            "code": "0437"
          },
          {
            "name": "东辽县",
            "code": "0437"
          }
        ]
      },
      {
        "name": "通化市",
        "code": "0435",
        "sub": [
          {
            "name": "东昌区",
            "code": "0435"
          },
          {
            "name": "二道江区",
            "code": "0435"
          },
          {
            "name": "通化县",
            "code": "0435"
          },
          {
            "name": "辉南县",
            "code": "0435"
          },
          {
            "name": "柳河县",
            "code": "0435"
          },
          {
            "name": "梅河口市",
            "code": "0435"
          },
          {
            "name": "集安市",
            "code": "0435"
          }
        ]
      },
      {
        "name": "白山市",
        "code": "0439",
        "sub": [
          {
            "name": "浑江区",
            "code": "0439"
          },
          {
            "name": "江源区",
            "code": "0439"
          },
          {
            "name": "抚松县",
            "code": "0439"
          },
          {
            "name": "靖宇县",
            "code": "0439"
          },
          {
            "name": "长白朝鲜族自治县",
            "code": "0439"
          },
          {
            "name": "临江市",
            "code": "0439"
          }
        ]
      },
      {
        "name": "松原市",
        "code": "0438",
        "sub": [
          {
            "name": "宁江区",
            "code": "0438"
          },
          {
            "name": "前郭尔罗斯蒙古族自治县",
            "code": "0438"
          },
          {
            "name": "长岭县",
            "code": "0438"
          },
          {
            "name": "乾安县",
            "code": "0438"
          },
          {
            "name": "扶余市",
            "code": "0438"
          }
        ]
      },
      {
        "name": "白城市",
        "code": "0436",
        "sub": [
          {
            "name": "洮北区",
            "code": "0436"
          },
          {
            "name": "镇赉县",
            "code": "0436"
          },
          {
            "name": "通榆县",
            "code": "0436"
          },
          {
            "name": "洮南市",
            "code": "0436"
          },
          {
            "name": "大安市",
            "code": "0436"
          }
        ]
      },
      {
        "name": "延边朝鲜族自治州",
        "code": "1433",
        "sub": [
          {
            "name": "延吉市",
            "code": "1433"
          },
          {
            "name": "图们市",
            "code": "1433"
          },
          {
            "name": "敦化市",
            "code": "1433"
          },
          {
            "name": "珲春市",
            "code": "1433"
          },
          {
            "name": "龙井市",
            "code": "1433"
          },
          {
            "name": "和龙市",
            "code": "1433"
          },
          {
            "name": "汪清县",
            "code": "1433"
          },
          {
            "name": "安图县",
            "code": "1433"
          }
        ]
      }
    ]
  },
  {
    "name": "黑龙江省",
    "code": "23",
    "sub": [
      {
        "name": "哈尔滨市",
        "code": "0451",
        "sub": [
          {
            "name": "道里区",
            "code": "0451"
          },
          {
            "name": "南岗区",
            "code": "0451"
          },
          {
            "name": "道外区",
            "code": "0451"
          },
          {
            "name": "平房区",
            "code": "0451"
          },
          {
            "name": "松北区",
            "code": "0451"
          },
          {
            "name": "香坊区",
            "code": "0451"
          },
          {
            "name": "呼兰区",
            "code": "0451"
          },
          {
            "name": "阿城区",
            "code": "0451"
          },
          {
            "name": "双城区",
            "code": "0451"
          },
          {
            "name": "依兰县",
            "code": "0451"
          },
          {
            "name": "方正县",
            "code": "0451"
          },
          {
            "name": "宾县",
            "code": "0451"
          },
          {
            "name": "巴彦县",
            "code": "0451"
          },
          {
            "name": "木兰县",
            "code": "0451"
          },
          {
            "name": "通河县",
            "code": "0451"
          },
          {
            "name": "延寿县",
            "code": "0451"
          },
          {
            "name": "尚志市",
            "code": "0451"
          },
          {
            "name": "五常市",
            "code": "0451"
          }
        ]
      },
      {
        "name": "齐齐哈尔市",
        "code": "0452",
        "sub": [
          {
            "name": "龙沙区",
            "code": "0452"
          },
          {
            "name": "建华区",
            "code": "0452"
          },
          {
            "name": "铁锋区",
            "code": "0452"
          },
          {
            "name": "昂昂溪区",
            "code": "0452"
          },
          {
            "name": "富拉尔基区",
            "code": "0452"
          },
          {
            "name": "碾子山区",
            "code": "0452"
          },
          {
            "name": "梅里斯达斡尔族区",
            "code": "0452"
          },
          {
            "name": "龙江县",
            "code": "0452"
          },
          {
            "name": "依安县",
            "code": "0452"
          },
          {
            "name": "泰来县",
            "code": "0452"
          },
          {
            "name": "甘南县",
            "code": "0452"
          },
          {
            "name": "富裕县",
            "code": "0452"
          },
          {
            "name": "克山县",
            "code": "0452"
          },
          {
            "name": "克东县",
            "code": "0452"
          },
          {
            "name": "拜泉县",
            "code": "0452"
          },
          {
            "name": "讷河市",
            "code": "0452"
          }
        ]
      },
      {
        "name": "鸡西市",
        "code": "0467",
        "sub": [
          {
            "name": "鸡冠区",
            "code": "0467"
          },
          {
            "name": "恒山区",
            "code": "0467"
          },
          {
            "name": "滴道区",
            "code": "0467"
          },
          {
            "name": "梨树区",
            "code": "0467"
          },
          {
            "name": "城子河区",
            "code": "0467"
          },
          {
            "name": "麻山区",
            "code": "0467"
          },
          {
            "name": "鸡东县",
            "code": "0467"
          },
          {
            "name": "虎林市",
            "code": "0467"
          },
          {
            "name": "密山市",
            "code": "0467"
          }
        ]
      },
      {
        "name": "鹤岗市",
        "code": "0468",
        "sub": [
          {
            "name": "向阳区",
            "code": "0468"
          },
          {
            "name": "工农区",
            "code": "0468"
          },
          {
            "name": "南山区",
            "code": "0468"
          },
          {
            "name": "兴安区",
            "code": "0468"
          },
          {
            "name": "东山区",
            "code": "0468"
          },
          {
            "name": "兴山区",
            "code": "0468"
          },
          {
            "name": "萝北县",
            "code": "0468"
          },
          {
            "name": "绥滨县",
            "code": "0468"
          }
        ]
      },
      {
        "name": "双鸭山市",
        "code": "0469",
        "sub": [
          {
            "name": "尖山区",
            "code": "0469"
          },
          {
            "name": "岭东区",
            "code": "0469"
          },
          {
            "name": "四方台区",
            "code": "0469"
          },
          {
            "name": "宝山区",
            "code": "0469"
          },
          {
            "name": "集贤县",
            "code": "0469"
          },
          {
            "name": "友谊县",
            "code": "0469"
          },
          {
            "name": "宝清县",
            "code": "0469"
          },
          {
            "name": "饶河县",
            "code": "0469"
          }
        ]
      },
      {
        "name": "大庆市",
        "code": "0459",
        "sub": [
          {
            "name": "萨尔图区",
            "code": "0459"
          },
          {
            "name": "龙凤区",
            "code": "0459"
          },
          {
            "name": "让胡路区",
            "code": "0459"
          },
          {
            "name": "红岗区",
            "code": "0459"
          },
          {
            "name": "大同区",
            "code": "0459"
          },
          {
            "name": "肇州县",
            "code": "0459"
          },
          {
            "name": "肇源县",
            "code": "0459"
          },
          {
            "name": "林甸县",
            "code": "0459"
          },
          {
            "name": "杜尔伯特蒙古族自治县",
            "code": "0459"
          }
        ]
      },
      {
        "name": "伊春市",
        "code": "0458",
        "sub": [
          {
            "name": "伊春区",
            "code": "0458"
          },
          {
            "name": "南岔区",
            "code": "0458"
          },
          {
            "name": "友好区",
            "code": "0458"
          },
          {
            "name": "西林区",
            "code": "0458"
          },
          {
            "name": "翠峦区",
            "code": "0458"
          },
          {
            "name": "新青区",
            "code": "0458"
          },
          {
            "name": "美溪区",
            "code": "0458"
          },
          {
            "name": "金山屯区",
            "code": "0458"
          },
          {
            "name": "五营区",
            "code": "0458"
          },
          {
            "name": "乌马河区",
            "code": "0458"
          },
          {
            "name": "汤旺河区",
            "code": "0458"
          },
          {
            "name": "带岭区",
            "code": "0458"
          },
          {
            "name": "乌伊岭区",
            "code": "0458"
          },
          {
            "name": "红星区",
            "code": "0458"
          },
          {
            "name": "上甘岭区",
            "code": "0458"
          },
          {
            "name": "嘉荫县",
            "code": "0458"
          },
          {
            "name": "铁力市",
            "code": "0458"
          }
        ]
      },
      {
        "name": "佳木斯市",
        "code": "0454",
        "sub": [
          {
            "name": "向阳区",
            "code": "0454"
          },
          {
            "name": "前进区",
            "code": "0454"
          },
          {
            "name": "东风区",
            "code": "0454"
          },
          {
            "name": "郊区",
            "code": "0454"
          },
          {
            "name": "桦南县",
            "code": "0454"
          },
          {
            "name": "桦川县",
            "code": "0454"
          },
          {
            "name": "汤原县",
            "code": "0454"
          },
          {
            "name": "同江市",
            "code": "0454"
          },
          {
            "name": "富锦市",
            "code": "0454"
          },
          {
            "name": "抚远市",
            "code": "0454"
          }
        ]
      },
      {
        "name": "七台河市",
        "code": "0464",
        "sub": [
          {
            "name": "新兴区",
            "code": "0464"
          },
          {
            "name": "桃山区",
            "code": "0464"
          },
          {
            "name": "茄子河区",
            "code": "0464"
          },
          {
            "name": "勃利县",
            "code": "0464"
          }
        ]
      },
      {
        "name": "牡丹江市",
        "code": "0453",
        "sub": [
          {
            "name": "东安区",
            "code": "0453"
          },
          {
            "name": "阳明区",
            "code": "0453"
          },
          {
            "name": "爱民区",
            "code": "0453"
          },
          {
            "name": "西安区",
            "code": "0453"
          },
          {
            "name": "林口县",
            "code": "0453"
          },
          {
            "name": "绥芬河市",
            "code": "0453"
          },
          {
            "name": "海林市",
            "code": "0453"
          },
          {
            "name": "宁安市",
            "code": "0453"
          },
          {
            "name": "穆棱市",
            "code": "0453"
          },
          {
            "name": "东宁市",
            "code": "0453"
          }
        ]
      },
      {
        "name": "黑河市",
        "code": "0456",
        "sub": [
          {
            "name": "爱辉区",
            "code": "0456"
          },
          {
            "name": "嫩江县",
            "code": "0456"
          },
          {
            "name": "逊克县",
            "code": "0456"
          },
          {
            "name": "孙吴县",
            "code": "0456"
          },
          {
            "name": "北安市",
            "code": "0456"
          },
          {
            "name": "五大连池市",
            "code": "0456"
          }
        ]
      },
      {
        "name": "绥化市",
        "code": "0455",
        "sub": [
          {
            "name": "北林区",
            "code": "0455"
          },
          {
            "name": "望奎县",
            "code": "0455"
          },
          {
            "name": "兰西县",
            "code": "0455"
          },
          {
            "name": "青冈县",
            "code": "0455"
          },
          {
            "name": "庆安县",
            "code": "0455"
          },
          {
            "name": "明水县",
            "code": "0455"
          },
          {
            "name": "绥棱县",
            "code": "0455"
          },
          {
            "name": "安达市",
            "code": "0455"
          },
          {
            "name": "肇东市",
            "code": "0455"
          },
          {
            "name": "海伦市",
            "code": "0455"
          }
        ]
      },
      {
        "name": "大兴安岭地区",
        "code": "0457",
        "sub": [
          {
            "name": "加格达奇区",
            "code": "0457"
          },
          {
            "name": "呼玛县",
            "code": "0457"
          },
          {
            "name": "塔河县",
            "code": "0457"
          },
          {
            "name": "漠河县",
            "code": "0457"
          }
        ]
      }
    ]
  },
  {
    "name": "上海市",
    "code": "31",
    "sub": [
      {
        "name": "上海城区",
        "code": "021",
        "sub": [
          {
            "name": "黄浦区",
            "code": "021"
          },
          {
            "name": "徐汇区",
            "code": "021"
          },
          {
            "name": "长宁区",
            "code": "021"
          },
          {
            "name": "静安区",
            "code": "021"
          },
          {
            "name": "普陀区",
            "code": "021"
          },
          {
            "name": "虹口区",
            "code": "021"
          },
          {
            "name": "杨浦区",
            "code": "021"
          },
          {
            "name": "闵行区",
            "code": "021"
          },
          {
            "name": "宝山区",
            "code": "021"
          },
          {
            "name": "嘉定区",
            "code": "021"
          },
          {
            "name": "浦东新区",
            "code": "021"
          },
          {
            "name": "金山区",
            "code": "021"
          },
          {
            "name": "松江区",
            "code": "021"
          },
          {
            "name": "青浦区",
            "code": "021"
          },
          {
            "name": "奉贤区",
            "code": "021"
          },
          {
            "name": "崇明区",
            "code": "021"
          }
        ]
      }
    ]
  },
  {
    "name": "江苏省",
    "code": "32",
    "sub": [
      {
        "name": "南京市",
        "code": "025",
        "sub": [
          {
            "name": "玄武区",
            "code": "025"
          },
          {
            "name": "秦淮区",
            "code": "025"
          },
          {
            "name": "建邺区",
            "code": "025"
          },
          {
            "name": "鼓楼区",
            "code": "025"
          },
          {
            "name": "浦口区",
            "code": "025"
          },
          {
            "name": "栖霞区",
            "code": "025"
          },
          {
            "name": "雨花台区",
            "code": "025"
          },
          {
            "name": "江宁区",
            "code": "025"
          },
          {
            "name": "六合区",
            "code": "025"
          },
          {
            "name": "溧水区",
            "code": "025"
          },
          {
            "name": "高淳区",
            "code": "025"
          }
        ]
      },
      {
        "name": "无锡市",
        "code": "0510",
        "sub": [
          {
            "name": "锡山区",
            "code": "0510"
          },
          {
            "name": "惠山区",
            "code": "0510"
          },
          {
            "name": "滨湖区",
            "code": "0510"
          },
          {
            "name": "梁溪区",
            "code": "0510"
          },
          {
            "name": "新吴区",
            "code": "0510"
          },
          {
            "name": "江阴市",
            "code": "0510"
          },
          {
            "name": "宜兴市",
            "code": "0510"
          }
        ]
      },
      {
        "name": "徐州市",
        "code": "0516",
        "sub": [
          {
            "name": "鼓楼区",
            "code": "0516"
          },
          {
            "name": "云龙区",
            "code": "0516"
          },
          {
            "name": "贾汪区",
            "code": "0516"
          },
          {
            "name": "泉山区",
            "code": "0516"
          },
          {
            "name": "铜山区",
            "code": "0516"
          },
          {
            "name": "丰县",
            "code": "0516"
          },
          {
            "name": "沛县",
            "code": "0516"
          },
          {
            "name": "睢宁县",
            "code": "0516"
          },
          {
            "name": "新沂市",
            "code": "0516"
          },
          {
            "name": "邳州市",
            "code": "0516"
          }
        ]
      },
      {
        "name": "常州市",
        "code": "0519",
        "sub": [
          {
            "name": "天宁区",
            "code": "0519"
          },
          {
            "name": "钟楼区",
            "code": "0519"
          },
          {
            "name": "新北区",
            "code": "0519"
          },
          {
            "name": "武进区",
            "code": "0519"
          },
          {
            "name": "金坛区",
            "code": "0519"
          },
          {
            "name": "溧阳市",
            "code": "0519"
          }
        ]
      },
      {
        "name": "苏州市",
        "code": "0512",
        "sub": [
          {
            "name": "虎丘区",
            "code": "0512"
          },
          {
            "name": "吴中区",
            "code": "0512"
          },
          {
            "name": "相城区",
            "code": "0512"
          },
          {
            "name": "姑苏区",
            "code": "0512"
          },
          {
            "name": "吴江区",
            "code": "0512"
          },
          {
            "name": "常熟市",
            "code": "0512"
          },
          {
            "name": "张家港市",
            "code": "0512"
          },
          {
            "name": "昆山市",
            "code": "0512"
          },
          {
            "name": "太仓市",
            "code": "0512"
          }
        ]
      },
      {
        "name": "南通市",
        "code": "0513",
        "sub": [
          {
            "name": "崇川区",
            "code": "0513"
          },
          {
            "name": "港闸区",
            "code": "0513"
          },
          {
            "name": "通州区",
            "code": "0513"
          },
          {
            "name": "海安县",
            "code": "0513"
          },
          {
            "name": "如东县",
            "code": "0513"
          },
          {
            "name": "启东市",
            "code": "0513"
          },
          {
            "name": "如皋市",
            "code": "0513"
          },
          {
            "name": "海门市",
            "code": "0513"
          }
        ]
      },
      {
        "name": "连云港市",
        "code": "0518",
        "sub": [
          {
            "name": "连云区",
            "code": "0518"
          },
          {
            "name": "海州区",
            "code": "0518"
          },
          {
            "name": "赣榆区",
            "code": "0518"
          },
          {
            "name": "东海县",
            "code": "0518"
          },
          {
            "name": "灌云县",
            "code": "0518"
          },
          {
            "name": "灌南县",
            "code": "0518"
          }
        ]
      },
      {
        "name": "淮安市",
        "code": "0517",
        "sub": [
          {
            "name": "清江浦区",
            "code": "0517"
          },
          {
            "name": "淮安区",
            "code": "0517"
          },
          {
            "name": "淮阴区",
            "code": "0517"
          },
          {
            "name": "洪泽区",
            "code": "0517"
          },
          {
            "name": "涟水县",
            "code": "0517"
          },
          {
            "name": "盱眙县",
            "code": "0517"
          },
          {
            "name": "金湖县",
            "code": "0517"
          }
        ]
      },
      {
        "name": "盐城市",
        "code": "0515",
        "sub": [
          {
            "name": "亭湖区",
            "code": "0515"
          },
          {
            "name": "盐都区",
            "code": "0515"
          },
          {
            "name": "大丰区",
            "code": "0515"
          },
          {
            "name": "响水县",
            "code": "0515"
          },
          {
            "name": "滨海县",
            "code": "0515"
          },
          {
            "name": "阜宁县",
            "code": "0515"
          },
          {
            "name": "射阳县",
            "code": "0515"
          },
          {
            "name": "建湖县",
            "code": "0515"
          },
          {
            "name": "东台市",
            "code": "0515"
          }
        ]
      },
      {
        "name": "扬州市",
        "code": "0514",
        "sub": [
          {
            "name": "广陵区",
            "code": "0514"
          },
          {
            "name": "邗江区",
            "code": "0514"
          },
          {
            "name": "江都区",
            "code": "0514"
          },
          {
            "name": "宝应县",
            "code": "0514"
          },
          {
            "name": "仪征市",
            "code": "0514"
          },
          {
            "name": "高邮市",
            "code": "0514"
          }
        ]
      },
      {
        "name": "镇江市",
        "code": "0511",
        "sub": [
          {
            "name": "京口区",
            "code": "0511"
          },
          {
            "name": "润州区",
            "code": "0511"
          },
          {
            "name": "丹徒区",
            "code": "0511"
          },
          {
            "name": "丹阳市",
            "code": "0511"
          },
          {
            "name": "扬中市",
            "code": "0511"
          },
          {
            "name": "句容市",
            "code": "0511"
          }
        ]
      },
      {
        "name": "泰州市",
        "code": "0523",
        "sub": [
          {
            "name": "海陵区",
            "code": "0523"
          },
          {
            "name": "高港区",
            "code": "0523"
          },
          {
            "name": "姜堰区",
            "code": "0523"
          },
          {
            "name": "兴化市",
            "code": "0523"
          },
          {
            "name": "靖江市",
            "code": "0523"
          },
          {
            "name": "泰兴市",
            "code": "0523"
          }
        ]
      },
      {
        "name": "宿迁市",
        "code": "0527",
        "sub": [
          {
            "name": "宿城区",
            "code": "0527"
          },
          {
            "name": "宿豫区",
            "code": "0527"
          },
          {
            "name": "沭阳县",
            "code": "0527"
          },
          {
            "name": "泗阳县",
            "code": "0527"
          },
          {
            "name": "泗洪县",
            "code": "0527"
          }
        ]
      }
    ]
  },
  {
    "name": "浙江省",
    "code": "33",
    "sub": [
      {
        "name": "杭州市",
        "code": "0571",
        "sub": [
          {
            "name": "上城区",
            "code": "0571"
          },
          {
            "name": "下城区",
            "code": "0571"
          },
          {
            "name": "江干区",
            "code": "0571"
          },
          {
            "name": "拱墅区",
            "code": "0571"
          },
          {
            "name": "西湖区",
            "code": "0571"
          },
          {
            "name": "滨江区",
            "code": "0571"
          },
          {
            "name": "萧山区",
            "code": "0571"
          },
          {
            "name": "余杭区",
            "code": "0571"
          },
          {
            "name": "富阳区",
            "code": "0571"
          },
          {
            "name": "桐庐县",
            "code": "0571"
          },
          {
            "name": "淳安县",
            "code": "0571"
          },
          {
            "name": "建德市",
            "code": "0571"
          },
          {
            "name": "临安市",
            "code": "0571"
          }
        ]
      },
      {
        "name": "宁波市",
        "code": "0574",
        "sub": [
          {
            "name": "海曙区",
            "code": "0574"
          },
          {
            "name": "江北区",
            "code": "0574"
          },
          {
            "name": "北仑区",
            "code": "0574"
          },
          {
            "name": "镇海区",
            "code": "0574"
          },
          {
            "name": "鄞州区",
            "code": "0574"
          },
          {
            "name": "象山县",
            "code": "0574"
          },
          {
            "name": "宁海县",
            "code": "0574"
          },
          {
            "name": "余姚市",
            "code": "0574"
          },
          {
            "name": "慈溪市",
            "code": "0574"
          },
          {
            "name": "奉化区",
            "code": "0574"
          }
        ]
      },
      {
        "name": "温州市",
        "code": "0577",
        "sub": [
          {
            "name": "鹿城区",
            "code": "0577"
          },
          {
            "name": "龙湾区",
            "code": "0577"
          },
          {
            "name": "瓯海区",
            "code": "0577"
          },
          {
            "name": "洞头区",
            "code": "0577"
          },
          {
            "name": "永嘉县",
            "code": "0577"
          },
          {
            "name": "平阳县",
            "code": "0577"
          },
          {
            "name": "苍南县",
            "code": "0577"
          },
          {
            "name": "文成县",
            "code": "0577"
          },
          {
            "name": "泰顺县",
            "code": "0577"
          },
          {
            "name": "瑞安市",
            "code": "0577"
          },
          {
            "name": "乐清市",
            "code": "0577"
          }
        ]
      },
      {
        "name": "嘉兴市",
        "code": "0573",
        "sub": [
          {
            "name": "南湖区",
            "code": "0573"
          },
          {
            "name": "秀洲区",
            "code": "0573"
          },
          {
            "name": "嘉善县",
            "code": "0573"
          },
          {
            "name": "海盐县",
            "code": "0573"
          },
          {
            "name": "海宁市",
            "code": "0573"
          },
          {
            "name": "平湖市",
            "code": "0573"
          },
          {
            "name": "桐乡市",
            "code": "0573"
          }
        ]
      },
      {
        "name": "湖州市",
        "code": "0572",
        "sub": [
          {
            "name": "吴兴区",
            "code": "0572"
          },
          {
            "name": "南浔区",
            "code": "0572"
          },
          {
            "name": "德清县",
            "code": "0572"
          },
          {
            "name": "长兴县",
            "code": "0572"
          },
          {
            "name": "安吉县",
            "code": "0572"
          }
        ]
      },
      {
        "name": "绍兴市",
        "code": "0575",
        "sub": [
          {
            "name": "越城区",
            "code": "0575"
          },
          {
            "name": "柯桥区",
            "code": "0575"
          },
          {
            "name": "上虞区",
            "code": "0575"
          },
          {
            "name": "新昌县",
            "code": "0575"
          },
          {
            "name": "诸暨市",
            "code": "0575"
          },
          {
            "name": "嵊州市",
            "code": "0575"
          }
        ]
      },
      {
        "name": "金华市",
        "code": "0579",
        "sub": [
          {
            "name": "婺城区",
            "code": "0579"
          },
          {
            "name": "金东区",
            "code": "0579"
          },
          {
            "name": "武义县",
            "code": "0579"
          },
          {
            "name": "浦江县",
            "code": "0579"
          },
          {
            "name": "磐安县",
            "code": "0579"
          },
          {
            "name": "兰溪市",
            "code": "0579"
          },
          {
            "name": "义乌市",
            "code": "0579"
          },
          {
            "name": "东阳市",
            "code": "0579"
          },
          {
            "name": "永康市",
            "code": "0579"
          }
        ]
      },
      {
        "name": "衢州市",
        "code": "0570",
        "sub": [
          {
            "name": "柯城区",
            "code": "0570"
          },
          {
            "name": "衢江区",
            "code": "0570"
          },
          {
            "name": "常山县",
            "code": "0570"
          },
          {
            "name": "开化县",
            "code": "0570"
          },
          {
            "name": "龙游县",
            "code": "0570"
          },
          {
            "name": "江山市",
            "code": "0570"
          }
        ]
      },
      {
        "name": "舟山市",
        "code": "0580",
        "sub": [
          {
            "name": "定海区",
            "code": "0580"
          },
          {
            "name": "普陀区",
            "code": "0580"
          },
          {
            "name": "岱山县",
            "code": "0580"
          },
          {
            "name": "嵊泗县",
            "code": "0580"
          }
        ]
      },
      {
        "name": "台州市",
        "code": "0576",
        "sub": [
          {
            "name": "椒江区",
            "code": "0576"
          },
          {
            "name": "黄岩区",
            "code": "0576"
          },
          {
            "name": "路桥区",
            "code": "0576"
          },
          {
            "name": "玉环市",
            "code": "0576"
          },
          {
            "name": "三门县",
            "code": "0576"
          },
          {
            "name": "天台县",
            "code": "0576"
          },
          {
            "name": "仙居县",
            "code": "0576"
          },
          {
            "name": "温岭市",
            "code": "0576"
          },
          {
            "name": "临海市",
            "code": "0576"
          }
        ]
      },
      {
        "name": "丽水市",
        "code": "0578",
        "sub": [
          {
            "name": "莲都区",
            "code": "0578"
          },
          {
            "name": "青田县",
            "code": "0578"
          },
          {
            "name": "缙云县",
            "code": "0578"
          },
          {
            "name": "遂昌县",
            "code": "0578"
          },
          {
            "name": "松阳县",
            "code": "0578"
          },
          {
            "name": "云和县",
            "code": "0578"
          },
          {
            "name": "庆元县",
            "code": "0578"
          },
          {
            "name": "景宁畲族自治县",
            "code": "0578"
          },
          {
            "name": "龙泉市",
            "code": "0578"
          }
        ]
      }
    ]
  },
  {
    "name": "安徽省",
    "code": "34",
    "sub": [
      {
        "name": "合肥市",
        "code": "0551",
        "sub": [
          {
            "name": "瑶海区",
            "code": "0551"
          },
          {
            "name": "庐阳区",
            "code": "0551"
          },
          {
            "name": "蜀山区",
            "code": "0551"
          },
          {
            "name": "包河区",
            "code": "0551"
          },
          {
            "name": "长丰县",
            "code": "0551"
          },
          {
            "name": "肥东县",
            "code": "0551"
          },
          {
            "name": "肥西县",
            "code": "0551"
          },
          {
            "name": "庐江县",
            "code": "0551"
          },
          {
            "name": "巢湖市",
            "code": "0551"
          }
        ]
      },
      {
        "name": "芜湖市",
        "code": "0553",
        "sub": [
          {
            "name": "镜湖区",
            "code": "0553"
          },
          {
            "name": "弋江区",
            "code": "0553"
          },
          {
            "name": "鸠江区",
            "code": "0553"
          },
          {
            "name": "三山区",
            "code": "0553"
          },
          {
            "name": "芜湖县",
            "code": "0553"
          },
          {
            "name": "繁昌县",
            "code": "0553"
          },
          {
            "name": "南陵县",
            "code": "0553"
          },
          {
            "name": "无为县",
            "code": "0553"
          }
        ]
      },
      {
        "name": "蚌埠市",
        "code": "0552",
        "sub": [
          {
            "name": "龙子湖区",
            "code": "0552"
          },
          {
            "name": "蚌山区",
            "code": "0552"
          },
          {
            "name": "禹会区",
            "code": "0552"
          },
          {
            "name": "淮上区",
            "code": "0552"
          },
          {
            "name": "怀远县",
            "code": "0552"
          },
          {
            "name": "五河县",
            "code": "0552"
          },
          {
            "name": "固镇县",
            "code": "0552"
          }
        ]
      },
      {
        "name": "淮南市",
        "code": "0554",
        "sub": [
          {
            "name": "大通区",
            "code": "0554"
          },
          {
            "name": "田家庵区",
            "code": "0554"
          },
          {
            "name": "谢家集区",
            "code": "0554"
          },
          {
            "name": "八公山区",
            "code": "0554"
          },
          {
            "name": "潘集区",
            "code": "0554"
          },
          {
            "name": "凤台县",
            "code": "0554"
          },
          {
            "name": "寿县",
            "code": "0554"
          }
        ]
      },
      {
        "name": "马鞍山市",
        "code": "0555",
        "sub": [
          {
            "name": "花山区",
            "code": "0555"
          },
          {
            "name": "雨山区",
            "code": "0555"
          },
          {
            "name": "博望区",
            "code": "0555"
          },
          {
            "name": "当涂县",
            "code": "0555"
          },
          {
            "name": "含山县",
            "code": "0555"
          },
          {
            "name": "和县",
            "code": "0555"
          }
        ]
      },
      {
        "name": "淮北市",
        "code": "0561",
        "sub": [
          {
            "name": "杜集区",
            "code": "0561"
          },
          {
            "name": "相山区",
            "code": "0561"
          },
          {
            "name": "烈山区",
            "code": "0561"
          },
          {
            "name": "濉溪县",
            "code": "0561"
          }
        ]
      },
      {
        "name": "铜陵市",
        "code": "0562",
        "sub": [
          {
            "name": "铜官区",
            "code": "0562"
          },
          {
            "name": "义安区",
            "code": "0562"
          },
          {
            "name": "郊区",
            "code": "0562"
          },
          {
            "name": "枞阳县",
            "code": "0562"
          }
        ]
      },
      {
        "name": "安庆市",
        "code": "0556",
        "sub": [
          {
            "name": "迎江区",
            "code": "0556"
          },
          {
            "name": "大观区",
            "code": "0556"
          },
          {
            "name": "宜秀区",
            "code": "0556"
          },
          {
            "name": "怀宁县",
            "code": "0556"
          },
          {
            "name": "潜山县",
            "code": "0556"
          },
          {
            "name": "太湖县",
            "code": "0556"
          },
          {
            "name": "宿松县",
            "code": "0556"
          },
          {
            "name": "望江县",
            "code": "0556"
          },
          {
            "name": "岳西县",
            "code": "0556"
          },
          {
            "name": "桐城市",
            "code": "0556"
          }
        ]
      },
      {
        "name": "黄山市",
        "code": "0559",
        "sub": [
          {
            "name": "屯溪区",
            "code": "0559"
          },
          {
            "name": "黄山区",
            "code": "0559"
          },
          {
            "name": "徽州区",
            "code": "0559"
          },
          {
            "name": "歙县",
            "code": "0559"
          },
          {
            "name": "休宁县",
            "code": "0559"
          },
          {
            "name": "黟县",
            "code": "0559"
          },
          {
            "name": "祁门县",
            "code": "0559"
          }
        ]
      },
      {
        "name": "滁州市",
        "code": "0550",
        "sub": [
          {
            "name": "琅琊区",
            "code": "0550"
          },
          {
            "name": "南谯区",
            "code": "0550"
          },
          {
            "name": "来安县",
            "code": "0550"
          },
          {
            "name": "全椒县",
            "code": "0550"
          },
          {
            "name": "定远县",
            "code": "0550"
          },
          {
            "name": "凤阳县",
            "code": "0550"
          },
          {
            "name": "天长市",
            "code": "0550"
          },
          {
            "name": "明光市",
            "code": "0550"
          }
        ]
      },
      {
        "name": "阜阳市",
        "code": "1558",
        "sub": [
          {
            "name": "颍州区",
            "code": "1558"
          },
          {
            "name": "颍东区",
            "code": "1558"
          },
          {
            "name": "颍泉区",
            "code": "1558"
          },
          {
            "name": "临泉县",
            "code": "1558"
          },
          {
            "name": "太和县",
            "code": "1558"
          },
          {
            "name": "阜南县",
            "code": "1558"
          },
          {
            "name": "颍上县",
            "code": "1558"
          },
          {
            "name": "界首市",
            "code": "1558"
          }
        ]
      },
      {
        "name": "宿州市",
        "code": "0557",
        "sub": [
          {
            "name": "埇桥区",
            "code": "0557"
          },
          {
            "name": "砀山县",
            "code": "0557"
          },
          {
            "name": "萧县",
            "code": "0557"
          },
          {
            "name": "灵璧县",
            "code": "0557"
          },
          {
            "name": "泗县",
            "code": "0557"
          }
        ]
      },
      {
        "name": "六安市",
        "code": "0564",
        "sub": [
          {
            "name": "金安区",
            "code": "0564"
          },
          {
            "name": "裕安区",
            "code": "0564"
          },
          {
            "name": "叶集区",
            "code": "0564"
          },
          {
            "name": "霍邱县",
            "code": "0564"
          },
          {
            "name": "舒城县",
            "code": "0564"
          },
          {
            "name": "金寨县",
            "code": "0564"
          },
          {
            "name": "霍山县",
            "code": "0564"
          }
        ]
      },
      {
        "name": "亳州市",
        "code": "0558",
        "sub": [
          {
            "name": "谯城区",
            "code": "0558"
          },
          {
            "name": "涡阳县",
            "code": "0558"
          },
          {
            "name": "蒙城县",
            "code": "0558"
          },
          {
            "name": "利辛县",
            "code": "0558"
          }
        ]
      },
      {
        "name": "池州市",
        "code": "0566",
        "sub": [
          {
            "name": "贵池区",
            "code": "0566"
          },
          {
            "name": "东至县",
            "code": "0566"
          },
          {
            "name": "石台县",
            "code": "0566"
          },
          {
            "name": "青阳县",
            "code": "0566"
          }
        ]
      },
      {
        "name": "宣城市",
        "code": "0563",
        "sub": [
          {
            "name": "宣州区",
            "code": "0563"
          },
          {
            "name": "郎溪县",
            "code": "0563"
          },
          {
            "name": "广德县",
            "code": "0563"
          },
          {
            "name": "泾县",
            "code": "0563"
          },
          {
            "name": "绩溪县",
            "code": "0563"
          },
          {
            "name": "旌德县",
            "code": "0563"
          },
          {
            "name": "宁国市",
            "code": "0563"
          }
        ]
      }
    ]
  },
  {
    "name": "福建省",
    "code": "35",
    "sub": [
      {
        "name": "福州市",
        "code": "0591",
        "sub": [
          {
            "name": "鼓楼区",
            "code": "0591"
          },
          {
            "name": "台江区",
            "code": "0591"
          },
          {
            "name": "仓山区",
            "code": "0591"
          },
          {
            "name": "马尾区",
            "code": "0591"
          },
          {
            "name": "晋安区",
            "code": "0591"
          },
          {
            "name": "闽侯县",
            "code": "0591"
          },
          {
            "name": "连江县",
            "code": "0591"
          },
          {
            "name": "罗源县",
            "code": "0591"
          },
          {
            "name": "闽清县",
            "code": "0591"
          },
          {
            "name": "永泰县",
            "code": "0591"
          },
          {
            "name": "平潭县",
            "code": "0591"
          },
          {
            "name": "福清市",
            "code": "0591"
          },
          {
            "name": "长乐市",
            "code": "0591"
          }
        ]
      },
      {
        "name": "厦门市",
        "code": "0592",
        "sub": [
          {
            "name": "思明区",
            "code": "0592"
          },
          {
            "name": "海沧区",
            "code": "0592"
          },
          {
            "name": "湖里区",
            "code": "0592"
          },
          {
            "name": "集美区",
            "code": "0592"
          },
          {
            "name": "同安区",
            "code": "0592"
          },
          {
            "name": "翔安区",
            "code": "0592"
          }
        ]
      },
      {
        "name": "莆田市",
        "code": "0594",
        "sub": [
          {
            "name": "城厢区",
            "code": "0594"
          },
          {
            "name": "涵江区",
            "code": "0594"
          },
          {
            "name": "荔城区",
            "code": "0594"
          },
          {
            "name": "秀屿区",
            "code": "0594"
          },
          {
            "name": "仙游县",
            "code": "0594"
          }
        ]
      },
      {
        "name": "三明市",
        "code": "0598",
        "sub": [
          {
            "name": "梅列区",
            "code": "0598"
          },
          {
            "name": "三元区",
            "code": "0598"
          },
          {
            "name": "明溪县",
            "code": "0598"
          },
          {
            "name": "清流县",
            "code": "0598"
          },
          {
            "name": "宁化县",
            "code": "0598"
          },
          {
            "name": "大田县",
            "code": "0598"
          },
          {
            "name": "尤溪县",
            "code": "0598"
          },
          {
            "name": "沙县",
            "code": "0598"
          },
          {
            "name": "将乐县",
            "code": "0598"
          },
          {
            "name": "泰宁县",
            "code": "0598"
          },
          {
            "name": "建宁县",
            "code": "0598"
          },
          {
            "name": "永安市",
            "code": "0598"
          }
        ]
      },
      {
        "name": "泉州市",
        "code": "0595",
        "sub": [
          {
            "name": "鲤城区",
            "code": "0595"
          },
          {
            "name": "丰泽区",
            "code": "0595"
          },
          {
            "name": "洛江区",
            "code": "0595"
          },
          {
            "name": "泉港区",
            "code": "0595"
          },
          {
            "name": "惠安县",
            "code": "0595"
          },
          {
            "name": "安溪县",
            "code": "0595"
          },
          {
            "name": "永春县",
            "code": "0595"
          },
          {
            "name": "德化县",
            "code": "0595"
          },
          {
            "name": "金门县",
            "code": "0595"
          },
          {
            "name": "石狮市",
            "code": "0595"
          },
          {
            "name": "晋江市",
            "code": "0595"
          },
          {
            "name": "南安市",
            "code": "0595"
          }
        ]
      },
      {
        "name": "漳州市",
        "code": "0596",
        "sub": [
          {
            "name": "芗城区",
            "code": "0596"
          },
          {
            "name": "龙文区",
            "code": "0596"
          },
          {
            "name": "云霄县",
            "code": "0596"
          },
          {
            "name": "漳浦县",
            "code": "0596"
          },
          {
            "name": "诏安县",
            "code": "0596"
          },
          {
            "name": "长泰县",
            "code": "0596"
          },
          {
            "name": "东山县",
            "code": "0596"
          },
          {
            "name": "南靖县",
            "code": "0596"
          },
          {
            "name": "平和县",
            "code": "0596"
          },
          {
            "name": "华安县",
            "code": "0596"
          },
          {
            "name": "龙海市",
            "code": "0596"
          }
        ]
      },
      {
        "name": "南平市",
        "code": "0599",
        "sub": [
          {
            "name": "延平区",
            "code": "0599"
          },
          {
            "name": "建阳区",
            "code": "0599"
          },
          {
            "name": "顺昌县",
            "code": "0599"
          },
          {
            "name": "浦城县",
            "code": "0599"
          },
          {
            "name": "光泽县",
            "code": "0599"
          },
          {
            "name": "松溪县",
            "code": "0599"
          },
          {
            "name": "政和县",
            "code": "0599"
          },
          {
            "name": "邵武市",
            "code": "0599"
          },
          {
            "name": "武夷山市",
            "code": "0599"
          },
          {
            "name": "建瓯市",
            "code": "0599"
          }
        ]
      },
      {
        "name": "龙岩市",
        "code": "0597",
        "sub": [
          {
            "name": "新罗区",
            "code": "0597"
          },
          {
            "name": "永定区",
            "code": "0597"
          },
          {
            "name": "长汀县",
            "code": "0597"
          },
          {
            "name": "上杭县",
            "code": "0597"
          },
          {
            "name": "武平县",
            "code": "0597"
          },
          {
            "name": "连城县",
            "code": "0597"
          },
          {
            "name": "漳平市",
            "code": "0597"
          }
        ]
      },
      {
        "name": "宁德市",
        "code": "0593",
        "sub": [
          {
            "name": "蕉城区",
            "code": "0593"
          },
          {
            "name": "霞浦县",
            "code": "0593"
          },
          {
            "name": "古田县",
            "code": "0593"
          },
          {
            "name": "屏南县",
            "code": "0593"
          },
          {
            "name": "寿宁县",
            "code": "0593"
          },
          {
            "name": "周宁县",
            "code": "0593"
          },
          {
            "name": "柘荣县",
            "code": "0593"
          },
          {
            "name": "福安市",
            "code": "0593"
          },
          {
            "name": "福鼎市",
            "code": "0593"
          }
        ]
      }
    ]
  },
  {
    "name": "江西省",
    "code": "36",
    "sub": [
      {
        "name": "南昌市",
        "code": "0791",
        "sub": [
          {
            "name": "东湖区",
            "code": "0791"
          },
          {
            "name": "西湖区",
            "code": "0791"
          },
          {
            "name": "青云谱区",
            "code": "0791"
          },
          {
            "name": "湾里区",
            "code": "0791"
          },
          {
            "name": "青山湖区",
            "code": "0791"
          },
          {
            "name": "新建区",
            "code": "0791"
          },
          {
            "name": "南昌县",
            "code": "0791"
          },
          {
            "name": "安义县",
            "code": "0791"
          },
          {
            "name": "进贤县",
            "code": "0791"
          }
        ]
      },
      {
        "name": "景德镇市",
        "code": "0798",
        "sub": [
          {
            "name": "昌江区",
            "code": "0798"
          },
          {
            "name": "珠山区",
            "code": "0798"
          },
          {
            "name": "浮梁县",
            "code": "0798"
          },
          {
            "name": "乐平市",
            "code": "0798"
          }
        ]
      },
      {
        "name": "萍乡市",
        "code": "0799",
        "sub": [
          {
            "name": "安源区",
            "code": "0799"
          },
          {
            "name": "湘东区",
            "code": "0799"
          },
          {
            "name": "莲花县",
            "code": "0799"
          },
          {
            "name": "上栗县",
            "code": "0799"
          },
          {
            "name": "芦溪县",
            "code": "0799"
          }
        ]
      },
      {
        "name": "九江市",
        "code": "0792",
        "sub": [
          {
            "name": "濂溪区",
            "code": "0792"
          },
          {
            "name": "浔阳区",
            "code": "0792"
          },
          {
            "name": "九江县",
            "code": "0792"
          },
          {
            "name": "武宁县",
            "code": "0792"
          },
          {
            "name": "修水县",
            "code": "0792"
          },
          {
            "name": "永修县",
            "code": "0792"
          },
          {
            "name": "德安县",
            "code": "0792"
          },
          {
            "name": "庐山市",
            "code": "0792"
          },
          {
            "name": "都昌县",
            "code": "0792"
          },
          {
            "name": "湖口县",
            "code": "0792"
          },
          {
            "name": "彭泽县",
            "code": "0792"
          },
          {
            "name": "瑞昌市",
            "code": "0792"
          },
          {
            "name": "共青城市",
            "code": "0792"
          }
        ]
      },
      {
        "name": "新余市",
        "code": "0790",
        "sub": [
          {
            "name": "渝水区",
            "code": "0790"
          },
          {
            "name": "分宜县",
            "code": "0790"
          }
        ]
      },
      {
        "name": "鹰潭市",
        "code": "0701",
        "sub": [
          {
            "name": "月湖区",
            "code": "0701"
          },
          {
            "name": "余江县",
            "code": "0701"
          },
          {
            "name": "贵溪市",
            "code": "0701"
          }
        ]
      },
      {
        "name": "赣州市",
        "code": "0797",
        "sub": [
          {
            "name": "章贡区",
            "code": "0797"
          },
          {
            "name": "南康区",
            "code": "0797"
          },
          {
            "name": "赣县区",
            "code": "0797"
          },
          {
            "name": "信丰县",
            "code": "0797"
          },
          {
            "name": "大余县",
            "code": "0797"
          },
          {
            "name": "上犹县",
            "code": "0797"
          },
          {
            "name": "崇义县",
            "code": "0797"
          },
          {
            "name": "安远县",
            "code": "0797"
          },
          {
            "name": "龙南县",
            "code": "0797"
          },
          {
            "name": "定南县",
            "code": "0797"
          },
          {
            "name": "全南县",
            "code": "0797"
          },
          {
            "name": "宁都县",
            "code": "0797"
          },
          {
            "name": "于都县",
            "code": "0797"
          },
          {
            "name": "兴国县",
            "code": "0797"
          },
          {
            "name": "会昌县",
            "code": "0797"
          },
          {
            "name": "寻乌县",
            "code": "0797"
          },
          {
            "name": "石城县",
            "code": "0797"
          },
          {
            "name": "瑞金市",
            "code": "0797"
          }
        ]
      },
      {
        "name": "吉安市",
        "code": "0796",
        "sub": [
          {
            "name": "吉州区",
            "code": "0796"
          },
          {
            "name": "青原区",
            "code": "0796"
          },
          {
            "name": "吉安县",
            "code": "0796"
          },
          {
            "name": "吉水县",
            "code": "0796"
          },
          {
            "name": "峡江县",
            "code": "0796"
          },
          {
            "name": "新干县",
            "code": "0796"
          },
          {
            "name": "永丰县",
            "code": "0796"
          },
          {
            "name": "泰和县",
            "code": "0796"
          },
          {
            "name": "遂川县",
            "code": "0796"
          },
          {
            "name": "万安县",
            "code": "0796"
          },
          {
            "name": "安福县",
            "code": "0796"
          },
          {
            "name": "永新县",
            "code": "0796"
          },
          {
            "name": "井冈山市",
            "code": "0796"
          }
        ]
      },
      {
        "name": "宜春市",
        "code": "0795",
        "sub": [
          {
            "name": "袁州区",
            "code": "0795"
          },
          {
            "name": "奉新县",
            "code": "0795"
          },
          {
            "name": "万载县",
            "code": "0795"
          },
          {
            "name": "上高县",
            "code": "0795"
          },
          {
            "name": "宜丰县",
            "code": "0795"
          },
          {
            "name": "靖安县",
            "code": "0795"
          },
          {
            "name": "铜鼓县",
            "code": "0795"
          },
          {
            "name": "丰城市",
            "code": "0795"
          },
          {
            "name": "樟树市",
            "code": "0795"
          },
          {
            "name": "高安市",
            "code": "0795"
          }
        ]
      },
      {
        "name": "抚州市",
        "code": "0794",
        "sub": [
          {
            "name": "临川区",
            "code": "0794"
          },
          {
            "name": "南城县",
            "code": "0794"
          },
          {
            "name": "黎川县",
            "code": "0794"
          },
          {
            "name": "南丰县",
            "code": "0794"
          },
          {
            "name": "崇仁县",
            "code": "0794"
          },
          {
            "name": "乐安县",
            "code": "0794"
          },
          {
            "name": "宜黄县",
            "code": "0794"
          },
          {
            "name": "金溪县",
            "code": "0794"
          },
          {
            "name": "资溪县",
            "code": "0794"
          },
          {
            "name": "东乡区",
            "code": "0794"
          },
          {
            "name": "广昌县",
            "code": "0794"
          }
        ]
      },
      {
        "name": "上饶市",
        "code": "0793",
        "sub": [
          {
            "name": "信州区",
            "code": "0793"
          },
          {
            "name": "广丰区",
            "code": "0793"
          },
          {
            "name": "上饶县",
            "code": "0793"
          },
          {
            "name": "玉山县",
            "code": "0793"
          },
          {
            "name": "铅山县",
            "code": "0793"
          },
          {
            "name": "横峰县",
            "code": "0793"
          },
          {
            "name": "弋阳县",
            "code": "0793"
          },
          {
            "name": "余干县",
            "code": "0793"
          },
          {
            "name": "鄱阳县",
            "code": "0793"
          },
          {
            "name": "万年县",
            "code": "0793"
          },
          {
            "name": "婺源县",
            "code": "0793"
          },
          {
            "name": "德兴市",
            "code": "0793"
          }
        ]
      }
    ]
  },
  {
    "name": "山东省",
    "code": "37",
    "sub": [
      {
        "name": "济南市",
        "code": "0531",
        "sub": [
          {
            "name": "历下区",
            "code": "0531"
          },
          {
            "name": "市中区",
            "code": "0531"
          },
          {
            "name": "槐荫区",
            "code": "0531"
          },
          {
            "name": "天桥区",
            "code": "0531"
          },
          {
            "name": "历城区",
            "code": "0531"
          },
          {
            "name": "长清区",
            "code": "0531"
          },
          {
            "name": "平阴县",
            "code": "0531"
          },
          {
            "name": "济阳县",
            "code": "0531"
          },
          {
            "name": "商河县",
            "code": "0531"
          },
          {
            "name": "章丘区",
            "code": "0531"
          }
        ]
      },
      {
        "name": "青岛市",
        "code": "0532",
        "sub": [
          {
            "name": "市南区",
            "code": "0532"
          },
          {
            "name": "市北区",
            "code": "0532"
          },
          {
            "name": "黄岛区",
            "code": "0532"
          },
          {
            "name": "崂山区",
            "code": "0532"
          },
          {
            "name": "李沧区",
            "code": "0532"
          },
          {
            "name": "城阳区",
            "code": "0532"
          },
          {
            "name": "胶州市",
            "code": "0532"
          },
          {
            "name": "即墨市",
            "code": "0532"
          },
          {
            "name": "平度市",
            "code": "0532"
          },
          {
            "name": "莱西市",
            "code": "0532"
          }
        ]
      },
      {
        "name": "淄博市",
        "code": "0533",
        "sub": [
          {
            "name": "淄川区",
            "code": "0533"
          },
          {
            "name": "张店区",
            "code": "0533"
          },
          {
            "name": "博山区",
            "code": "0533"
          },
          {
            "name": "临淄区",
            "code": "0533"
          },
          {
            "name": "周村区",
            "code": "0533"
          },
          {
            "name": "桓台县",
            "code": "0533"
          },
          {
            "name": "高青县",
            "code": "0533"
          },
          {
            "name": "沂源县",
            "code": "0533"
          }
        ]
      },
      {
        "name": "枣庄市",
        "code": "0632",
        "sub": [
          {
            "name": "市中区",
            "code": "0632"
          },
          {
            "name": "薛城区",
            "code": "0632"
          },
          {
            "name": "峄城区",
            "code": "0632"
          },
          {
            "name": "台儿庄区",
            "code": "0632"
          },
          {
            "name": "山亭区",
            "code": "0632"
          },
          {
            "name": "滕州市",
            "code": "0632"
          }
        ]
      },
      {
        "name": "东营市",
        "code": "0546",
        "sub": [
          {
            "name": "东营区",
            "code": "0546"
          },
          {
            "name": "河口区",
            "code": "0546"
          },
          {
            "name": "垦利区",
            "code": "0546"
          },
          {
            "name": "利津县",
            "code": "0546"
          },
          {
            "name": "广饶县",
            "code": "0546"
          }
        ]
      },
      {
        "name": "烟台市",
        "code": "0535",
        "sub": [
          {
            "name": "芝罘区",
            "code": "0535"
          },
          {
            "name": "福山区",
            "code": "0535"
          },
          {
            "name": "牟平区",
            "code": "0535"
          },
          {
            "name": "莱山区",
            "code": "0535"
          },
          {
            "name": "长岛县",
            "code": "0535"
          },
          {
            "name": "龙口市",
            "code": "0535"
          },
          {
            "name": "莱阳市",
            "code": "0535"
          },
          {
            "name": "莱州市",
            "code": "0535"
          },
          {
            "name": "蓬莱市",
            "code": "0535"
          },
          {
            "name": "招远市",
            "code": "0535"
          },
          {
            "name": "栖霞市",
            "code": "0535"
          },
          {
            "name": "海阳市",
            "code": "0535"
          }
        ]
      },
      {
        "name": "潍坊市",
        "code": "0536",
        "sub": [
          {
            "name": "潍城区",
            "code": "0536"
          },
          {
            "name": "寒亭区",
            "code": "0536"
          },
          {
            "name": "坊子区",
            "code": "0536"
          },
          {
            "name": "奎文区",
            "code": "0536"
          },
          {
            "name": "临朐县",
            "code": "0536"
          },
          {
            "name": "昌乐县",
            "code": "0536"
          },
          {
            "name": "青州市",
            "code": "0536"
          },
          {
            "name": "诸城市",
            "code": "0536"
          },
          {
            "name": "寿光市",
            "code": "0536"
          },
          {
            "name": "安丘市",
            "code": "0536"
          },
          {
            "name": "高密市",
            "code": "0536"
          },
          {
            "name": "昌邑市",
            "code": "0536"
          }
        ]
      },
      {
        "name": "济宁市",
        "code": "0537",
        "sub": [
          {
            "name": "任城区",
            "code": "0537"
          },
          {
            "name": "兖州区",
            "code": "0537"
          },
          {
            "name": "微山县",
            "code": "0537"
          },
          {
            "name": "鱼台县",
            "code": "0537"
          },
          {
            "name": "金乡县",
            "code": "0537"
          },
          {
            "name": "嘉祥县",
            "code": "0537"
          },
          {
            "name": "汶上县",
            "code": "0537"
          },
          {
            "name": "泗水县",
            "code": "0537"
          },
          {
            "name": "梁山县",
            "code": "0537"
          },
          {
            "name": "曲阜市",
            "code": "0537"
          },
          {
            "name": "邹城市",
            "code": "0537"
          }
        ]
      },
      {
        "name": "泰安市",
        "code": "0538",
        "sub": [
          {
            "name": "泰山区",
            "code": "0538"
          },
          {
            "name": "岱岳区",
            "code": "0538"
          },
          {
            "name": "宁阳县",
            "code": "0538"
          },
          {
            "name": "东平县",
            "code": "0538"
          },
          {
            "name": "新泰市",
            "code": "0538"
          },
          {
            "name": "肥城市",
            "code": "0538"
          }
        ]
      },
      {
        "name": "威海市",
        "code": "0631",
        "sub": [
          {
            "name": "环翠区",
            "code": "0631"
          },
          {
            "name": "文登区",
            "code": "0631"
          },
          {
            "name": "荣成市",
            "code": "0631"
          },
          {
            "name": "乳山市",
            "code": "0631"
          }
        ]
      },
      {
        "name": "日照市",
        "code": "0633",
        "sub": [
          {
            "name": "东港区",
            "code": "0633"
          },
          {
            "name": "岚山区",
            "code": "0633"
          },
          {
            "name": "五莲县",
            "code": "0633"
          },
          {
            "name": "莒县",
            "code": "0633"
          }
        ]
      },
      {
        "name": "莱芜市",
        "code": "0634",
        "sub": [
          {
            "name": "莱城区",
            "code": "0634"
          },
          {
            "name": "钢城区",
            "code": "0634"
          }
        ]
      },
      {
        "name": "临沂市",
        "code": "0539",
        "sub": [
          {
            "name": "兰山区",
            "code": "0539"
          },
          {
            "name": "罗庄区",
            "code": "0539"
          },
          {
            "name": "河东区",
            "code": "0539"
          },
          {
            "name": "沂南县",
            "code": "0539"
          },
          {
            "name": "郯城县",
            "code": "0539"
          },
          {
            "name": "沂水县",
            "code": "0539"
          },
          {
            "name": "兰陵县",
            "code": "0539"
          },
          {
            "name": "费县",
            "code": "0539"
          },
          {
            "name": "平邑县",
            "code": "0539"
          },
          {
            "name": "莒南县",
            "code": "0539"
          },
          {
            "name": "蒙阴县",
            "code": "0539"
          },
          {
            "name": "临沭县",
            "code": "0539"
          }
        ]
      },
      {
        "name": "德州市",
        "code": "0534",
        "sub": [
          {
            "name": "德城区",
            "code": "0534"
          },
          {
            "name": "陵城区",
            "code": "0534"
          },
          {
            "name": "宁津县",
            "code": "0534"
          },
          {
            "name": "庆云县",
            "code": "0534"
          },
          {
            "name": "临邑县",
            "code": "0534"
          },
          {
            "name": "齐河县",
            "code": "0534"
          },
          {
            "name": "平原县",
            "code": "0534"
          },
          {
            "name": "夏津县",
            "code": "0534"
          },
          {
            "name": "武城县",
            "code": "0534"
          },
          {
            "name": "乐陵市",
            "code": "0534"
          },
          {
            "name": "禹城市",
            "code": "0534"
          }
        ]
      },
      {
        "name": "聊城市",
        "code": "0635",
        "sub": [
          {
            "name": "东昌府区",
            "code": "0635"
          },
          {
            "name": "阳谷县",
            "code": "0635"
          },
          {
            "name": "莘县",
            "code": "0635"
          },
          {
            "name": "茌平县",
            "code": "0635"
          },
          {
            "name": "东阿县",
            "code": "0635"
          },
          {
            "name": "冠县",
            "code": "0635"
          },
          {
            "name": "高唐县",
            "code": "0635"
          },
          {
            "name": "临清市",
            "code": "0635"
          }
        ]
      },
      {
        "name": "滨州市",
        "code": "0543",
        "sub": [
          {
            "name": "滨城区",
            "code": "0543"
          },
          {
            "name": "沾化区",
            "code": "0543"
          },
          {
            "name": "惠民县",
            "code": "0543"
          },
          {
            "name": "阳信县",
            "code": "0543"
          },
          {
            "name": "无棣县",
            "code": "0543"
          },
          {
            "name": "博兴县",
            "code": "0543"
          },
          {
            "name": "邹平县",
            "code": "0543"
          }
        ]
      },
      {
        "name": "菏泽市",
        "code": "0530",
        "sub": [
          {
            "name": "牡丹区",
            "code": "0530"
          },
          {
            "name": "定陶区",
            "code": "0530"
          },
          {
            "name": "曹县",
            "code": "0530"
          },
          {
            "name": "单县",
            "code": "0530"
          },
          {
            "name": "成武县",
            "code": "0530"
          },
          {
            "name": "巨野县",
            "code": "0530"
          },
          {
            "name": "郓城县",
            "code": "0530"
          },
          {
            "name": "鄄城县",
            "code": "0530"
          },
          {
            "name": "东明县",
            "code": "0530"
          }
        ]
      }
    ]
  },
  {
    "name": "河南省",
    "code": "41",
    "sub": [
      {
        "name": "郑州市",
        "code": "0371",
        "sub": [
          {
            "name": "中原区",
            "code": "0371"
          },
          {
            "name": "二七区",
            "code": "0371"
          },
          {
            "name": "管城回族区",
            "code": "0371"
          },
          {
            "name": "金水区",
            "code": "0371"
          },
          {
            "name": "上街区",
            "code": "0371"
          },
          {
            "name": "惠济区",
            "code": "0371"
          },
          {
            "name": "中牟县",
            "code": "0371"
          },
          {
            "name": "巩义市",
            "code": "0371"
          },
          {
            "name": "荥阳市",
            "code": "0371"
          },
          {
            "name": "新密市",
            "code": "0371"
          },
          {
            "name": "新郑市",
            "code": "0371"
          },
          {
            "name": "登封市",
            "code": "0371"
          }
        ]
      },
      {
        "name": "开封市",
        "code": "0378",
        "sub": [
          {
            "name": "龙亭区",
            "code": "0378"
          },
          {
            "name": "顺河回族区",
            "code": "0378"
          },
          {
            "name": "鼓楼区",
            "code": "0378"
          },
          {
            "name": "禹王台区",
            "code": "0378"
          },
          {
            "name": "祥符区",
            "code": "0378"
          },
          {
            "name": "杞县",
            "code": "0378"
          },
          {
            "name": "通许县",
            "code": "0378"
          },
          {
            "name": "尉氏县",
            "code": "0378"
          },
          {
            "name": "兰考县",
            "code": "0378"
          }
        ]
      },
      {
        "name": "洛阳市",
        "code": "0379",
        "sub": [
          {
            "name": "老城区",
            "code": "0379"
          },
          {
            "name": "西工区",
            "code": "0379"
          },
          {
            "name": "瀍河回族区",
            "code": "0379"
          },
          {
            "name": "涧西区",
            "code": "0379"
          },
          {
            "name": "吉利区",
            "code": "0379"
          },
          {
            "name": "洛龙区",
            "code": "0379"
          },
          {
            "name": "孟津县",
            "code": "0379"
          },
          {
            "name": "新安县",
            "code": "0379"
          },
          {
            "name": "栾川县",
            "code": "0379"
          },
          {
            "name": "嵩县",
            "code": "0379"
          },
          {
            "name": "汝阳县",
            "code": "0379"
          },
          {
            "name": "宜阳县",
            "code": "0379"
          },
          {
            "name": "洛宁县",
            "code": "0379"
          },
          {
            "name": "伊川县",
            "code": "0379"
          },
          {
            "name": "偃师市",
            "code": "0379"
          }
        ]
      },
      {
        "name": "平顶山市",
        "code": "0375",
        "sub": [
          {
            "name": "新华区",
            "code": "0375"
          },
          {
            "name": "卫东区",
            "code": "0375"
          },
          {
            "name": "石龙区",
            "code": "0375"
          },
          {
            "name": "湛河区",
            "code": "0375"
          },
          {
            "name": "宝丰县",
            "code": "0375"
          },
          {
            "name": "叶县",
            "code": "0375"
          },
          {
            "name": "鲁山县",
            "code": "0375"
          },
          {
            "name": "郏县",
            "code": "0375"
          },
          {
            "name": "舞钢市",
            "code": "0375"
          },
          {
            "name": "汝州市",
            "code": "0375"
          }
        ]
      },
      {
        "name": "安阳市",
        "code": "0372",
        "sub": [
          {
            "name": "文峰区",
            "code": "0372"
          },
          {
            "name": "北关区",
            "code": "0372"
          },
          {
            "name": "殷都区",
            "code": "0372"
          },
          {
            "name": "龙安区",
            "code": "0372"
          },
          {
            "name": "安阳县",
            "code": "0372"
          },
          {
            "name": "汤阴县",
            "code": "0372"
          },
          {
            "name": "滑县",
            "code": "0372"
          },
          {
            "name": "内黄县",
            "code": "0372"
          },
          {
            "name": "林州市",
            "code": "0372"
          }
        ]
      },
      {
        "name": "鹤壁市",
        "code": "0392",
        "sub": [
          {
            "name": "鹤山区",
            "code": "0392"
          },
          {
            "name": "山城区",
            "code": "0392"
          },
          {
            "name": "淇滨区",
            "code": "0392"
          },
          {
            "name": "浚县",
            "code": "0392"
          },
          {
            "name": "淇县",
            "code": "0392"
          }
        ]
      },
      {
        "name": "新乡市",
        "code": "0373",
        "sub": [
          {
            "name": "红旗区",
            "code": "0373"
          },
          {
            "name": "卫滨区",
            "code": "0373"
          },
          {
            "name": "凤泉区",
            "code": "0373"
          },
          {
            "name": "牧野区",
            "code": "0373"
          },
          {
            "name": "新乡县",
            "code": "0373"
          },
          {
            "name": "获嘉县",
            "code": "0373"
          },
          {
            "name": "原阳县",
            "code": "0373"
          },
          {
            "name": "延津县",
            "code": "0373"
          },
          {
            "name": "封丘县",
            "code": "0373"
          },
          {
            "name": "长垣县",
            "code": "0373"
          },
          {
            "name": "卫辉市",
            "code": "0373"
          },
          {
            "name": "辉县市",
            "code": "0373"
          }
        ]
      },
      {
        "name": "焦作市",
        "code": "0391",
        "sub": [
          {
            "name": "解放区",
            "code": "0391"
          },
          {
            "name": "中站区",
            "code": "0391"
          },
          {
            "name": "马村区",
            "code": "0391"
          },
          {
            "name": "山阳区",
            "code": "0391"
          },
          {
            "name": "修武县",
            "code": "0391"
          },
          {
            "name": "博爱县",
            "code": "0391"
          },
          {
            "name": "武陟县",
            "code": "0391"
          },
          {
            "name": "温县",
            "code": "0391"
          },
          {
            "name": "沁阳市",
            "code": "0391"
          },
          {
            "name": "孟州市",
            "code": "0391"
          }
        ]
      },
      {
        "name": "濮阳市",
        "code": "0393",
        "sub": [
          {
            "name": "华龙区",
            "code": "0393"
          },
          {
            "name": "清丰县",
            "code": "0393"
          },
          {
            "name": "南乐县",
            "code": "0393"
          },
          {
            "name": "范县",
            "code": "0393"
          },
          {
            "name": "台前县",
            "code": "0393"
          },
          {
            "name": "濮阳县",
            "code": "0393"
          }
        ]
      },
      {
        "name": "许昌市",
        "code": "0374",
        "sub": [
          {
            "name": "魏都区",
            "code": "0374"
          },
          {
            "name": "建安区",
            "code": "0374"
          },
          {
            "name": "鄢陵县",
            "code": "0374"
          },
          {
            "name": "襄城县",
            "code": "0374"
          },
          {
            "name": "禹州市",
            "code": "0374"
          },
          {
            "name": "长葛市",
            "code": "0374"
          }
        ]
      },
      {
        "name": "漯河市",
        "code": "0395",
        "sub": [
          {
            "name": "源汇区",
            "code": "0395"
          },
          {
            "name": "郾城区",
            "code": "0395"
          },
          {
            "name": "召陵区",
            "code": "0395"
          },
          {
            "name": "舞阳县",
            "code": "0395"
          },
          {
            "name": "临颍县",
            "code": "0395"
          }
        ]
      },
      {
        "name": "三门峡市",
        "code": "0398",
        "sub": [
          {
            "name": "湖滨区",
            "code": "0398"
          },
          {
            "name": "陕州区",
            "code": "0398"
          },
          {
            "name": "渑池县",
            "code": "0398"
          },
          {
            "name": "卢氏县",
            "code": "0398"
          },
          {
            "name": "义马市",
            "code": "0398"
          },
          {
            "name": "灵宝市",
            "code": "0398"
          }
        ]
      },
      {
        "name": "南阳市",
        "code": "0377",
        "sub": [
          {
            "name": "宛城区",
            "code": "0377"
          },
          {
            "name": "卧龙区",
            "code": "0377"
          },
          {
            "name": "南召县",
            "code": "0377"
          },
          {
            "name": "方城县",
            "code": "0377"
          },
          {
            "name": "西峡县",
            "code": "0377"
          },
          {
            "name": "镇平县",
            "code": "0377"
          },
          {
            "name": "内乡县",
            "code": "0377"
          },
          {
            "name": "淅川县",
            "code": "0377"
          },
          {
            "name": "社旗县",
            "code": "0377"
          },
          {
            "name": "唐河县",
            "code": "0377"
          },
          {
            "name": "新野县",
            "code": "0377"
          },
          {
            "name": "桐柏县",
            "code": "0377"
          },
          {
            "name": "邓州市",
            "code": "0377"
          }
        ]
      },
      {
        "name": "商丘市",
        "code": "0370",
        "sub": [
          {
            "name": "梁园区",
            "code": "0370"
          },
          {
            "name": "睢阳区",
            "code": "0370"
          },
          {
            "name": "民权县",
            "code": "0370"
          },
          {
            "name": "睢县",
            "code": "0370"
          },
          {
            "name": "宁陵县",
            "code": "0370"
          },
          {
            "name": "柘城县",
            "code": "0370"
          },
          {
            "name": "虞城县",
            "code": "0370"
          },
          {
            "name": "夏邑县",
            "code": "0370"
          },
          {
            "name": "永城市",
            "code": "0370"
          }
        ]
      },
      {
        "name": "信阳市",
        "code": "0376",
        "sub": [
          {
            "name": "浉河区",
            "code": "0376"
          },
          {
            "name": "平桥区",
            "code": "0376"
          },
          {
            "name": "罗山县",
            "code": "0376"
          },
          {
            "name": "光山县",
            "code": "0376"
          },
          {
            "name": "新县",
            "code": "0376"
          },
          {
            "name": "商城县",
            "code": "0376"
          },
          {
            "name": "固始县",
            "code": "0376"
          },
          {
            "name": "潢川县",
            "code": "0376"
          },
          {
            "name": "淮滨县",
            "code": "0376"
          },
          {
            "name": "息县",
            "code": "0376"
          }
        ]
      },
      {
        "name": "周口市",
        "code": "0394",
        "sub": [
          {
            "name": "川汇区",
            "code": "0394"
          },
          {
            "name": "扶沟县",
            "code": "0394"
          },
          {
            "name": "西华县",
            "code": "0394"
          },
          {
            "name": "商水县",
            "code": "0394"
          },
          {
            "name": "沈丘县",
            "code": "0394"
          },
          {
            "name": "郸城县",
            "code": "0394"
          },
          {
            "name": "淮阳县",
            "code": "0394"
          },
          {
            "name": "太康县",
            "code": "0394"
          },
          {
            "name": "鹿邑县",
            "code": "0394"
          },
          {
            "name": "项城市",
            "code": "0394"
          }
        ]
      },
      {
        "name": "驻马店市",
        "code": "0396",
        "sub": [
          {
            "name": "驿城区",
            "code": "0396"
          },
          {
            "name": "西平县",
            "code": "0396"
          },
          {
            "name": "上蔡县",
            "code": "0396"
          },
          {
            "name": "平舆县",
            "code": "0396"
          },
          {
            "name": "正阳县",
            "code": "0396"
          },
          {
            "name": "确山县",
            "code": "0396"
          },
          {
            "name": "泌阳县",
            "code": "0396"
          },
          {
            "name": "汝南县",
            "code": "0396"
          },
          {
            "name": "遂平县",
            "code": "0396"
          },
          {
            "name": "新蔡县",
            "code": "0396"
          }
        ]
      },
      {
        "name": "济源市",
        "code": "1391",
        "sub": []
      }
    ]
  },
  {
    "name": "湖北省",
    "code": "42",
    "sub": [
      {
        "name": "武汉市",
        "code": "027",
        "sub": [
          {
            "name": "江岸区",
            "code": "027"
          },
          {
            "name": "江汉区",
            "code": "027"
          },
          {
            "name": "硚口区",
            "code": "027"
          },
          {
            "name": "汉阳区",
            "code": "027"
          },
          {
            "name": "武昌区",
            "code": "027"
          },
          {
            "name": "青山区",
            "code": "027"
          },
          {
            "name": "洪山区",
            "code": "027"
          },
          {
            "name": "东西湖区",
            "code": "027"
          },
          {
            "name": "汉南区",
            "code": "027"
          },
          {
            "name": "蔡甸区",
            "code": "027"
          },
          {
            "name": "江夏区",
            "code": "027"
          },
          {
            "name": "黄陂区",
            "code": "027"
          },
          {
            "name": "新洲区",
            "code": "027"
          }
        ]
      },
      {
        "name": "黄石市",
        "code": "0714",
        "sub": [
          {
            "name": "黄石港区",
            "code": "0714"
          },
          {
            "name": "西塞山区",
            "code": "0714"
          },
          {
            "name": "下陆区",
            "code": "0714"
          },
          {
            "name": "铁山区",
            "code": "0714"
          },
          {
            "name": "阳新县",
            "code": "0714"
          },
          {
            "name": "大冶市",
            "code": "0714"
          }
        ]
      },
      {
        "name": "十堰市",
        "code": "0719",
        "sub": [
          {
            "name": "茅箭区",
            "code": "0719"
          },
          {
            "name": "张湾区",
            "code": "0719"
          },
          {
            "name": "郧阳区",
            "code": "0719"
          },
          {
            "name": "郧西县",
            "code": "0719"
          },
          {
            "name": "竹山县",
            "code": "0719"
          },
          {
            "name": "竹溪县",
            "code": "0719"
          },
          {
            "name": "房县",
            "code": "0719"
          },
          {
            "name": "丹江口市",
            "code": "0719"
          }
        ]
      },
      {
        "name": "宜昌市",
        "code": "0717",
        "sub": [
          {
            "name": "西陵区",
            "code": "0717"
          },
          {
            "name": "伍家岗区",
            "code": "0717"
          },
          {
            "name": "点军区",
            "code": "0717"
          },
          {
            "name": "猇亭区",
            "code": "0717"
          },
          {
            "name": "夷陵区",
            "code": "0717"
          },
          {
            "name": "远安县",
            "code": "0717"
          },
          {
            "name": "兴山县",
            "code": "0717"
          },
          {
            "name": "秭归县",
            "code": "0717"
          },
          {
            "name": "长阳土家族自治县",
            "code": "0717"
          },
          {
            "name": "五峰土家族自治县",
            "code": "0717"
          },
          {
            "name": "宜都市",
            "code": "0717"
          },
          {
            "name": "当阳市",
            "code": "0717"
          },
          {
            "name": "枝江市",
            "code": "0717"
          }
        ]
      },
      {
        "name": "襄阳市",
        "code": "0710",
        "sub": [
          {
            "name": "襄城区",
            "code": "0710"
          },
          {
            "name": "樊城区",
            "code": "0710"
          },
          {
            "name": "襄州区",
            "code": "0710"
          },
          {
            "name": "南漳县",
            "code": "0710"
          },
          {
            "name": "谷城县",
            "code": "0710"
          },
          {
            "name": "保康县",
            "code": "0710"
          },
          {
            "name": "老河口市",
            "code": "0710"
          },
          {
            "name": "枣阳市",
            "code": "0710"
          },
          {
            "name": "宜城市",
            "code": "0710"
          }
        ]
      },
      {
        "name": "鄂州市",
        "code": "0711",
        "sub": [
          {
            "name": "梁子湖区",
            "code": "0711"
          },
          {
            "name": "华容区",
            "code": "0711"
          },
          {
            "name": "鄂城区",
            "code": "0711"
          }
        ]
      },
      {
        "name": "荆门市",
        "code": "0724",
        "sub": [
          {
            "name": "东宝区",
            "code": "0724"
          },
          {
            "name": "掇刀区",
            "code": "0724"
          },
          {
            "name": "京山县",
            "code": "0724"
          },
          {
            "name": "沙洋县",
            "code": "0724"
          },
          {
            "name": "钟祥市",
            "code": "0724"
          }
        ]
      },
      {
        "name": "孝感市",
        "code": "0712",
        "sub": [
          {
            "name": "孝南区",
            "code": "0712"
          },
          {
            "name": "孝昌县",
            "code": "0712"
          },
          {
            "name": "大悟县",
            "code": "0712"
          },
          {
            "name": "云梦县",
            "code": "0712"
          },
          {
            "name": "应城市",
            "code": "0712"
          },
          {
            "name": "安陆市",
            "code": "0712"
          },
          {
            "name": "汉川市",
            "code": "0712"
          }
        ]
      },
      {
        "name": "荆州市",
        "code": "0716",
        "sub": [
          {
            "name": "沙市区",
            "code": "0716"
          },
          {
            "name": "荆州区",
            "code": "0716"
          },
          {
            "name": "公安县",
            "code": "0716"
          },
          {
            "name": "监利县",
            "code": "0716"
          },
          {
            "name": "江陵县",
            "code": "0716"
          },
          {
            "name": "石首市",
            "code": "0716"
          },
          {
            "name": "洪湖市",
            "code": "0716"
          },
          {
            "name": "松滋市",
            "code": "0716"
          }
        ]
      },
      {
        "name": "黄冈市",
        "code": "0713",
        "sub": [
          {
            "name": "黄州区",
            "code": "0713"
          },
          {
            "name": "团风县",
            "code": "0713"
          },
          {
            "name": "红安县",
            "code": "0713"
          },
          {
            "name": "罗田县",
            "code": "0713"
          },
          {
            "name": "英山县",
            "code": "0713"
          },
          {
            "name": "浠水县",
            "code": "0713"
          },
          {
            "name": "蕲春县",
            "code": "0713"
          },
          {
            "name": "黄梅县",
            "code": "0713"
          },
          {
            "name": "麻城市",
            "code": "0713"
          },
          {
            "name": "武穴市",
            "code": "0713"
          }
        ]
      },
      {
        "name": "咸宁市",
        "code": "0715",
        "sub": [
          {
            "name": "咸安区",
            "code": "0715"
          },
          {
            "name": "嘉鱼县",
            "code": "0715"
          },
          {
            "name": "通城县",
            "code": "0715"
          },
          {
            "name": "崇阳县",
            "code": "0715"
          },
          {
            "name": "通山县",
            "code": "0715"
          },
          {
            "name": "赤壁市",
            "code": "0715"
          }
        ]
      },
      {
        "name": "随州市",
        "code": "0722",
        "sub": [
          {
            "name": "曾都区",
            "code": "0722"
          },
          {
            "name": "随县",
            "code": "0722"
          },
          {
            "name": "广水市",
            "code": "0722"
          }
        ]
      },
      {
        "name": "恩施土家族苗族自治州",
        "code": "0718",
        "sub": [
          {
            "name": "恩施市",
            "code": "0718"
          },
          {
            "name": "利川市",
            "code": "0718"
          },
          {
            "name": "建始县",
            "code": "0718"
          },
          {
            "name": "巴东县",
            "code": "0718"
          },
          {
            "name": "宣恩县",
            "code": "0718"
          },
          {
            "name": "咸丰县",
            "code": "0718"
          },
          {
            "name": "来凤县",
            "code": "0718"
          },
          {
            "name": "鹤峰县",
            "code": "0718"
          }
        ]
      },
      {
        "name": "潜江市",
        "code": "2728",
        "sub": []
      },
      {
        "name": "神农架林区",
        "code": "1719",
        "sub": []
      },
      {
        "name": "天门市",
        "code": "1728",
        "sub": []
      },
      {
        "name": "仙桃市",
        "code": "0728",
        "sub": []
      }
    ]
  },
  {
    "name": "湖南省",
    "code": "43",
    "sub": [
      {
        "name": "长沙市",
        "code": "0731",
        "sub": [
          {
            "name": "芙蓉区",
            "code": "0731"
          },
          {
            "name": "天心区",
            "code": "0731"
          },
          {
            "name": "岳麓区",
            "code": "0731"
          },
          {
            "name": "开福区",
            "code": "0731"
          },
          {
            "name": "雨花区",
            "code": "0731"
          },
          {
            "name": "望城区",
            "code": "0731"
          },
          {
            "name": "长沙县",
            "code": "0731"
          },
          {
            "name": "宁乡市",
            "code": "0731"
          },
          {
            "name": "浏阳市",
            "code": "0731"
          }
        ]
      },
      {
        "name": "株洲市",
        "code": "0733",
        "sub": [
          {
            "name": "荷塘区",
            "code": "0733"
          },
          {
            "name": "芦淞区",
            "code": "0733"
          },
          {
            "name": "石峰区",
            "code": "0733"
          },
          {
            "name": "天元区",
            "code": "0733"
          },
          {
            "name": "株洲县",
            "code": "0733"
          },
          {
            "name": "攸县",
            "code": "0733"
          },
          {
            "name": "茶陵县",
            "code": "0733"
          },
          {
            "name": "炎陵县",
            "code": "0733"
          },
          {
            "name": "醴陵市",
            "code": "0733"
          }
        ]
      },
      {
        "name": "湘潭市",
        "code": "0732",
        "sub": [
          {
            "name": "雨湖区",
            "code": "0732"
          },
          {
            "name": "岳塘区",
            "code": "0732"
          },
          {
            "name": "湘潭县",
            "code": "0732"
          },
          {
            "name": "湘乡市",
            "code": "0732"
          },
          {
            "name": "韶山市",
            "code": "0732"
          }
        ]
      },
      {
        "name": "衡阳市",
        "code": "0734",
        "sub": [
          {
            "name": "珠晖区",
            "code": "0734"
          },
          {
            "name": "雁峰区",
            "code": "0734"
          },
          {
            "name": "石鼓区",
            "code": "0734"
          },
          {
            "name": "蒸湘区",
            "code": "0734"
          },
          {
            "name": "南岳区",
            "code": "0734"
          },
          {
            "name": "衡阳县",
            "code": "0734"
          },
          {
            "name": "衡南县",
            "code": "0734"
          },
          {
            "name": "衡山县",
            "code": "0734"
          },
          {
            "name": "衡东县",
            "code": "0734"
          },
          {
            "name": "祁东县",
            "code": "0734"
          },
          {
            "name": "耒阳市",
            "code": "0734"
          },
          {
            "name": "常宁市",
            "code": "0734"
          }
        ]
      },
      {
        "name": "邵阳市",
        "code": "0739",
        "sub": [
          {
            "name": "双清区",
            "code": "0739"
          },
          {
            "name": "大祥区",
            "code": "0739"
          },
          {
            "name": "北塔区",
            "code": "0739"
          },
          {
            "name": "邵东县",
            "code": "0739"
          },
          {
            "name": "新邵县",
            "code": "0739"
          },
          {
            "name": "邵阳县",
            "code": "0739"
          },
          {
            "name": "隆回县",
            "code": "0739"
          },
          {
            "name": "洞口县",
            "code": "0739"
          },
          {
            "name": "绥宁县",
            "code": "0739"
          },
          {
            "name": "新宁县",
            "code": "0739"
          },
          {
            "name": "城步苗族自治县",
            "code": "0739"
          },
          {
            "name": "武冈市",
            "code": "0739"
          }
        ]
      },
      {
        "name": "岳阳市",
        "code": "0730",
        "sub": [
          {
            "name": "岳阳楼区",
            "code": "0730"
          },
          {
            "name": "云溪区",
            "code": "0730"
          },
          {
            "name": "君山区",
            "code": "0730"
          },
          {
            "name": "岳阳县",
            "code": "0730"
          },
          {
            "name": "华容县",
            "code": "0730"
          },
          {
            "name": "湘阴县",
            "code": "0730"
          },
          {
            "name": "平江县",
            "code": "0730"
          },
          {
            "name": "汨罗市",
            "code": "0730"
          },
          {
            "name": "临湘市",
            "code": "0730"
          }
        ]
      },
      {
        "name": "常德市",
        "code": "0736",
        "sub": [
          {
            "name": "武陵区",
            "code": "0736"
          },
          {
            "name": "鼎城区",
            "code": "0736"
          },
          {
            "name": "安乡县",
            "code": "0736"
          },
          {
            "name": "汉寿县",
            "code": "0736"
          },
          {
            "name": "澧县",
            "code": "0736"
          },
          {
            "name": "临澧县",
            "code": "0736"
          },
          {
            "name": "桃源县",
            "code": "0736"
          },
          {
            "name": "石门县",
            "code": "0736"
          },
          {
            "name": "津市市",
            "code": "0736"
          }
        ]
      },
      {
        "name": "张家界市",
        "code": "0744",
        "sub": [
          {
            "name": "永定区",
            "code": "0744"
          },
          {
            "name": "武陵源区",
            "code": "0744"
          },
          {
            "name": "慈利县",
            "code": "0744"
          },
          {
            "name": "桑植县",
            "code": "0744"
          }
        ]
      },
      {
        "name": "益阳市",
        "code": "0737",
        "sub": [
          {
            "name": "资阳区",
            "code": "0737"
          },
          {
            "name": "赫山区",
            "code": "0737"
          },
          {
            "name": "南县",
            "code": "0737"
          },
          {
            "name": "桃江县",
            "code": "0737"
          },
          {
            "name": "安化县",
            "code": "0737"
          },
          {
            "name": "沅江市",
            "code": "0737"
          }
        ]
      },
      {
        "name": "郴州市",
        "code": "0735",
        "sub": [
          {
            "name": "北湖区",
            "code": "0735"
          },
          {
            "name": "苏仙区",
            "code": "0735"
          },
          {
            "name": "桂阳县",
            "code": "0735"
          },
          {
            "name": "宜章县",
            "code": "0735"
          },
          {
            "name": "永兴县",
            "code": "0735"
          },
          {
            "name": "嘉禾县",
            "code": "0735"
          },
          {
            "name": "临武县",
            "code": "0735"
          },
          {
            "name": "汝城县",
            "code": "0735"
          },
          {
            "name": "桂东县",
            "code": "0735"
          },
          {
            "name": "安仁县",
            "code": "0735"
          },
          {
            "name": "资兴市",
            "code": "0735"
          }
        ]
      },
      {
        "name": "永州市",
        "code": "0746",
        "sub": [
          {
            "name": "零陵区",
            "code": "0746"
          },
          {
            "name": "冷水滩区",
            "code": "0746"
          },
          {
            "name": "祁阳县",
            "code": "0746"
          },
          {
            "name": "东安县",
            "code": "0746"
          },
          {
            "name": "双牌县",
            "code": "0746"
          },
          {
            "name": "道县",
            "code": "0746"
          },
          {
            "name": "江永县",
            "code": "0746"
          },
          {
            "name": "宁远县",
            "code": "0746"
          },
          {
            "name": "蓝山县",
            "code": "0746"
          },
          {
            "name": "新田县",
            "code": "0746"
          },
          {
            "name": "江华瑶族自治县",
            "code": "0746"
          }
        ]
      },
      {
        "name": "怀化市",
        "code": "0745",
        "sub": [
          {
            "name": "鹤城区",
            "code": "0745"
          },
          {
            "name": "中方县",
            "code": "0745"
          },
          {
            "name": "沅陵县",
            "code": "0745"
          },
          {
            "name": "辰溪县",
            "code": "0745"
          },
          {
            "name": "溆浦县",
            "code": "0745"
          },
          {
            "name": "会同县",
            "code": "0745"
          },
          {
            "name": "麻阳苗族自治县",
            "code": "0745"
          },
          {
            "name": "新晃侗族自治县",
            "code": "0745"
          },
          {
            "name": "芷江侗族自治县",
            "code": "0745"
          },
          {
            "name": "靖州苗族侗族自治县",
            "code": "0745"
          },
          {
            "name": "通道侗族自治县",
            "code": "0745"
          },
          {
            "name": "洪江市",
            "code": "0745"
          }
        ]
      },
      {
        "name": "娄底市",
        "code": "0738",
        "sub": [
          {
            "name": "娄星区",
            "code": "0738"
          },
          {
            "name": "双峰县",
            "code": "0738"
          },
          {
            "name": "新化县",
            "code": "0738"
          },
          {
            "name": "冷水江市",
            "code": "0738"
          },
          {
            "name": "涟源市",
            "code": "0738"
          }
        ]
      },
      {
        "name": "湘西土家族苗族自治州",
        "code": "0743",
        "sub": [
          {
            "name": "吉首市",
            "code": "0743"
          },
          {
            "name": "泸溪县",
            "code": "0743"
          },
          {
            "name": "凤凰县",
            "code": "0743"
          },
          {
            "name": "花垣县",
            "code": "0743"
          },
          {
            "name": "保靖县",
            "code": "0743"
          },
          {
            "name": "古丈县",
            "code": "0743"
          },
          {
            "name": "永顺县",
            "code": "0743"
          },
          {
            "name": "龙山县",
            "code": "0743"
          }
        ]
      }
    ]
  },
  {
    "name": "广东省",
    "code": "44",
    "sub": [
      {
        "name": "广州市",
        "code": "020",
        "sub": [
          {
            "name": "荔湾区",
            "code": "020"
          },
          {
            "name": "越秀区",
            "code": "020"
          },
          {
            "name": "海珠区",
            "code": "020"
          },
          {
            "name": "天河区",
            "code": "020"
          },
          {
            "name": "白云区",
            "code": "020"
          },
          {
            "name": "黄埔区",
            "code": "020"
          },
          {
            "name": "番禺区",
            "code": "020"
          },
          {
            "name": "花都区",
            "code": "020"
          },
          {
            "name": "南沙区",
            "code": "020"
          },
          {
            "name": "从化区",
            "code": "020"
          },
          {
            "name": "增城区",
            "code": "020"
          }
        ]
      },
      {
        "name": "韶关市",
        "code": "0751",
        "sub": [
          {
            "name": "武江区",
            "code": "0751"
          },
          {
            "name": "浈江区",
            "code": "0751"
          },
          {
            "name": "曲江区",
            "code": "0751"
          },
          {
            "name": "始兴县",
            "code": "0751"
          },
          {
            "name": "仁化县",
            "code": "0751"
          },
          {
            "name": "翁源县",
            "code": "0751"
          },
          {
            "name": "乳源瑶族自治县",
            "code": "0751"
          },
          {
            "name": "新丰县",
            "code": "0751"
          },
          {
            "name": "乐昌市",
            "code": "0751"
          },
          {
            "name": "南雄市",
            "code": "0751"
          }
        ]
      },
      {
        "name": "深圳市",
        "code": "0755",
        "sub": [
          {
            "name": "罗湖区",
            "code": "0755"
          },
          {
            "name": "福田区",
            "code": "0755"
          },
          {
            "name": "南山区",
            "code": "0755"
          },
          {
            "name": "宝安区",
            "code": "0755"
          },
          {
            "name": "龙岗区",
            "code": "0755"
          },
          {
            "name": "盐田区",
            "code": "0755"
          },
          {
            "name": "龙华区",
            "code": "0755"
          },
          {
            "name": "坪山区",
            "code": "0755"
          }
        ]
      },
      {
        "name": "珠海市",
        "code": "0756",
        "sub": [
          {
            "name": "香洲区",
            "code": "0756"
          },
          {
            "name": "斗门区",
            "code": "0756"
          },
          {
            "name": "金湾区",
            "code": "0756"
          }
        ]
      },
      {
        "name": "汕头市",
        "code": "0754",
        "sub": [
          {
            "name": "龙湖区",
            "code": "0754"
          },
          {
            "name": "金平区",
            "code": "0754"
          },
          {
            "name": "濠江区",
            "code": "0754"
          },
          {
            "name": "潮阳区",
            "code": "0754"
          },
          {
            "name": "潮南区",
            "code": "0754"
          },
          {
            "name": "澄海区",
            "code": "0754"
          },
          {
            "name": "南澳县",
            "code": "0754"
          }
        ]
      },
      {
        "name": "佛山市",
        "code": "0757",
        "sub": [
          {
            "name": "禅城区",
            "code": "0757"
          },
          {
            "name": "南海区",
            "code": "0757"
          },
          {
            "name": "顺德区",
            "code": "0757"
          },
          {
            "name": "三水区",
            "code": "0757"
          },
          {
            "name": "高明区",
            "code": "0757"
          }
        ]
      },
      {
        "name": "江门市",
        "code": "0750",
        "sub": [
          {
            "name": "蓬江区",
            "code": "0750"
          },
          {
            "name": "江海区",
            "code": "0750"
          },
          {
            "name": "新会区",
            "code": "0750"
          },
          {
            "name": "台山市",
            "code": "0750"
          },
          {
            "name": "开平市",
            "code": "0750"
          },
          {
            "name": "鹤山市",
            "code": "0750"
          },
          {
            "name": "恩平市",
            "code": "0750"
          }
        ]
      },
      {
        "name": "湛江市",
        "code": "0759",
        "sub": [
          {
            "name": "赤坎区",
            "code": "0759"
          },
          {
            "name": "霞山区",
            "code": "0759"
          },
          {
            "name": "坡头区",
            "code": "0759"
          },
          {
            "name": "麻章区",
            "code": "0759"
          },
          {
            "name": "遂溪县",
            "code": "0759"
          },
          {
            "name": "徐闻县",
            "code": "0759"
          },
          {
            "name": "廉江市",
            "code": "0759"
          },
          {
            "name": "雷州市",
            "code": "0759"
          },
          {
            "name": "吴川市",
            "code": "0759"
          }
        ]
      },
      {
        "name": "茂名市",
        "code": "0668",
        "sub": [
          {
            "name": "茂南区",
            "code": "0668"
          },
          {
            "name": "电白区",
            "code": "0668"
          },
          {
            "name": "高州市",
            "code": "0668"
          },
          {
            "name": "化州市",
            "code": "0668"
          },
          {
            "name": "信宜市",
            "code": "0668"
          }
        ]
      },
      {
        "name": "肇庆市",
        "code": "0758",
        "sub": [
          {
            "name": "端州区",
            "code": "0758"
          },
          {
            "name": "鼎湖区",
            "code": "0758"
          },
          {
            "name": "高要区",
            "code": "0758"
          },
          {
            "name": "广宁县",
            "code": "0758"
          },
          {
            "name": "怀集县",
            "code": "0758"
          },
          {
            "name": "封开县",
            "code": "0758"
          },
          {
            "name": "德庆县",
            "code": "0758"
          },
          {
            "name": "四会市",
            "code": "0758"
          }
        ]
      },
      {
        "name": "惠州市",
        "code": "0752",
        "sub": [
          {
            "name": "惠城区",
            "code": "0752"
          },
          {
            "name": "惠阳区",
            "code": "0752"
          },
          {
            "name": "博罗县",
            "code": "0752"
          },
          {
            "name": "惠东县",
            "code": "0752"
          },
          {
            "name": "龙门县",
            "code": "0752"
          }
        ]
      },
      {
        "name": "梅州市",
        "code": "0753",
        "sub": [
          {
            "name": "梅江区",
            "code": "0753"
          },
          {
            "name": "梅县区",
            "code": "0753"
          },
          {
            "name": "大埔县",
            "code": "0753"
          },
          {
            "name": "丰顺县",
            "code": "0753"
          },
          {
            "name": "五华县",
            "code": "0753"
          },
          {
            "name": "平远县",
            "code": "0753"
          },
          {
            "name": "蕉岭县",
            "code": "0753"
          },
          {
            "name": "兴宁市",
            "code": "0753"
          }
        ]
      },
      {
        "name": "汕尾市",
        "code": "0660",
        "sub": [
          {
            "name": "城区",
            "code": "0660"
          },
          {
            "name": "海丰县",
            "code": "0660"
          },
          {
            "name": "陆河县",
            "code": "0660"
          },
          {
            "name": "陆丰市",
            "code": "0660"
          }
        ]
      },
      {
        "name": "河源市",
        "code": "0762",
        "sub": [
          {
            "name": "源城区",
            "code": "0762"
          },
          {
            "name": "紫金县",
            "code": "0762"
          },
          {
            "name": "龙川县",
            "code": "0762"
          },
          {
            "name": "连平县",
            "code": "0762"
          },
          {
            "name": "和平县",
            "code": "0762"
          },
          {
            "name": "东源县",
            "code": "0762"
          }
        ]
      },
      {
        "name": "阳江市",
        "code": "0662",
        "sub": [
          {
            "name": "江城区",
            "code": "0662"
          },
          {
            "name": "阳东区",
            "code": "0662"
          },
          {
            "name": "阳西县",
            "code": "0662"
          },
          {
            "name": "阳春市",
            "code": "0662"
          }
        ]
      },
      {
        "name": "清远市",
        "code": "0763",
        "sub": [
          {
            "name": "清城区",
            "code": "0763"
          },
          {
            "name": "清新区",
            "code": "0763"
          },
          {
            "name": "佛冈县",
            "code": "0763"
          },
          {
            "name": "阳山县",
            "code": "0763"
          },
          {
            "name": "连山壮族瑶族自治县",
            "code": "0763"
          },
          {
            "name": "连南瑶族自治县",
            "code": "0763"
          },
          {
            "name": "英德市",
            "code": "0763"
          },
          {
            "name": "连州市",
            "code": "0763"
          }
        ]
      },
      {
        "name": "东莞市",
        "code": "0769",
        "sub": []
      },
      {
        "name": "中山市",
        "code": "0760",
        "sub": []
      },
      {
        "name": "潮州市",
        "code": "0768",
        "sub": [
          {
            "name": "湘桥区",
            "code": "0768"
          },
          {
            "name": "潮安区",
            "code": "0768"
          },
          {
            "name": "饶平县",
            "code": "0768"
          }
        ]
      },
      {
        "name": "揭阳市",
        "code": "0663",
        "sub": [
          {
            "name": "榕城区",
            "code": "0663"
          },
          {
            "name": "揭东区",
            "code": "0663"
          },
          {
            "name": "揭西县",
            "code": "0663"
          },
          {
            "name": "惠来县",
            "code": "0663"
          },
          {
            "name": "普宁市",
            "code": "0663"
          }
        ]
      },
      {
        "name": "云浮市",
        "code": "0766",
        "sub": [
          {
            "name": "云城区",
            "code": "0766"
          },
          {
            "name": "云安区",
            "code": "0766"
          },
          {
            "name": "新兴县",
            "code": "0766"
          },
          {
            "name": "郁南县",
            "code": "0766"
          },
          {
            "name": "罗定市",
            "code": "0766"
          }
        ]
      },
      {
        "name": "东沙群岛",
        "code": "[]",
        "sub": []
      }
    ]
  },
  {
    "name": "广西壮族自治区",
    "code": "45",
    "sub": [
      {
        "name": "南宁市",
        "code": "0771",
        "sub": [
          {
            "name": "兴宁区",
            "code": "0771"
          },
          {
            "name": "青秀区",
            "code": "0771"
          },
          {
            "name": "江南区",
            "code": "0771"
          },
          {
            "name": "西乡塘区",
            "code": "0771"
          },
          {
            "name": "良庆区",
            "code": "0771"
          },
          {
            "name": "邕宁区",
            "code": "0771"
          },
          {
            "name": "武鸣区",
            "code": "0771"
          },
          {
            "name": "隆安县",
            "code": "0771"
          },
          {
            "name": "马山县",
            "code": "0771"
          },
          {
            "name": "上林县",
            "code": "0771"
          },
          {
            "name": "宾阳县",
            "code": "0771"
          },
          {
            "name": "横县",
            "code": "0771"
          }
        ]
      },
      {
        "name": "柳州市",
        "code": "0772",
        "sub": [
          {
            "name": "城中区",
            "code": "0772"
          },
          {
            "name": "鱼峰区",
            "code": "0772"
          },
          {
            "name": "柳南区",
            "code": "0772"
          },
          {
            "name": "柳北区",
            "code": "0772"
          },
          {
            "name": "柳江区",
            "code": "0772"
          },
          {
            "name": "柳城县",
            "code": "0772"
          },
          {
            "name": "鹿寨县",
            "code": "0772"
          },
          {
            "name": "融安县",
            "code": "0772"
          },
          {
            "name": "融水苗族自治县",
            "code": "0772"
          },
          {
            "name": "三江侗族自治县",
            "code": "0772"
          }
        ]
      },
      {
        "name": "桂林市",
        "code": "0773",
        "sub": [
          {
            "name": "秀峰区",
            "code": "0773"
          },
          {
            "name": "叠彩区",
            "code": "0773"
          },
          {
            "name": "象山区",
            "code": "0773"
          },
          {
            "name": "七星区",
            "code": "0773"
          },
          {
            "name": "雁山区",
            "code": "0773"
          },
          {
            "name": "临桂区",
            "code": "0773"
          },
          {
            "name": "阳朔县",
            "code": "0773"
          },
          {
            "name": "灵川县",
            "code": "0773"
          },
          {
            "name": "全州县",
            "code": "0773"
          },
          {
            "name": "兴安县",
            "code": "0773"
          },
          {
            "name": "永福县",
            "code": "0773"
          },
          {
            "name": "灌阳县",
            "code": "0773"
          },
          {
            "name": "龙胜各族自治县",
            "code": "0773"
          },
          {
            "name": "资源县",
            "code": "0773"
          },
          {
            "name": "平乐县",
            "code": "0773"
          },
          {
            "name": "荔浦县",
            "code": "0773"
          },
          {
            "name": "恭城瑶族自治县",
            "code": "0773"
          }
        ]
      },
      {
        "name": "梧州市",
        "code": "0774",
        "sub": [
          {
            "name": "万秀区",
            "code": "0774"
          },
          {
            "name": "长洲区",
            "code": "0774"
          },
          {
            "name": "龙圩区",
            "code": "0774"
          },
          {
            "name": "苍梧县",
            "code": "0774"
          },
          {
            "name": "藤县",
            "code": "0774"
          },
          {
            "name": "蒙山县",
            "code": "0774"
          },
          {
            "name": "岑溪市",
            "code": "0774"
          }
        ]
      },
      {
        "name": "北海市",
        "code": "0779",
        "sub": [
          {
            "name": "海城区",
            "code": "0779"
          },
          {
            "name": "银海区",
            "code": "0779"
          },
          {
            "name": "铁山港区",
            "code": "0779"
          },
          {
            "name": "合浦县",
            "code": "0779"
          }
        ]
      },
      {
        "name": "防城港市",
        "code": "0770",
        "sub": [
          {
            "name": "港口区",
            "code": "0770"
          },
          {
            "name": "防城区",
            "code": "0770"
          },
          {
            "name": "上思县",
            "code": "0770"
          },
          {
            "name": "东兴市",
            "code": "0770"
          }
        ]
      },
      {
        "name": "钦州市",
        "code": "0777",
        "sub": [
          {
            "name": "钦南区",
            "code": "0777"
          },
          {
            "name": "钦北区",
            "code": "0777"
          },
          {
            "name": "灵山县",
            "code": "0777"
          },
          {
            "name": "浦北县",
            "code": "0777"
          }
        ]
      },
      {
        "name": "贵港市",
        "code": "1755",
        "sub": [
          {
            "name": "港北区",
            "code": "1755"
          },
          {
            "name": "港南区",
            "code": "1755"
          },
          {
            "name": "覃塘区",
            "code": "1755"
          },
          {
            "name": "平南县",
            "code": "1755"
          },
          {
            "name": "桂平市",
            "code": "1755"
          }
        ]
      },
      {
        "name": "玉林市",
        "code": "0775",
        "sub": [
          {
            "name": "玉州区",
            "code": "0775"
          },
          {
            "name": "福绵区",
            "code": "0775"
          },
          {
            "name": "容县",
            "code": "0775"
          },
          {
            "name": "陆川县",
            "code": "0775"
          },
          {
            "name": "博白县",
            "code": "0775"
          },
          {
            "name": "兴业县",
            "code": "0775"
          },
          {
            "name": "北流市",
            "code": "0775"
          }
        ]
      },
      {
        "name": "百色市",
        "code": "0776",
        "sub": [
          {
            "name": "右江区",
            "code": "0776"
          },
          {
            "name": "田阳县",
            "code": "0776"
          },
          {
            "name": "田东县",
            "code": "0776"
          },
          {
            "name": "平果县",
            "code": "0776"
          },
          {
            "name": "德保县",
            "code": "0776"
          },
          {
            "name": "那坡县",
            "code": "0776"
          },
          {
            "name": "凌云县",
            "code": "0776"
          },
          {
            "name": "乐业县",
            "code": "0776"
          },
          {
            "name": "田林县",
            "code": "0776"
          },
          {
            "name": "西林县",
            "code": "0776"
          },
          {
            "name": "隆林各族自治县",
            "code": "0776"
          },
          {
            "name": "靖西市",
            "code": "0776"
          }
        ]
      },
      {
        "name": "贺州市",
        "code": "1774",
        "sub": [
          {
            "name": "八步区",
            "code": "1774"
          },
          {
            "name": "平桂区",
            "code": "1774"
          },
          {
            "name": "昭平县",
            "code": "1774"
          },
          {
            "name": "钟山县",
            "code": "1774"
          },
          {
            "name": "富川瑶族自治县",
            "code": "1774"
          }
        ]
      },
      {
        "name": "河池市",
        "code": "0778",
        "sub": [
          {
            "name": "金城江区",
            "code": "0778"
          },
          {
            "name": "南丹县",
            "code": "0778"
          },
          {
            "name": "天峨县",
            "code": "0778"
          },
          {
            "name": "凤山县",
            "code": "0778"
          },
          {
            "name": "东兰县",
            "code": "0778"
          },
          {
            "name": "罗城仫佬族自治县",
            "code": "0778"
          },
          {
            "name": "环江毛南族自治县",
            "code": "0778"
          },
          {
            "name": "巴马瑶族自治县",
            "code": "0778"
          },
          {
            "name": "都安瑶族自治县",
            "code": "0778"
          },
          {
            "name": "大化瑶族自治县",
            "code": "0778"
          },
          {
            "name": "宜州区",
            "code": "0778"
          }
        ]
      },
      {
        "name": "来宾市",
        "code": "1772",
        "sub": [
          {
            "name": "兴宾区",
            "code": "1772"
          },
          {
            "name": "忻城县",
            "code": "1772"
          },
          {
            "name": "象州县",
            "code": "1772"
          },
          {
            "name": "武宣县",
            "code": "1772"
          },
          {
            "name": "金秀瑶族自治县",
            "code": "1772"
          },
          {
            "name": "合山市",
            "code": "1772"
          }
        ]
      },
      {
        "name": "崇左市",
        "code": "1771",
        "sub": [
          {
            "name": "江州区",
            "code": "1771"
          },
          {
            "name": "扶绥县",
            "code": "1771"
          },
          {
            "name": "宁明县",
            "code": "1771"
          },
          {
            "name": "龙州县",
            "code": "1771"
          },
          {
            "name": "大新县",
            "code": "1771"
          },
          {
            "name": "天等县",
            "code": "1771"
          },
          {
            "name": "凭祥市",
            "code": "1771"
          }
        ]
      }
    ]
  },
  {
    "name": "海南省",
    "code": "46",
    "sub": [
      {
        "name": "白沙黎族自治县",
        "code": "0802",
        "sub": []
      },
      {
        "name": "保亭黎族苗族自治县",
        "code": "0801",
        "sub": []
      },
      {
        "name": "昌江黎族自治县",
        "code": "0803",
        "sub": []
      },
      {
        "name": "澄迈县",
        "code": "0804",
        "sub": []
      },
      {
        "name": "海口市",
        "code": "0898",
        "sub": [
          {
            "name": "秀英区",
            "code": "0898"
          },
          {
            "name": "龙华区",
            "code": "0898"
          },
          {
            "name": "琼山区",
            "code": "0898"
          },
          {
            "name": "美兰区",
            "code": "0898"
          }
        ]
      },
      {
        "name": "三亚市",
        "code": "0899",
        "sub": [
          {
            "name": "海棠区",
            "code": "0899"
          },
          {
            "name": "吉阳区",
            "code": "0899"
          },
          {
            "name": "天涯区",
            "code": "0899"
          },
          {
            "name": "崖州区",
            "code": "0899"
          }
        ]
      },
      {
        "name": "三沙市",
        "code": "2898",
        "sub": [
          {
            "name": "西沙群岛",
            "code": "1895"
          },
          {
            "name": "南沙群岛",
            "code": "1891"
          },
          {
            "name": "中沙群岛的岛礁及其海域",
            "code": "2801"
          }
        ]
      },
      {
        "name": "儋州市",
        "code": "0805",
        "sub": []
      },
      {
        "name": "定安县",
        "code": "0806",
        "sub": []
      },
      {
        "name": "东方市",
        "code": "0807",
        "sub": []
      },
      {
        "name": "乐东黎族自治县",
        "code": "2802",
        "sub": []
      },
      {
        "name": "临高县",
        "code": "1896",
        "sub": []
      },
      {
        "name": "陵水黎族自治县",
        "code": "0809",
        "sub": []
      },
      {
        "name": "琼海市",
        "code": "1894",
        "sub": []
      },
      {
        "name": "琼中黎族苗族自治县",
        "code": "1899",
        "sub": []
      },
      {
        "name": "屯昌县",
        "code": "1892",
        "sub": []
      },
      {
        "name": "万宁市",
        "code": "1898",
        "sub": []
      },
      {
        "name": "文昌市",
        "code": "1893",
        "sub": []
      },
      {
        "name": "五指山市",
        "code": "1897",
        "sub": []
      }
    ]
  },
  {
    "name": "重庆市",
    "code": "50",
    "sub": [
      {
        "name": "重庆城区",
        "code": "023",
        "sub": [
          {
            "name": "万州区",
            "code": "023"
          },
          {
            "name": "涪陵区",
            "code": "023"
          },
          {
            "name": "渝中区",
            "code": "023"
          },
          {
            "name": "大渡口区",
            "code": "023"
          },
          {
            "name": "江北区",
            "code": "023"
          },
          {
            "name": "沙坪坝区",
            "code": "023"
          },
          {
            "name": "九龙坡区",
            "code": "023"
          },
          {
            "name": "南岸区",
            "code": "023"
          },
          {
            "name": "北碚区",
            "code": "023"
          },
          {
            "name": "綦江区",
            "code": "023"
          },
          {
            "name": "大足区",
            "code": "023"
          },
          {
            "name": "渝北区",
            "code": "023"
          },
          {
            "name": "巴南区",
            "code": "023"
          },
          {
            "name": "黔江区",
            "code": "023"
          },
          {
            "name": "长寿区",
            "code": "023"
          },
          {
            "name": "江津区",
            "code": "023"
          },
          {
            "name": "合川区",
            "code": "023"
          },
          {
            "name": "永川区",
            "code": "023"
          },
          {
            "name": "南川区",
            "code": "023"
          },
          {
            "name": "璧山区",
            "code": "023"
          },
          {
            "name": "铜梁区",
            "code": "023"
          },
          {
            "name": "潼南区",
            "code": "023"
          },
          {
            "name": "荣昌区",
            "code": "023"
          },
          {
            "name": "开州区",
            "code": "023"
          }
        ]
      },
      {
        "name": "重庆郊县",
        "code": "023",
        "sub": [
          {
            "name": "梁平区",
            "code": "023"
          },
          {
            "name": "城口县",
            "code": "023"
          },
          {
            "name": "丰都县",
            "code": "023"
          },
          {
            "name": "垫江县",
            "code": "023"
          },
          {
            "name": "武隆区",
            "code": "023"
          },
          {
            "name": "忠县",
            "code": "023"
          },
          {
            "name": "云阳县",
            "code": "023"
          },
          {
            "name": "奉节县",
            "code": "023"
          },
          {
            "name": "巫山县",
            "code": "023"
          },
          {
            "name": "巫溪县",
            "code": "023"
          },
          {
            "name": "石柱土家族自治县",
            "code": "023"
          },
          {
            "name": "秀山土家族苗族自治县",
            "code": "023"
          },
          {
            "name": "酉阳土家族苗族自治县",
            "code": "023"
          },
          {
            "name": "彭水苗族土家族自治县",
            "code": "023"
          }
        ]
      }
    ]
  },
  {
    "name": "四川省",
    "code": "51",
    "sub": [
      {
        "name": "成都市",
        "code": "028",
        "sub": [
          {
            "name": "锦江区",
            "code": "028"
          },
          {
            "name": "青羊区",
            "code": "028"
          },
          {
            "name": "金牛区",
            "code": "028"
          },
          {
            "name": "武侯区",
            "code": "028"
          },
          {
            "name": "成华区",
            "code": "028"
          },
          {
            "name": "龙泉驿区",
            "code": "028"
          },
          {
            "name": "青白江区",
            "code": "028"
          },
          {
            "name": "新都区",
            "code": "028"
          },
          {
            "name": "温江区",
            "code": "028"
          },
          {
            "name": "双流区",
            "code": "028"
          },
          {
            "name": "金堂县",
            "code": "028"
          },
          {
            "name": "郫都区",
            "code": "028"
          },
          {
            "name": "大邑县",
            "code": "028"
          },
          {
            "name": "蒲江县",
            "code": "028"
          },
          {
            "name": "新津县",
            "code": "028"
          },
          {
            "name": "简阳市",
            "code": "028"
          },
          {
            "name": "都江堰市",
            "code": "028"
          },
          {
            "name": "彭州市",
            "code": "028"
          },
          {
            "name": "邛崃市",
            "code": "028"
          },
          {
            "name": "崇州市",
            "code": "028"
          }
        ]
      },
      {
        "name": "自贡市",
        "code": "0813",
        "sub": [
          {
            "name": "自流井区",
            "code": "0813"
          },
          {
            "name": "贡井区",
            "code": "0813"
          },
          {
            "name": "大安区",
            "code": "0813"
          },
          {
            "name": "沿滩区",
            "code": "0813"
          },
          {
            "name": "荣县",
            "code": "0813"
          },
          {
            "name": "富顺县",
            "code": "0813"
          }
        ]
      },
      {
        "name": "攀枝花市",
        "code": "0812",
        "sub": [
          {
            "name": "东区",
            "code": "0812"
          },
          {
            "name": "西区",
            "code": "0812"
          },
          {
            "name": "仁和区",
            "code": "0812"
          },
          {
            "name": "米易县",
            "code": "0812"
          },
          {
            "name": "盐边县",
            "code": "0812"
          }
        ]
      },
      {
        "name": "泸州市",
        "code": "0830",
        "sub": [
          {
            "name": "江阳区",
            "code": "0830"
          },
          {
            "name": "纳溪区",
            "code": "0830"
          },
          {
            "name": "龙马潭区",
            "code": "0830"
          },
          {
            "name": "泸县",
            "code": "0830"
          },
          {
            "name": "合江县",
            "code": "0830"
          },
          {
            "name": "叙永县",
            "code": "0830"
          },
          {
            "name": "古蔺县",
            "code": "0830"
          }
        ]
      },
      {
        "name": "德阳市",
        "code": "0838",
        "sub": [
          {
            "name": "旌阳区",
            "code": "0838"
          },
          {
            "name": "中江县",
            "code": "0838"
          },
          {
            "name": "罗江县",
            "code": "0838"
          },
          {
            "name": "广汉市",
            "code": "0838"
          },
          {
            "name": "什邡市",
            "code": "0838"
          },
          {
            "name": "绵竹市",
            "code": "0838"
          }
        ]
      },
      {
        "name": "绵阳市",
        "code": "0816",
        "sub": [
          {
            "name": "涪城区",
            "code": "0816"
          },
          {
            "name": "游仙区",
            "code": "0816"
          },
          {
            "name": "安州区",
            "code": "0816"
          },
          {
            "name": "三台县",
            "code": "0816"
          },
          {
            "name": "盐亭县",
            "code": "0816"
          },
          {
            "name": "梓潼县",
            "code": "0816"
          },
          {
            "name": "北川羌族自治县",
            "code": "0816"
          },
          {
            "name": "平武县",
            "code": "0816"
          },
          {
            "name": "江油市",
            "code": "0816"
          }
        ]
      },
      {
        "name": "广元市",
        "code": "0839",
        "sub": [
          {
            "name": "利州区",
            "code": "0839"
          },
          {
            "name": "昭化区",
            "code": "0839"
          },
          {
            "name": "朝天区",
            "code": "0839"
          },
          {
            "name": "旺苍县",
            "code": "0839"
          },
          {
            "name": "青川县",
            "code": "0839"
          },
          {
            "name": "剑阁县",
            "code": "0839"
          },
          {
            "name": "苍溪县",
            "code": "0839"
          }
        ]
      },
      {
        "name": "遂宁市",
        "code": "0825",
        "sub": [
          {
            "name": "船山区",
            "code": "0825"
          },
          {
            "name": "安居区",
            "code": "0825"
          },
          {
            "name": "蓬溪县",
            "code": "0825"
          },
          {
            "name": "射洪县",
            "code": "0825"
          },
          {
            "name": "大英县",
            "code": "0825"
          }
        ]
      },
      {
        "name": "内江市",
        "code": "1832",
        "sub": [
          {
            "name": "市中区",
            "code": "1832"
          },
          {
            "name": "东兴区",
            "code": "1832"
          },
          {
            "name": "威远县",
            "code": "1832"
          },
          {
            "name": "资中县",
            "code": "1832"
          },
          {
            "name": "隆昌市",
            "code": "1832"
          }
        ]
      },
      {
        "name": "乐山市",
        "code": "0833",
        "sub": [
          {
            "name": "市中区",
            "code": "0833"
          },
          {
            "name": "沙湾区",
            "code": "0833"
          },
          {
            "name": "五通桥区",
            "code": "0833"
          },
          {
            "name": "金口河区",
            "code": "0833"
          },
          {
            "name": "犍为县",
            "code": "0833"
          },
          {
            "name": "井研县",
            "code": "0833"
          },
          {
            "name": "夹江县",
            "code": "0833"
          },
          {
            "name": "沐川县",
            "code": "0833"
          },
          {
            "name": "峨边彝族自治县",
            "code": "0833"
          },
          {
            "name": "马边彝族自治县",
            "code": "0833"
          },
          {
            "name": "峨眉山市",
            "code": "0833"
          }
        ]
      },
      {
        "name": "南充市",
        "code": "0817",
        "sub": [
          {
            "name": "顺庆区",
            "code": "0817"
          },
          {
            "name": "高坪区",
            "code": "0817"
          },
          {
            "name": "嘉陵区",
            "code": "0817"
          },
          {
            "name": "南部县",
            "code": "0817"
          },
          {
            "name": "营山县",
            "code": "0817"
          },
          {
            "name": "蓬安县",
            "code": "0817"
          },
          {
            "name": "仪陇县",
            "code": "0817"
          },
          {
            "name": "西充县",
            "code": "0817"
          },
          {
            "name": "阆中市",
            "code": "0817"
          }
        ]
      },
      {
        "name": "眉山市",
        "code": "1833",
        "sub": [
          {
            "name": "东坡区",
            "code": "1833"
          },
          {
            "name": "彭山区",
            "code": "1833"
          },
          {
            "name": "仁寿县",
            "code": "1833"
          },
          {
            "name": "洪雅县",
            "code": "1833"
          },
          {
            "name": "丹棱县",
            "code": "1833"
          },
          {
            "name": "青神县",
            "code": "1833"
          }
        ]
      },
      {
        "name": "宜宾市",
        "code": "0831",
        "sub": [
          {
            "name": "翠屏区",
            "code": "0831"
          },
          {
            "name": "南溪区",
            "code": "0831"
          },
          {
            "name": "宜宾县",
            "code": "0831"
          },
          {
            "name": "江安县",
            "code": "0831"
          },
          {
            "name": "长宁县",
            "code": "0831"
          },
          {
            "name": "高县",
            "code": "0831"
          },
          {
            "name": "珙县",
            "code": "0831"
          },
          {
            "name": "筠连县",
            "code": "0831"
          },
          {
            "name": "兴文县",
            "code": "0831"
          },
          {
            "name": "屏山县",
            "code": "0831"
          }
        ]
      },
      {
        "name": "广安市",
        "code": "0826",
        "sub": [
          {
            "name": "广安区",
            "code": "0826"
          },
          {
            "name": "前锋区",
            "code": "0826"
          },
          {
            "name": "岳池县",
            "code": "0826"
          },
          {
            "name": "武胜县",
            "code": "0826"
          },
          {
            "name": "邻水县",
            "code": "0826"
          },
          {
            "name": "华蓥市",
            "code": "0826"
          }
        ]
      },
      {
        "name": "达州市",
        "code": "0818",
        "sub": [
          {
            "name": "通川区",
            "code": "0818"
          },
          {
            "name": "达川区",
            "code": "0818"
          },
          {
            "name": "宣汉县",
            "code": "0818"
          },
          {
            "name": "开江县",
            "code": "0818"
          },
          {
            "name": "大竹县",
            "code": "0818"
          },
          {
            "name": "渠县",
            "code": "0818"
          },
          {
            "name": "万源市",
            "code": "0818"
          }
        ]
      },
      {
        "name": "雅安市",
        "code": "0835",
        "sub": [
          {
            "name": "雨城区",
            "code": "0835"
          },
          {
            "name": "名山区",
            "code": "0835"
          },
          {
            "name": "荥经县",
            "code": "0835"
          },
          {
            "name": "汉源县",
            "code": "0835"
          },
          {
            "name": "石棉县",
            "code": "0835"
          },
          {
            "name": "天全县",
            "code": "0835"
          },
          {
            "name": "芦山县",
            "code": "0835"
          },
          {
            "name": "宝兴县",
            "code": "0835"
          }
        ]
      },
      {
        "name": "巴中市",
        "code": "0827",
        "sub": [
          {
            "name": "巴州区",
            "code": "0827"
          },
          {
            "name": "恩阳区",
            "code": "0827"
          },
          {
            "name": "通江县",
            "code": "0827"
          },
          {
            "name": "南江县",
            "code": "0827"
          },
          {
            "name": "平昌县",
            "code": "0827"
          }
        ]
      },
      {
        "name": "资阳市",
        "code": "0832",
        "sub": [
          {
            "name": "雁江区",
            "code": "0832"
          },
          {
            "name": "安岳县",
            "code": "0832"
          },
          {
            "name": "乐至县",
            "code": "0832"
          }
        ]
      },
      {
        "name": "阿坝藏族羌族自治州",
        "code": "0837",
        "sub": [
          {
            "name": "马尔康市",
            "code": "0837"
          },
          {
            "name": "汶川县",
            "code": "0837"
          },
          {
            "name": "理县",
            "code": "0837"
          },
          {
            "name": "茂县",
            "code": "0837"
          },
          {
            "name": "松潘县",
            "code": "0837"
          },
          {
            "name": "九寨沟县",
            "code": "0837"
          },
          {
            "name": "金川县",
            "code": "0837"
          },
          {
            "name": "小金县",
            "code": "0837"
          },
          {
            "name": "黑水县",
            "code": "0837"
          },
          {
            "name": "壤塘县",
            "code": "0837"
          },
          {
            "name": "阿坝县",
            "code": "0837"
          },
          {
            "name": "若尔盖县",
            "code": "0837"
          },
          {
            "name": "红原县",
            "code": "0837"
          }
        ]
      },
      {
        "name": "甘孜藏族自治州",
        "code": "0836",
        "sub": [
          {
            "name": "康定市",
            "code": "0836"
          },
          {
            "name": "泸定县",
            "code": "0836"
          },
          {
            "name": "丹巴县",
            "code": "0836"
          },
          {
            "name": "九龙县",
            "code": "0836"
          },
          {
            "name": "雅江县",
            "code": "0836"
          },
          {
            "name": "道孚县",
            "code": "0836"
          },
          {
            "name": "炉霍县",
            "code": "0836"
          },
          {
            "name": "甘孜县",
            "code": "0836"
          },
          {
            "name": "新龙县",
            "code": "0836"
          },
          {
            "name": "德格县",
            "code": "0836"
          },
          {
            "name": "白玉县",
            "code": "0836"
          },
          {
            "name": "石渠县",
            "code": "0836"
          },
          {
            "name": "色达县",
            "code": "0836"
          },
          {
            "name": "理塘县",
            "code": "0836"
          },
          {
            "name": "巴塘县",
            "code": "0836"
          },
          {
            "name": "乡城县",
            "code": "0836"
          },
          {
            "name": "稻城县",
            "code": "0836"
          },
          {
            "name": "得荣县",
            "code": "0836"
          }
        ]
      },
      {
        "name": "凉山彝族自治州",
        "code": "0834",
        "sub": [
          {
            "name": "西昌市",
            "code": "0834"
          },
          {
            "name": "木里藏族自治县",
            "code": "0834"
          },
          {
            "name": "盐源县",
            "code": "0834"
          },
          {
            "name": "德昌县",
            "code": "0834"
          },
          {
            "name": "会理县",
            "code": "0834"
          },
          {
            "name": "会东县",
            "code": "0834"
          },
          {
            "name": "宁南县",
            "code": "0834"
          },
          {
            "name": "普格县",
            "code": "0834"
          },
          {
            "name": "布拖县",
            "code": "0834"
          },
          {
            "name": "金阳县",
            "code": "0834"
          },
          {
            "name": "昭觉县",
            "code": "0834"
          },
          {
            "name": "喜德县",
            "code": "0834"
          },
          {
            "name": "冕宁县",
            "code": "0834"
          },
          {
            "name": "越西县",
            "code": "0834"
          },
          {
            "name": "甘洛县",
            "code": "0834"
          },
          {
            "name": "美姑县",
            "code": "0834"
          },
          {
            "name": "雷波县",
            "code": "0834"
          }
        ]
      }
    ]
  },
  {
    "name": "贵州省",
    "code": "52",
    "sub": [
      {
        "name": "贵阳市",
        "code": "0851",
        "sub": [
          {
            "name": "南明区",
            "code": "0851"
          },
          {
            "name": "云岩区",
            "code": "0851"
          },
          {
            "name": "花溪区",
            "code": "0851"
          },
          {
            "name": "乌当区",
            "code": "0851"
          },
          {
            "name": "白云区",
            "code": "0851"
          },
          {
            "name": "观山湖区",
            "code": "0851"
          },
          {
            "name": "开阳县",
            "code": "0851"
          },
          {
            "name": "息烽县",
            "code": "0851"
          },
          {
            "name": "修文县",
            "code": "0851"
          },
          {
            "name": "清镇市",
            "code": "0851"
          }
        ]
      },
      {
        "name": "六盘水市",
        "code": "0858",
        "sub": [
          {
            "name": "钟山区",
            "code": "0858"
          },
          {
            "name": "六枝特区",
            "code": "0858"
          },
          {
            "name": "水城县",
            "code": "0858"
          },
          {
            "name": "盘州市",
            "code": "0858"
          }
        ]
      },
      {
        "name": "遵义市",
        "code": "0852",
        "sub": [
          {
            "name": "红花岗区",
            "code": "0852"
          },
          {
            "name": "汇川区",
            "code": "0852"
          },
          {
            "name": "播州区",
            "code": "0852"
          },
          {
            "name": "桐梓县",
            "code": "0852"
          },
          {
            "name": "绥阳县",
            "code": "0852"
          },
          {
            "name": "正安县",
            "code": "0852"
          },
          {
            "name": "道真仡佬族苗族自治县",
            "code": "0852"
          },
          {
            "name": "务川仡佬族苗族自治县",
            "code": "0852"
          },
          {
            "name": "凤冈县",
            "code": "0852"
          },
          {
            "name": "湄潭县",
            "code": "0852"
          },
          {
            "name": "余庆县",
            "code": "0852"
          },
          {
            "name": "习水县",
            "code": "0852"
          },
          {
            "name": "赤水市",
            "code": "0852"
          },
          {
            "name": "仁怀市",
            "code": "0852"
          }
        ]
      },
      {
        "name": "安顺市",
        "code": "0853",
        "sub": [
          {
            "name": "西秀区",
            "code": "0853"
          },
          {
            "name": "平坝区",
            "code": "0853"
          },
          {
            "name": "普定县",
            "code": "0853"
          },
          {
            "name": "镇宁布依族苗族自治县",
            "code": "0853"
          },
          {
            "name": "关岭布依族苗族自治县",
            "code": "0853"
          },
          {
            "name": "紫云苗族布依族自治县",
            "code": "0853"
          }
        ]
      },
      {
        "name": "毕节市",
        "code": "0857",
        "sub": [
          {
            "name": "七星关区",
            "code": "0857"
          },
          {
            "name": "大方县",
            "code": "0857"
          },
          {
            "name": "黔西县",
            "code": "0857"
          },
          {
            "name": "金沙县",
            "code": "0857"
          },
          {
            "name": "织金县",
            "code": "0857"
          },
          {
            "name": "纳雍县",
            "code": "0857"
          },
          {
            "name": "威宁彝族回族苗族自治县",
            "code": "0857"
          },
          {
            "name": "赫章县",
            "code": "0857"
          }
        ]
      },
      {
        "name": "铜仁市",
        "code": "0856",
        "sub": [
          {
            "name": "碧江区",
            "code": "0856"
          },
          {
            "name": "万山区",
            "code": "0856"
          },
          {
            "name": "江口县",
            "code": "0856"
          },
          {
            "name": "玉屏侗族自治县",
            "code": "0856"
          },
          {
            "name": "石阡县",
            "code": "0856"
          },
          {
            "name": "思南县",
            "code": "0856"
          },
          {
            "name": "印江土家族苗族自治县",
            "code": "0856"
          },
          {
            "name": "德江县",
            "code": "0856"
          },
          {
            "name": "沿河土家族自治县",
            "code": "0856"
          },
          {
            "name": "松桃苗族自治县",
            "code": "0856"
          }
        ]
      },
      {
        "name": "黔西南布依族苗族自治州",
        "code": "0859",
        "sub": [
          {
            "name": "兴义市",
            "code": "0859"
          },
          {
            "name": "兴仁县",
            "code": "0859"
          },
          {
            "name": "普安县",
            "code": "0859"
          },
          {
            "name": "晴隆县",
            "code": "0859"
          },
          {
            "name": "贞丰县",
            "code": "0859"
          },
          {
            "name": "望谟县",
            "code": "0859"
          },
          {
            "name": "册亨县",
            "code": "0859"
          },
          {
            "name": "安龙县",
            "code": "0859"
          }
        ]
      },
      {
        "name": "黔东南苗族侗族自治州",
        "code": "0855",
        "sub": [
          {
            "name": "凯里市",
            "code": "0855"
          },
          {
            "name": "黄平县",
            "code": "0855"
          },
          {
            "name": "施秉县",
            "code": "0855"
          },
          {
            "name": "三穗县",
            "code": "0855"
          },
          {
            "name": "镇远县",
            "code": "0855"
          },
          {
            "name": "岑巩县",
            "code": "0855"
          },
          {
            "name": "天柱县",
            "code": "0855"
          },
          {
            "name": "锦屏县",
            "code": "0855"
          },
          {
            "name": "剑河县",
            "code": "0855"
          },
          {
            "name": "台江县",
            "code": "0855"
          },
          {
            "name": "黎平县",
            "code": "0855"
          },
          {
            "name": "榕江县",
            "code": "0855"
          },
          {
            "name": "从江县",
            "code": "0855"
          },
          {
            "name": "雷山县",
            "code": "0855"
          },
          {
            "name": "麻江县",
            "code": "0855"
          },
          {
            "name": "丹寨县",
            "code": "0855"
          }
        ]
      },
      {
        "name": "黔南布依族苗族自治州",
        "code": "0854",
        "sub": [
          {
            "name": "都匀市",
            "code": "0854"
          },
          {
            "name": "福泉市",
            "code": "0854"
          },
          {
            "name": "荔波县",
            "code": "0854"
          },
          {
            "name": "贵定县",
            "code": "0854"
          },
          {
            "name": "瓮安县",
            "code": "0854"
          },
          {
            "name": "独山县",
            "code": "0854"
          },
          {
            "name": "平塘县",
            "code": "0854"
          },
          {
            "name": "罗甸县",
            "code": "0854"
          },
          {
            "name": "长顺县",
            "code": "0854"
          },
          {
            "name": "龙里县",
            "code": "0854"
          },
          {
            "name": "惠水县",
            "code": "0854"
          },
          {
            "name": "三都水族自治县",
            "code": "0854"
          }
        ]
      }
    ]
  },
  {
    "name": "云南省",
    "code": "53",
    "sub": [
      {
        "name": "昆明市",
        "code": "0871",
        "sub": [
          {
            "name": "五华区",
            "code": "0871"
          },
          {
            "name": "盘龙区",
            "code": "0871"
          },
          {
            "name": "官渡区",
            "code": "0871"
          },
          {
            "name": "西山区",
            "code": "0871"
          },
          {
            "name": "东川区",
            "code": "0871"
          },
          {
            "name": "呈贡区",
            "code": "0871"
          },
          {
            "name": "晋宁区",
            "code": "0871"
          },
          {
            "name": "富民县",
            "code": "0871"
          },
          {
            "name": "宜良县",
            "code": "0871"
          },
          {
            "name": "石林彝族自治县",
            "code": "0871"
          },
          {
            "name": "嵩明县",
            "code": "0871"
          },
          {
            "name": "禄劝彝族苗族自治县",
            "code": "0871"
          },
          {
            "name": "寻甸回族彝族自治县",
            "code": "0871"
          },
          {
            "name": "安宁市",
            "code": "0871"
          }
        ]
      },
      {
        "name": "曲靖市",
        "code": "0874",
        "sub": [
          {
            "name": "麒麟区",
            "code": "0874"
          },
          {
            "name": "沾益区",
            "code": "0874"
          },
          {
            "name": "马龙县",
            "code": "0874"
          },
          {
            "name": "陆良县",
            "code": "0874"
          },
          {
            "name": "师宗县",
            "code": "0874"
          },
          {
            "name": "罗平县",
            "code": "0874"
          },
          {
            "name": "富源县",
            "code": "0874"
          },
          {
            "name": "会泽县",
            "code": "0874"
          },
          {
            "name": "宣威市",
            "code": "0874"
          }
        ]
      },
      {
        "name": "玉溪市",
        "code": "0877",
        "sub": [
          {
            "name": "红塔区",
            "code": "0877"
          },
          {
            "name": "江川区",
            "code": "0877"
          },
          {
            "name": "澄江县",
            "code": "0877"
          },
          {
            "name": "通海县",
            "code": "0877"
          },
          {
            "name": "华宁县",
            "code": "0877"
          },
          {
            "name": "易门县",
            "code": "0877"
          },
          {
            "name": "峨山彝族自治县",
            "code": "0877"
          },
          {
            "name": "新平彝族傣族自治县",
            "code": "0877"
          },
          {
            "name": "元江哈尼族彝族傣族自治县",
            "code": "0877"
          }
        ]
      },
      {
        "name": "保山市",
        "code": "0875",
        "sub": [
          {
            "name": "隆阳区",
            "code": "0875"
          },
          {
            "name": "施甸县",
            "code": "0875"
          },
          {
            "name": "龙陵县",
            "code": "0875"
          },
          {
            "name": "昌宁县",
            "code": "0875"
          },
          {
            "name": "腾冲市",
            "code": "0875"
          }
        ]
      },
      {
        "name": "昭通市",
        "code": "0870",
        "sub": [
          {
            "name": "昭阳区",
            "code": "0870"
          },
          {
            "name": "鲁甸县",
            "code": "0870"
          },
          {
            "name": "巧家县",
            "code": "0870"
          },
          {
            "name": "盐津县",
            "code": "0870"
          },
          {
            "name": "大关县",
            "code": "0870"
          },
          {
            "name": "永善县",
            "code": "0870"
          },
          {
            "name": "绥江县",
            "code": "0870"
          },
          {
            "name": "镇雄县",
            "code": "0870"
          },
          {
            "name": "彝良县",
            "code": "0870"
          },
          {
            "name": "威信县",
            "code": "0870"
          },
          {
            "name": "水富县",
            "code": "0870"
          }
        ]
      },
      {
        "name": "丽江市",
        "code": "0888",
        "sub": [
          {
            "name": "古城区",
            "code": "0888"
          },
          {
            "name": "玉龙纳西族自治县",
            "code": "0888"
          },
          {
            "name": "永胜县",
            "code": "0888"
          },
          {
            "name": "华坪县",
            "code": "0888"
          },
          {
            "name": "宁蒗彝族自治县",
            "code": "0888"
          }
        ]
      },
      {
        "name": "普洱市",
        "code": "0879",
        "sub": [
          {
            "name": "思茅区",
            "code": "0879"
          },
          {
            "name": "宁洱哈尼族彝族自治县",
            "code": "0879"
          },
          {
            "name": "墨江哈尼族自治县",
            "code": "0879"
          },
          {
            "name": "景东彝族自治县",
            "code": "0879"
          },
          {
            "name": "景谷傣族彝族自治县",
            "code": "0879"
          },
          {
            "name": "镇沅彝族哈尼族拉祜族自治县",
            "code": "0879"
          },
          {
            "name": "江城哈尼族彝族自治县",
            "code": "0879"
          },
          {
            "name": "孟连傣族拉祜族佤族自治县",
            "code": "0879"
          },
          {
            "name": "澜沧拉祜族自治县",
            "code": "0879"
          },
          {
            "name": "西盟佤族自治县",
            "code": "0879"
          }
        ]
      },
      {
        "name": "临沧市",
        "code": "0883",
        "sub": [
          {
            "name": "临翔区",
            "code": "0883"
          },
          {
            "name": "凤庆县",
            "code": "0883"
          },
          {
            "name": "云县",
            "code": "0883"
          },
          {
            "name": "永德县",
            "code": "0883"
          },
          {
            "name": "镇康县",
            "code": "0883"
          },
          {
            "name": "双江拉祜族佤族布朗族傣族自治县",
            "code": "0883"
          },
          {
            "name": "耿马傣族佤族自治县",
            "code": "0883"
          },
          {
            "name": "沧源佤族自治县",
            "code": "0883"
          }
        ]
      },
      {
        "name": "楚雄彝族自治州",
        "code": "0878",
        "sub": [
          {
            "name": "楚雄市",
            "code": "0878"
          },
          {
            "name": "双柏县",
            "code": "0878"
          },
          {
            "name": "牟定县",
            "code": "0878"
          },
          {
            "name": "南华县",
            "code": "0878"
          },
          {
            "name": "姚安县",
            "code": "0878"
          },
          {
            "name": "大姚县",
            "code": "0878"
          },
          {
            "name": "永仁县",
            "code": "0878"
          },
          {
            "name": "元谋县",
            "code": "0878"
          },
          {
            "name": "武定县",
            "code": "0878"
          },
          {
            "name": "禄丰县",
            "code": "0878"
          }
        ]
      },
      {
        "name": "红河哈尼族彝族自治州",
        "code": "0873",
        "sub": [
          {
            "name": "个旧市",
            "code": "0873"
          },
          {
            "name": "开远市",
            "code": "0873"
          },
          {
            "name": "蒙自市",
            "code": "0873"
          },
          {
            "name": "弥勒市",
            "code": "0873"
          },
          {
            "name": "屏边苗族自治县",
            "code": "0873"
          },
          {
            "name": "建水县",
            "code": "0873"
          },
          {
            "name": "石屏县",
            "code": "0873"
          },
          {
            "name": "泸西县",
            "code": "0873"
          },
          {
            "name": "元阳县",
            "code": "0873"
          },
          {
            "name": "红河县",
            "code": "0873"
          },
          {
            "name": "金平苗族瑶族傣族自治县",
            "code": "0873"
          },
          {
            "name": "绿春县",
            "code": "0873"
          },
          {
            "name": "河口瑶族自治县",
            "code": "0873"
          }
        ]
      },
      {
        "name": "文山壮族苗族自治州",
        "code": "0876",
        "sub": [
          {
            "name": "文山市",
            "code": "0876"
          },
          {
            "name": "砚山县",
            "code": "0876"
          },
          {
            "name": "西畴县",
            "code": "0876"
          },
          {
            "name": "麻栗坡县",
            "code": "0876"
          },
          {
            "name": "马关县",
            "code": "0876"
          },
          {
            "name": "丘北县",
            "code": "0876"
          },
          {
            "name": "广南县",
            "code": "0876"
          },
          {
            "name": "富宁县",
            "code": "0876"
          }
        ]
      },
      {
        "name": "西双版纳傣族自治州",
        "code": "0691",
        "sub": [
          {
            "name": "景洪市",
            "code": "0691"
          },
          {
            "name": "勐海县",
            "code": "0691"
          },
          {
            "name": "勐腊县",
            "code": "0691"
          }
        ]
      },
      {
        "name": "大理白族自治州",
        "code": "0872",
        "sub": [
          {
            "name": "大理市",
            "code": "0872"
          },
          {
            "name": "漾濞彝族自治县",
            "code": "0872"
          },
          {
            "name": "祥云县",
            "code": "0872"
          },
          {
            "name": "宾川县",
            "code": "0872"
          },
          {
            "name": "弥渡县",
            "code": "0872"
          },
          {
            "name": "南涧彝族自治县",
            "code": "0872"
          },
          {
            "name": "巍山彝族回族自治县",
            "code": "0872"
          },
          {
            "name": "永平县",
            "code": "0872"
          },
          {
            "name": "云龙县",
            "code": "0872"
          },
          {
            "name": "洱源县",
            "code": "0872"
          },
          {
            "name": "剑川县",
            "code": "0872"
          },
          {
            "name": "鹤庆县",
            "code": "0872"
          }
        ]
      },
      {
        "name": "德宏傣族景颇族自治州",
        "code": "0692",
        "sub": [
          {
            "name": "瑞丽市",
            "code": "0692"
          },
          {
            "name": "芒市",
            "code": "0692"
          },
          {
            "name": "梁河县",
            "code": "0692"
          },
          {
            "name": "盈江县",
            "code": "0692"
          },
          {
            "name": "陇川县",
            "code": "0692"
          }
        ]
      },
      {
        "name": "怒江傈僳族自治州",
        "code": "0886",
        "sub": [
          {
            "name": "泸水市",
            "code": "0886"
          },
          {
            "name": "福贡县",
            "code": "0886"
          },
          {
            "name": "贡山独龙族怒族自治县",
            "code": "0886"
          },
          {
            "name": "兰坪白族普米族自治县",
            "code": "0886"
          }
        ]
      },
      {
        "name": "迪庆藏族自治州",
        "code": "0887",
        "sub": [
          {
            "name": "香格里拉市",
            "code": "0887"
          },
          {
            "name": "德钦县",
            "code": "0887"
          },
          {
            "name": "维西傈僳族自治县",
            "code": "0887"
          }
        ]
      }
    ]
  },
  {
    "name": "西藏自治区",
    "code": "54",
    "sub": [
      {
        "name": "拉萨市",
        "code": "0891",
        "sub": [
          {
            "name": "城关区",
            "code": "0891"
          },
          {
            "name": "堆龙德庆区",
            "code": "0891"
          },
          {
            "name": "林周县",
            "code": "0891"
          },
          {
            "name": "当雄县",
            "code": "0891"
          },
          {
            "name": "尼木县",
            "code": "0891"
          },
          {
            "name": "曲水县",
            "code": "0891"
          },
          {
            "name": "达孜县",
            "code": "0891"
          },
          {
            "name": "墨竹工卡县",
            "code": "0891"
          }
        ]
      },
      {
        "name": "日喀则市",
        "code": "0892",
        "sub": [
          {
            "name": "桑珠孜区",
            "code": "0892"
          },
          {
            "name": "南木林县",
            "code": "0892"
          },
          {
            "name": "江孜县",
            "code": "0892"
          },
          {
            "name": "定日县",
            "code": "0892"
          },
          {
            "name": "萨迦县",
            "code": "0892"
          },
          {
            "name": "拉孜县",
            "code": "0892"
          },
          {
            "name": "昂仁县",
            "code": "0892"
          },
          {
            "name": "谢通门县",
            "code": "0892"
          },
          {
            "name": "白朗县",
            "code": "0892"
          },
          {
            "name": "仁布县",
            "code": "0892"
          },
          {
            "name": "康马县",
            "code": "0892"
          },
          {
            "name": "定结县",
            "code": "0892"
          },
          {
            "name": "仲巴县",
            "code": "0892"
          },
          {
            "name": "亚东县",
            "code": "0892"
          },
          {
            "name": "吉隆县",
            "code": "0892"
          },
          {
            "name": "聂拉木县",
            "code": "0892"
          },
          {
            "name": "萨嘎县",
            "code": "0892"
          },
          {
            "name": "岗巴县",
            "code": "0892"
          }
        ]
      },
      {
        "name": "昌都市",
        "code": "0895",
        "sub": [
          {
            "name": "卡若区",
            "code": "0895"
          },
          {
            "name": "江达县",
            "code": "0895"
          },
          {
            "name": "贡觉县",
            "code": "0895"
          },
          {
            "name": "类乌齐县",
            "code": "0895"
          },
          {
            "name": "丁青县",
            "code": "0895"
          },
          {
            "name": "察雅县",
            "code": "0895"
          },
          {
            "name": "八宿县",
            "code": "0895"
          },
          {
            "name": "左贡县",
            "code": "0895"
          },
          {
            "name": "芒康县",
            "code": "0895"
          },
          {
            "name": "洛隆县",
            "code": "0895"
          },
          {
            "name": "边坝县",
            "code": "0895"
          }
        ]
      },
      {
        "name": "林芝市",
        "code": "0894",
        "sub": [
          {
            "name": "巴宜区",
            "code": "0894"
          },
          {
            "name": "工布江达县",
            "code": "0894"
          },
          {
            "name": "米林县",
            "code": "0894"
          },
          {
            "name": "墨脱县",
            "code": "0894"
          },
          {
            "name": "波密县",
            "code": "0894"
          },
          {
            "name": "察隅县",
            "code": "0894"
          },
          {
            "name": "朗县",
            "code": "0894"
          }
        ]
      },
      {
        "name": "山南市",
        "code": "0893",
        "sub": [
          {
            "name": "乃东区",
            "code": "0893"
          },
          {
            "name": "扎囊县",
            "code": "0893"
          },
          {
            "name": "贡嘎县",
            "code": "0893"
          },
          {
            "name": "桑日县",
            "code": "0893"
          },
          {
            "name": "琼结县",
            "code": "0893"
          },
          {
            "name": "曲松县",
            "code": "0893"
          },
          {
            "name": "措美县",
            "code": "0893"
          },
          {
            "name": "洛扎县",
            "code": "0893"
          },
          {
            "name": "加查县",
            "code": "0893"
          },
          {
            "name": "隆子县",
            "code": "0893"
          },
          {
            "name": "错那县",
            "code": "0893"
          },
          {
            "name": "浪卡子县",
            "code": "0893"
          }
        ]
      },
      {
        "name": "那曲地区",
        "code": "0896",
        "sub": [
          {
            "name": "那曲县",
            "code": "0896"
          },
          {
            "name": "嘉黎县",
            "code": "0896"
          },
          {
            "name": "比如县",
            "code": "0896"
          },
          {
            "name": "聂荣县",
            "code": "0896"
          },
          {
            "name": "安多县",
            "code": "0896"
          },
          {
            "name": "申扎县",
            "code": "0896"
          },
          {
            "name": "索县",
            "code": "0896"
          },
          {
            "name": "班戈县",
            "code": "0896"
          },
          {
            "name": "巴青县",
            "code": "0896"
          },
          {
            "name": "尼玛县",
            "code": "0896"
          },
          {
            "name": "双湖县",
            "code": "0896"
          }
        ]
      },
      {
        "name": "阿里地区",
        "code": "0897",
        "sub": [
          {
            "name": "普兰县",
            "code": "0897"
          },
          {
            "name": "札达县",
            "code": "0897"
          },
          {
            "name": "噶尔县",
            "code": "0897"
          },
          {
            "name": "日土县",
            "code": "0897"
          },
          {
            "name": "革吉县",
            "code": "0897"
          },
          {
            "name": "改则县",
            "code": "0897"
          },
          {
            "name": "措勤县",
            "code": "0897"
          }
        ]
      }
    ]
  },
  {
    "name": "陕西省",
    "code": "61",
    "sub": [
      {
        "name": "西安市",
        "code": "029",
        "sub": [
          {
            "name": "新城区",
            "code": "029"
          },
          {
            "name": "碑林区",
            "code": "029"
          },
          {
            "name": "莲湖区",
            "code": "029"
          },
          {
            "name": "灞桥区",
            "code": "029"
          },
          {
            "name": "未央区",
            "code": "029"
          },
          {
            "name": "雁塔区",
            "code": "029"
          },
          {
            "name": "阎良区",
            "code": "029"
          },
          {
            "name": "临潼区",
            "code": "029"
          },
          {
            "name": "长安区",
            "code": "029"
          },
          {
            "name": "高陵区",
            "code": "029"
          },
          {
            "name": "蓝田县",
            "code": "029"
          },
          {
            "name": "周至县",
            "code": "029"
          },
          {
            "name": "鄠邑区",
            "code": "029"
          }
        ]
      },
      {
        "name": "铜川市",
        "code": "0919",
        "sub": [
          {
            "name": "王益区",
            "code": "0919"
          },
          {
            "name": "印台区",
            "code": "0919"
          },
          {
            "name": "耀州区",
            "code": "0919"
          },
          {
            "name": "宜君县",
            "code": "0919"
          }
        ]
      },
      {
        "name": "宝鸡市",
        "code": "0917",
        "sub": [
          {
            "name": "渭滨区",
            "code": "0917"
          },
          {
            "name": "金台区",
            "code": "0917"
          },
          {
            "name": "陈仓区",
            "code": "0917"
          },
          {
            "name": "凤翔县",
            "code": "0917"
          },
          {
            "name": "岐山县",
            "code": "0917"
          },
          {
            "name": "扶风县",
            "code": "0917"
          },
          {
            "name": "眉县",
            "code": "0917"
          },
          {
            "name": "陇县",
            "code": "0917"
          },
          {
            "name": "千阳县",
            "code": "0917"
          },
          {
            "name": "麟游县",
            "code": "0917"
          },
          {
            "name": "凤县",
            "code": "0917"
          },
          {
            "name": "太白县",
            "code": "0917"
          }
        ]
      },
      {
        "name": "咸阳市",
        "code": "0910",
        "sub": [
          {
            "name": "秦都区",
            "code": "0910"
          },
          {
            "name": "杨陵区",
            "code": "0910"
          },
          {
            "name": "渭城区",
            "code": "0910"
          },
          {
            "name": "三原县",
            "code": "0910"
          },
          {
            "name": "泾阳县",
            "code": "0910"
          },
          {
            "name": "乾县",
            "code": "0910"
          },
          {
            "name": "礼泉县",
            "code": "0910"
          },
          {
            "name": "永寿县",
            "code": "0910"
          },
          {
            "name": "彬县",
            "code": "0910"
          },
          {
            "name": "长武县",
            "code": "0910"
          },
          {
            "name": "旬邑县",
            "code": "0910"
          },
          {
            "name": "淳化县",
            "code": "0910"
          },
          {
            "name": "武功县",
            "code": "0910"
          },
          {
            "name": "兴平市",
            "code": "0910"
          }
        ]
      },
      {
        "name": "渭南市",
        "code": "0913",
        "sub": [
          {
            "name": "临渭区",
            "code": "0913"
          },
          {
            "name": "华州区",
            "code": "0913"
          },
          {
            "name": "潼关县",
            "code": "0913"
          },
          {
            "name": "大荔县",
            "code": "0913"
          },
          {
            "name": "合阳县",
            "code": "0913"
          },
          {
            "name": "澄城县",
            "code": "0913"
          },
          {
            "name": "蒲城县",
            "code": "0913"
          },
          {
            "name": "白水县",
            "code": "0913"
          },
          {
            "name": "富平县",
            "code": "0913"
          },
          {
            "name": "韩城市",
            "code": "0913"
          },
          {
            "name": "华阴市",
            "code": "0913"
          }
        ]
      },
      {
        "name": "延安市",
        "code": "0911",
        "sub": [
          {
            "name": "宝塔区",
            "code": "0911"
          },
          {
            "name": "延长县",
            "code": "0911"
          },
          {
            "name": "延川县",
            "code": "0911"
          },
          {
            "name": "子长县",
            "code": "0911"
          },
          {
            "name": "安塞区",
            "code": "0911"
          },
          {
            "name": "志丹县",
            "code": "0911"
          },
          {
            "name": "吴起县",
            "code": "0911"
          },
          {
            "name": "甘泉县",
            "code": "0911"
          },
          {
            "name": "富县",
            "code": "0911"
          },
          {
            "name": "洛川县",
            "code": "0911"
          },
          {
            "name": "宜川县",
            "code": "0911"
          },
          {
            "name": "黄龙县",
            "code": "0911"
          },
          {
            "name": "黄陵县",
            "code": "0911"
          }
        ]
      },
      {
        "name": "汉中市",
        "code": "0916",
        "sub": [
          {
            "name": "汉台区",
            "code": "0916"
          },
          {
            "name": "南郑县",
            "code": "0916"
          },
          {
            "name": "城固县",
            "code": "0916"
          },
          {
            "name": "洋县",
            "code": "0916"
          },
          {
            "name": "西乡县",
            "code": "0916"
          },
          {
            "name": "勉县",
            "code": "0916"
          },
          {
            "name": "宁强县",
            "code": "0916"
          },
          {
            "name": "略阳县",
            "code": "0916"
          },
          {
            "name": "镇巴县",
            "code": "0916"
          },
          {
            "name": "留坝县",
            "code": "0916"
          },
          {
            "name": "佛坪县",
            "code": "0916"
          }
        ]
      },
      {
        "name": "榆林市",
        "code": "0912",
        "sub": [
          {
            "name": "榆阳区",
            "code": "0912"
          },
          {
            "name": "横山区",
            "code": "0912"
          },
          {
            "name": "神木市",
            "code": "0912"
          },
          {
            "name": "府谷县",
            "code": "0912"
          },
          {
            "name": "靖边县",
            "code": "0912"
          },
          {
            "name": "定边县",
            "code": "0912"
          },
          {
            "name": "绥德县",
            "code": "0912"
          },
          {
            "name": "米脂县",
            "code": "0912"
          },
          {
            "name": "佳县",
            "code": "0912"
          },
          {
            "name": "吴堡县",
            "code": "0912"
          },
          {
            "name": "清涧县",
            "code": "0912"
          },
          {
            "name": "子洲县",
            "code": "0912"
          }
        ]
      },
      {
        "name": "安康市",
        "code": "0915",
        "sub": [
          {
            "name": "汉滨区",
            "code": "0915"
          },
          {
            "name": "汉阴县",
            "code": "0915"
          },
          {
            "name": "石泉县",
            "code": "0915"
          },
          {
            "name": "宁陕县",
            "code": "0915"
          },
          {
            "name": "紫阳县",
            "code": "0915"
          },
          {
            "name": "岚皋县",
            "code": "0915"
          },
          {
            "name": "平利县",
            "code": "0915"
          },
          {
            "name": "镇坪县",
            "code": "0915"
          },
          {
            "name": "旬阳县",
            "code": "0915"
          },
          {
            "name": "白河县",
            "code": "0915"
          }
        ]
      },
      {
        "name": "商洛市",
        "code": "0914",
        "sub": [
          {
            "name": "商州区",
            "code": "0914"
          },
          {
            "name": "洛南县",
            "code": "0914"
          },
          {
            "name": "丹凤县",
            "code": "0914"
          },
          {
            "name": "商南县",
            "code": "0914"
          },
          {
            "name": "山阳县",
            "code": "0914"
          },
          {
            "name": "镇安县",
            "code": "0914"
          },
          {
            "name": "柞水县",
            "code": "0914"
          }
        ]
      }
    ]
  },
  {
    "name": "甘肃省",
    "code": "62",
    "sub": [
      {
        "name": "兰州市",
        "code": "0931",
        "sub": [
          {
            "name": "城关区",
            "code": "0931"
          },
          {
            "name": "七里河区",
            "code": "0931"
          },
          {
            "name": "西固区",
            "code": "0931"
          },
          {
            "name": "安宁区",
            "code": "0931"
          },
          {
            "name": "红古区",
            "code": "0931"
          },
          {
            "name": "永登县",
            "code": "0931"
          },
          {
            "name": "皋兰县",
            "code": "0931"
          },
          {
            "name": "榆中县",
            "code": "0931"
          }
        ]
      },
      {
        "name": "嘉峪关市",
        "code": "1937",
        "sub": []
      },
      {
        "name": "金昌市",
        "code": "0935",
        "sub": [
          {
            "name": "金川区",
            "code": "0935"
          },
          {
            "name": "永昌县",
            "code": "0935"
          }
        ]
      },
      {
        "name": "白银市",
        "code": "0943",
        "sub": [
          {
            "name": "白银区",
            "code": "0943"
          },
          {
            "name": "平川区",
            "code": "0943"
          },
          {
            "name": "靖远县",
            "code": "0943"
          },
          {
            "name": "会宁县",
            "code": "0943"
          },
          {
            "name": "景泰县",
            "code": "0943"
          }
        ]
      },
      {
        "name": "天水市",
        "code": "0938",
        "sub": [
          {
            "name": "秦州区",
            "code": "0938"
          },
          {
            "name": "麦积区",
            "code": "0938"
          },
          {
            "name": "清水县",
            "code": "0938"
          },
          {
            "name": "秦安县",
            "code": "0938"
          },
          {
            "name": "甘谷县",
            "code": "0938"
          },
          {
            "name": "武山县",
            "code": "0938"
          },
          {
            "name": "张家川回族自治县",
            "code": "0938"
          }
        ]
      },
      {
        "name": "武威市",
        "code": "1935",
        "sub": [
          {
            "name": "凉州区",
            "code": "1935"
          },
          {
            "name": "民勤县",
            "code": "1935"
          },
          {
            "name": "古浪县",
            "code": "1935"
          },
          {
            "name": "天祝藏族自治县",
            "code": "1935"
          }
        ]
      },
      {
        "name": "张掖市",
        "code": "0936",
        "sub": [
          {
            "name": "甘州区",
            "code": "0936"
          },
          {
            "name": "肃南裕固族自治县",
            "code": "0936"
          },
          {
            "name": "民乐县",
            "code": "0936"
          },
          {
            "name": "临泽县",
            "code": "0936"
          },
          {
            "name": "高台县",
            "code": "0936"
          },
          {
            "name": "山丹县",
            "code": "0936"
          }
        ]
      },
      {
        "name": "平凉市",
        "code": "0933",
        "sub": [
          {
            "name": "崆峒区",
            "code": "0933"
          },
          {
            "name": "泾川县",
            "code": "0933"
          },
          {
            "name": "灵台县",
            "code": "0933"
          },
          {
            "name": "崇信县",
            "code": "0933"
          },
          {
            "name": "华亭县",
            "code": "0933"
          },
          {
            "name": "庄浪县",
            "code": "0933"
          },
          {
            "name": "静宁县",
            "code": "0933"
          }
        ]
      },
      {
        "name": "酒泉市",
        "code": "0937",
        "sub": [
          {
            "name": "肃州区",
            "code": "0937"
          },
          {
            "name": "金塔县",
            "code": "0937"
          },
          {
            "name": "瓜州县",
            "code": "0937"
          },
          {
            "name": "肃北蒙古族自治县",
            "code": "0937"
          },
          {
            "name": "阿克塞哈萨克族自治县",
            "code": "0937"
          },
          {
            "name": "玉门市",
            "code": "0937"
          },
          {
            "name": "敦煌市",
            "code": "0937"
          }
        ]
      },
      {
        "name": "庆阳市",
        "code": "0934",
        "sub": [
          {
            "name": "西峰区",
            "code": "0934"
          },
          {
            "name": "庆城县",
            "code": "0934"
          },
          {
            "name": "环县",
            "code": "0934"
          },
          {
            "name": "华池县",
            "code": "0934"
          },
          {
            "name": "合水县",
            "code": "0934"
          },
          {
            "name": "正宁县",
            "code": "0934"
          },
          {
            "name": "宁县",
            "code": "0934"
          },
          {
            "name": "镇原县",
            "code": "0934"
          }
        ]
      },
      {
        "name": "定西市",
        "code": "0932",
        "sub": [
          {
            "name": "安定区",
            "code": "0932"
          },
          {
            "name": "通渭县",
            "code": "0932"
          },
          {
            "name": "陇西县",
            "code": "0932"
          },
          {
            "name": "渭源县",
            "code": "0932"
          },
          {
            "name": "临洮县",
            "code": "0932"
          },
          {
            "name": "漳县",
            "code": "0932"
          },
          {
            "name": "岷县",
            "code": "0932"
          }
        ]
      },
      {
        "name": "陇南市",
        "code": "2935",
        "sub": [
          {
            "name": "武都区",
            "code": "2935"
          },
          {
            "name": "成县",
            "code": "2935"
          },
          {
            "name": "文县",
            "code": "2935"
          },
          {
            "name": "宕昌县",
            "code": "2935"
          },
          {
            "name": "康县",
            "code": "2935"
          },
          {
            "name": "西和县",
            "code": "2935"
          },
          {
            "name": "礼县",
            "code": "2935"
          },
          {
            "name": "徽县",
            "code": "2935"
          },
          {
            "name": "两当县",
            "code": "2935"
          }
        ]
      },
      {
        "name": "临夏回族自治州",
        "code": "0930",
        "sub": [
          {
            "name": "临夏市",
            "code": "0930"
          },
          {
            "name": "临夏县",
            "code": "0930"
          },
          {
            "name": "康乐县",
            "code": "0930"
          },
          {
            "name": "永靖县",
            "code": "0930"
          },
          {
            "name": "广河县",
            "code": "0930"
          },
          {
            "name": "和政县",
            "code": "0930"
          },
          {
            "name": "东乡族自治县",
            "code": "0930"
          },
          {
            "name": "积石山保安族东乡族撒拉族自治县",
            "code": "0930"
          }
        ]
      },
      {
        "name": "甘南藏族自治州",
        "code": "0941",
        "sub": [
          {
            "name": "合作市",
            "code": "0941"
          },
          {
            "name": "临潭县",
            "code": "0941"
          },
          {
            "name": "卓尼县",
            "code": "0941"
          },
          {
            "name": "舟曲县",
            "code": "0941"
          },
          {
            "name": "迭部县",
            "code": "0941"
          },
          {
            "name": "玛曲县",
            "code": "0941"
          },
          {
            "name": "碌曲县",
            "code": "0941"
          },
          {
            "name": "夏河县",
            "code": "0941"
          }
        ]
      }
    ]
  },
  {
    "name": "青海省",
    "code": "63",
    "sub": [
      {
        "name": "西宁市",
        "code": "0971",
        "sub": [
          {
            "name": "城东区",
            "code": "0971"
          },
          {
            "name": "城中区",
            "code": "0971"
          },
          {
            "name": "城西区",
            "code": "0971"
          },
          {
            "name": "城北区",
            "code": "0971"
          },
          {
            "name": "大通回族土族自治县",
            "code": "0971"
          },
          {
            "name": "湟中县",
            "code": "0971"
          },
          {
            "name": "湟源县",
            "code": "0971"
          }
        ]
      },
      {
        "name": "海东市",
        "code": "0972",
        "sub": [
          {
            "name": "乐都区",
            "code": "0972"
          },
          {
            "name": "平安区",
            "code": "0972"
          },
          {
            "name": "民和回族土族自治县",
            "code": "0972"
          },
          {
            "name": "互助土族自治县",
            "code": "0972"
          },
          {
            "name": "化隆回族自治县",
            "code": "0972"
          },
          {
            "name": "循化撒拉族自治县",
            "code": "0972"
          }
        ]
      },
      {
        "name": "海北藏族自治州",
        "code": "0970",
        "sub": [
          {
            "name": "门源回族自治县",
            "code": "0970"
          },
          {
            "name": "祁连县",
            "code": "0970"
          },
          {
            "name": "海晏县",
            "code": "0970"
          },
          {
            "name": "刚察县",
            "code": "0970"
          }
        ]
      },
      {
        "name": "黄南藏族自治州",
        "code": "0973",
        "sub": [
          {
            "name": "同仁县",
            "code": "0973"
          },
          {
            "name": "尖扎县",
            "code": "0973"
          },
          {
            "name": "泽库县",
            "code": "0973"
          },
          {
            "name": "河南蒙古族自治县",
            "code": "0973"
          }
        ]
      },
      {
        "name": "海南藏族自治州",
        "code": "0974",
        "sub": [
          {
            "name": "共和县",
            "code": "0974"
          },
          {
            "name": "同德县",
            "code": "0974"
          },
          {
            "name": "贵德县",
            "code": "0974"
          },
          {
            "name": "兴海县",
            "code": "0974"
          },
          {
            "name": "贵南县",
            "code": "0974"
          }
        ]
      },
      {
        "name": "果洛藏族自治州",
        "code": "0975",
        "sub": [
          {
            "name": "玛沁县",
            "code": "0975"
          },
          {
            "name": "班玛县",
            "code": "0975"
          },
          {
            "name": "甘德县",
            "code": "0975"
          },
          {
            "name": "达日县",
            "code": "0975"
          },
          {
            "name": "久治县",
            "code": "0975"
          },
          {
            "name": "玛多县",
            "code": "0975"
          }
        ]
      },
      {
        "name": "玉树藏族自治州",
        "code": "0976",
        "sub": [
          {
            "name": "玉树市",
            "code": "0976"
          },
          {
            "name": "杂多县",
            "code": "0976"
          },
          {
            "name": "称多县",
            "code": "0976"
          },
          {
            "name": "治多县",
            "code": "0976"
          },
          {
            "name": "囊谦县",
            "code": "0976"
          },
          {
            "name": "曲麻莱县",
            "code": "0976"
          }
        ]
      },
      {
        "name": "海西蒙古族藏族自治州",
        "code": "0977",
        "sub": [
          {
            "name": "格尔木市",
            "code": "0977"
          },
          {
            "name": "德令哈市",
            "code": "0977"
          },
          {
            "name": "乌兰县",
            "code": "0977"
          },
          {
            "name": "都兰县",
            "code": "0977"
          },
          {
            "name": "天峻县",
            "code": "0977"
          },
          {
            "name": "海西蒙古族藏族自治州直辖",
            "code": "0977"
          }
        ]
      }
    ]
  },
  {
    "name": "宁夏回族自治区",
    "code": "64",
    "sub": [
      {
        "name": "银川市",
        "code": "0951",
        "sub": [
          {
            "name": "兴庆区",
            "code": "0951"
          },
          {
            "name": "西夏区",
            "code": "0951"
          },
          {
            "name": "金凤区",
            "code": "0951"
          },
          {
            "name": "永宁县",
            "code": "0951"
          },
          {
            "name": "贺兰县",
            "code": "0951"
          },
          {
            "name": "灵武市",
            "code": "0951"
          }
        ]
      },
      {
        "name": "石嘴山市",
        "code": "0952",
        "sub": [
          {
            "name": "大武口区",
            "code": "0952"
          },
          {
            "name": "惠农区",
            "code": "0952"
          },
          {
            "name": "平罗县",
            "code": "0952"
          }
        ]
      },
      {
        "name": "吴忠市",
        "code": "0953",
        "sub": [
          {
            "name": "利通区",
            "code": "0953"
          },
          {
            "name": "红寺堡区",
            "code": "0953"
          },
          {
            "name": "盐池县",
            "code": "0953"
          },
          {
            "name": "同心县",
            "code": "0953"
          },
          {
            "name": "青铜峡市",
            "code": "0953"
          }
        ]
      },
      {
        "name": "固原市",
        "code": "0954",
        "sub": [
          {
            "name": "原州区",
            "code": "0954"
          },
          {
            "name": "西吉县",
            "code": "0954"
          },
          {
            "name": "隆德县",
            "code": "0954"
          },
          {
            "name": "泾源县",
            "code": "0954"
          },
          {
            "name": "彭阳县",
            "code": "0954"
          }
        ]
      },
      {
        "name": "中卫市",
        "code": "1953",
        "sub": [
          {
            "name": "沙坡头区",
            "code": "1953"
          },
          {
            "name": "中宁县",
            "code": "1953"
          },
          {
            "name": "海原县",
            "code": "1953"
          }
        ]
      }
    ]
  },
  {
    "name": "新疆维吾尔自治区",
    "code": "65",
    "sub": [
      {
        "name": "阿拉尔市",
        "code": "1997",
        "sub": []
      },
      {
        "name": "北屯市",
        "code": "1906",
        "sub": []
      },
      {
        "name": "可克达拉市",
        "code": "1999",
        "sub": []
      },
      {
        "name": "昆玉市",
        "code": "1903",
        "sub": []
      },
      {
        "name": "石河子市",
        "code": "0993",
        "sub": []
      },
      {
        "name": "双河市",
        "code": "1909",
        "sub": []
      },
      {
        "name": "乌鲁木齐市",
        "code": "0991",
        "sub": [
          {
            "name": "天山区",
            "code": "0991"
          },
          {
            "name": "沙依巴克区",
            "code": "0991"
          },
          {
            "name": "新市区",
            "code": "0991"
          },
          {
            "name": "水磨沟区",
            "code": "0991"
          },
          {
            "name": "头屯河区",
            "code": "0991"
          },
          {
            "name": "达坂城区",
            "code": "0991"
          },
          {
            "name": "米东区",
            "code": "0991"
          },
          {
            "name": "乌鲁木齐县",
            "code": "0991"
          }
        ]
      },
      {
        "name": "克拉玛依市",
        "code": "0990",
        "sub": [
          {
            "name": "独山子区",
            "code": "0990"
          },
          {
            "name": "克拉玛依区",
            "code": "0990"
          },
          {
            "name": "白碱滩区",
            "code": "0990"
          },
          {
            "name": "乌尔禾区",
            "code": "0990"
          }
        ]
      },
      {
        "name": "吐鲁番市",
        "code": "0995",
        "sub": [
          {
            "name": "高昌区",
            "code": "0995"
          },
          {
            "name": "鄯善县",
            "code": "0995"
          },
          {
            "name": "托克逊县",
            "code": "0995"
          }
        ]
      },
      {
        "name": "哈密市",
        "code": "0902",
        "sub": [
          {
            "name": "伊州区",
            "code": "0902"
          },
          {
            "name": "巴里坤哈萨克自治县",
            "code": "0902"
          },
          {
            "name": "伊吾县",
            "code": "0902"
          }
        ]
      },
      {
        "name": "昌吉回族自治州",
        "code": "0994",
        "sub": [
          {
            "name": "昌吉市",
            "code": "0994"
          },
          {
            "name": "阜康市",
            "code": "0994"
          },
          {
            "name": "呼图壁县",
            "code": "0994"
          },
          {
            "name": "玛纳斯县",
            "code": "0994"
          },
          {
            "name": "奇台县",
            "code": "0994"
          },
          {
            "name": "吉木萨尔县",
            "code": "0994"
          },
          {
            "name": "木垒哈萨克自治县",
            "code": "0994"
          }
        ]
      },
      {
        "name": "博尔塔拉蒙古自治州",
        "code": "0909",
        "sub": [
          {
            "name": "博乐市",
            "code": "0909"
          },
          {
            "name": "阿拉山口市",
            "code": "0909"
          },
          {
            "name": "精河县",
            "code": "0909"
          },
          {
            "name": "温泉县",
            "code": "0909"
          }
        ]
      },
      {
        "name": "巴音郭楞蒙古自治州",
        "code": "0996",
        "sub": [
          {
            "name": "库尔勒市",
            "code": "0996"
          },
          {
            "name": "轮台县",
            "code": "0996"
          },
          {
            "name": "尉犁县",
            "code": "0996"
          },
          {
            "name": "若羌县",
            "code": "0996"
          },
          {
            "name": "且末县",
            "code": "0996"
          },
          {
            "name": "焉耆回族自治县",
            "code": "0996"
          },
          {
            "name": "和静县",
            "code": "0996"
          },
          {
            "name": "和硕县",
            "code": "0996"
          },
          {
            "name": "博湖县",
            "code": "0996"
          }
        ]
      },
      {
        "name": "阿克苏地区",
        "code": "0997",
        "sub": [
          {
            "name": "阿克苏市",
            "code": "0997"
          },
          {
            "name": "温宿县",
            "code": "0997"
          },
          {
            "name": "库车县",
            "code": "0997"
          },
          {
            "name": "沙雅县",
            "code": "0997"
          },
          {
            "name": "新和县",
            "code": "0997"
          },
          {
            "name": "拜城县",
            "code": "0997"
          },
          {
            "name": "乌什县",
            "code": "0997"
          },
          {
            "name": "阿瓦提县",
            "code": "0997"
          },
          {
            "name": "柯坪县",
            "code": "0997"
          }
        ]
      },
      {
        "name": "克孜勒苏柯尔克孜自治州",
        "code": "0908",
        "sub": [
          {
            "name": "阿图什市",
            "code": "0908"
          },
          {
            "name": "阿克陶县",
            "code": "0908"
          },
          {
            "name": "阿合奇县",
            "code": "0908"
          },
          {
            "name": "乌恰县",
            "code": "0908"
          }
        ]
      },
      {
        "name": "喀什地区",
        "code": "0998",
        "sub": [
          {
            "name": "喀什市",
            "code": "0998"
          },
          {
            "name": "疏附县",
            "code": "0998"
          },
          {
            "name": "疏勒县",
            "code": "0998"
          },
          {
            "name": "英吉沙县",
            "code": "0998"
          },
          {
            "name": "泽普县",
            "code": "0998"
          },
          {
            "name": "莎车县",
            "code": "0998"
          },
          {
            "name": "叶城县",
            "code": "0998"
          },
          {
            "name": "麦盖提县",
            "code": "0998"
          },
          {
            "name": "岳普湖县",
            "code": "0998"
          },
          {
            "name": "伽师县",
            "code": "0998"
          },
          {
            "name": "巴楚县",
            "code": "0998"
          },
          {
            "name": "塔什库尔干塔吉克自治县",
            "code": "0998"
          }
        ]
      },
      {
        "name": "和田地区",
        "code": "0903",
        "sub": [
          {
            "name": "和田市",
            "code": "0903"
          },
          {
            "name": "和田县",
            "code": "0903"
          },
          {
            "name": "墨玉县",
            "code": "0903"
          },
          {
            "name": "皮山县",
            "code": "0903"
          },
          {
            "name": "洛浦县",
            "code": "0903"
          },
          {
            "name": "策勒县",
            "code": "0903"
          },
          {
            "name": "于田县",
            "code": "0903"
          },
          {
            "name": "民丰县",
            "code": "0903"
          }
        ]
      },
      {
        "name": "伊犁哈萨克自治州",
        "code": "0999",
        "sub": [
          {
            "name": "伊宁市",
            "code": "0999"
          },
          {
            "name": "奎屯市",
            "code": "0999"
          },
          {
            "name": "霍尔果斯市",
            "code": "0999"
          },
          {
            "name": "伊宁县",
            "code": "0999"
          },
          {
            "name": "察布查尔锡伯自治县",
            "code": "0999"
          },
          {
            "name": "霍城县",
            "code": "0999"
          },
          {
            "name": "巩留县",
            "code": "0999"
          },
          {
            "name": "新源县",
            "code": "0999"
          },
          {
            "name": "昭苏县",
            "code": "0999"
          },
          {
            "name": "特克斯县",
            "code": "0999"
          },
          {
            "name": "尼勒克县",
            "code": "0999"
          }
        ]
      },
      {
        "name": "塔城地区",
        "code": "0901",
        "sub": [
          {
            "name": "塔城市",
            "code": "0901"
          },
          {
            "name": "乌苏市",
            "code": "0901"
          },
          {
            "name": "额敏县",
            "code": "0901"
          },
          {
            "name": "沙湾县",
            "code": "0901"
          },
          {
            "name": "托里县",
            "code": "0901"
          },
          {
            "name": "裕民县",
            "code": "0901"
          },
          {
            "name": "和布克赛尔蒙古自治县",
            "code": "0901"
          }
        ]
      },
      {
        "name": "阿勒泰地区",
        "code": "0906",
        "sub": [
          {
            "name": "阿勒泰市",
            "code": "0906"
          },
          {
            "name": "布尔津县",
            "code": "0906"
          },
          {
            "name": "富蕴县",
            "code": "0906"
          },
          {
            "name": "福海县",
            "code": "0906"
          },
          {
            "name": "哈巴河县",
            "code": "0906"
          },
          {
            "name": "青河县",
            "code": "0906"
          },
          {
            "name": "吉木乃县",
            "code": "0906"
          }
        ]
      },
      {
        "name": "铁门关市",
        "code": "1996",
        "sub": []
      },
      {
        "name": "图木舒克市",
        "code": "1998",
        "sub": []
      },
      {
        "name": "五家渠市",
        "code": "1994",
        "sub": []
      }
    ]
  },
  {
    "name": "台湾省",
    "code": "71",
    "sub": []
  },
  {
    "name": "香港特别行政区",
    "code": "81",
    "sub": []
  },
  {
    "name": "澳门特别行政区",
    "code": "91",
    "sub": []
  }
].forEach((v, vi) => {
  province_list[v.code.padEnd(6, 0)] = v.name;
  areaDatas.province_list = province_list;
  v.sub.forEach((z, zi) => {
    let cityCode = zi + 1;
    let str = `${v.code}${cityCode < 10 ? '0' + cityCode : cityCode}`;
    city_list[str.padEnd(6, 0)] = z.name;
    areaDatas.city_list = city_list;
    z.sub.forEach((x, xi) => {
      let countyCode = xi + 1;
      let str = `${v.code}${cityCode < 10 ? '0' + cityCode : cityCode}${countyCode < 10 ? '0' + countyCode : countyCode}`;
      county_list[str.padEnd(6, 0)] = x.name;
      areaDatas.county_list = county_list;
    })
  })
});


export default areaDatas
